[
  {
    "word": "anyway",
    "zh": "不管怎样",
    "pos": "adv.",
    "ipa": "",
    "ex": "Anyway, let's move on to the next agenda item.",
    "ex2": "We argued about the venue for hours, but the party went ahead anyway."
  },
  {
    "word": "by the way",
    "zh": "顺便说一下",
    "pos": "phr.",
    "ipa": "",
    "ex": "By the way, did you get my email about the deadline?",
    "ex2": "By the way, I heard that the conference has been moved to March."
  },
  {
    "word": "actually",
    "zh": "实际上",
    "pos": "adv.",
    "ipa": "",
    "ex": "Actually, I prefer the first option you mentioned.",
    "ex2": "I thought the test would be hard, but it was actually quite straightforward."
  },
  {
    "word": "unfortunately",
    "zh": "不幸的是",
    "pos": "adv.",
    "ipa": "",
    "ex": "Unfortunately, the flight was cancelled due to bad weather.",
    "ex2": "Unfortunately, all the tickets for Saturday's show have already been sold out."
  },
  {
    "word": "luckily",
    "zh": "幸运地",
    "pos": "adv.",
    "ipa": "",
    "ex": "Luckily, we found a taxi right away.",
    "ex2": "Luckily, she had brought an umbrella, so she stayed dry during the heavy rain."
  },
  {
    "word": "obviously",
    "zh": "显然",
    "pos": "adv.",
    "ipa": "",
    "ex": "Obviously, we need a better plan before the launch.",
    "ex2": "He was obviously exhausted after working three consecutive overnight shifts."
  },
  {
    "word": "basically",
    "zh": "基本上",
    "pos": "adv.",
    "ipa": "",
    "ex": "Basically, we need to start the whole process over.",
    "ex2": "The new version is basically the same as before, with just a few minor improvements."
  },
  {
    "word": "generally",
    "zh": "通常 / 一般来说",
    "pos": "adv.",
    "ipa": "",
    "ex": "Generally, the bus arrives every ten minutes.",
    "ex2": "Generally speaking, people who exercise regularly tend to sleep much better at night."
  },
  {
    "word": "specifically",
    "zh": "具体地说",
    "pos": "adv.",
    "ipa": "",
    "ex": "Can you be more specific about the project deadline?",
    "ex2": "She was specifically asked not to share the report with external parties."
  },
  {
    "word": "what do you mean",
    "zh": "你什么意思",
    "pos": "phr.",
    "ipa": "",
    "ex": "What do you mean by 'unacceptable results'?",
    "ex2": "What do you mean the system is down? We have a client demo in thirty minutes!"
  },
  {
    "word": "in other words",
    "zh": "换句话说",
    "pos": "phr.",
    "ipa": "",
    "ex": "In other words, we've completely run out of budget.",
    "ex2": "The proposal was rejected by all three reviewers. In other words, we need to start over."
  },
  {
    "word": "for example",
    "zh": "例如",
    "pos": "phr.",
    "ipa": "",
    "ex": "For example, we could use email or a project tool.",
    "ex2": "Many daily habits—for example, brushing your teeth or making coffee—become fully automatic over time."
  },
  {
    "word": "however",
    "zh": "然而",
    "pos": "conj.",
    "ipa": "",
    "ex": "The price is high; however, the quality is excellent.",
    "ex2": "He studied hard for months; however, he still found the final exam extremely challenging."
  },
  {
    "word": "therefore",
    "zh": "因此",
    "pos": "conj.",
    "ipa": "",
    "ex": "The meeting ran late; therefore, we skipped lunch.",
    "ex2": "The road was icy and visibility was poor; therefore, drivers were advised to stay home."
  },
  {
    "word": "furthermore",
    "zh": "此外",
    "pos": "adv.",
    "ipa": "",
    "ex": "Furthermore, the new system saves 30% in operating costs.",
    "ex2": "The candidate has ten years of experience. Furthermore, she speaks three languages fluently."
  },
  {
    "word": "in addition",
    "zh": "另外",
    "pos": "phr.",
    "ipa": "",
    "ex": "In addition to English, she speaks French and Spanish.",
    "ex2": "In addition to fixing the bug, the team also optimised the entire database query process."
  },
  {
    "word": "on the other hand",
    "zh": "另一方面",
    "pos": "phr.",
    "ipa": "",
    "ex": "On the other hand, remote work has many clear advantages.",
    "ex2": "City life offers great convenience; on the other hand, it can be noisy and stressful."
  },
  {
    "word": "as a result",
    "zh": "因此 / 结果",
    "pos": "phr.",
    "ipa": "",
    "ex": "As a result, sales increased by 20% this quarter.",
    "ex2": "The factory had to close temporarily; as a result, hundreds of workers lost their income."
  },
  {
    "word": "in conclusion",
    "zh": "总结来说",
    "pos": "phr.",
    "ipa": "",
    "ex": "In conclusion, I recommend we proceed with option B.",
    "ex2": "In conclusion, the research shows that regular breaks significantly improve long-term productivity."
  },
  {
    "word": "I don't understand",
    "zh": "我不明白",
    "pos": "phr.",
    "ipa": "",
    "ex": "I don't understand. Could you explain that again, please?",
    "ex2": "I don't understand why the project was cancelled after so much work had already been done."
  },
  {
    "word": "could you repeat that",
    "zh": "能再说一遍吗",
    "pos": "phr.",
    "ipa": "",
    "ex": "Could you repeat that? I missed the last part.",
    "ex2": "Could you repeat that more slowly? The connection is breaking up on my end."
  },
  {
    "word": "speak slowly please",
    "zh": "请说慢一点",
    "pos": "phr.",
    "ipa": "",
    "ex": "Speak slowly please—English isn't my first language.",
    "ex2": "Speak slowly please—I need to take notes while you are talking."
  },
  {
    "word": "I'm not sure",
    "zh": "我不确定",
    "pos": "phr.",
    "ipa": "",
    "ex": "I'm not sure about the exact figures—let me check.",
    "ex2": "I'm not sure whether the meeting has been rescheduled, so please confirm before you come."
  },
  {
    "word": "cook dinner",
    "zh": "做晚饭",
    "pos": "phr.",
    "ipa": "",
    "ex": "Let's cook dinner at home instead of eating out tonight.",
    "ex2": "She cooked dinner for eight people entirely from scratch, which took over three hours."
  },
  {
    "word": "do laundry",
    "zh": "洗衣服",
    "pos": "phr.",
    "ipa": "",
    "ex": "I do laundry every Sunday afternoon.",
    "ex2": "He did all the laundry while she was studying for her final exams."
  },
  {
    "word": "vacuum",
    "zh": "用吸尘器打扫",
    "pos": "v.",
    "ipa": "",
    "ex": "Could you vacuum the living room before the guests arrive?",
    "ex2": "She vacuumed the entire apartment and then mopped all the floors before moving in."
  },
  {
    "word": "take out the trash",
    "zh": "倒垃圾",
    "pos": "phr.",
    "ipa": "",
    "ex": "Please take out the trash—the bin is overflowing!",
    "ex2": "He always took out the trash on Tuesday nights before the collection lorry came."
  },
  {
    "word": "alarm",
    "zh": "闹钟",
    "pos": "n.",
    "ipa": "",
    "ex": "Set an alarm for 6:30 so we don't oversleep.",
    "ex2": "She set three separate alarms because she was terrified of missing her early morning flight."
  },
  {
    "word": "microwave",
    "zh": "微波炉",
    "pos": "n.",
    "ipa": "",
    "ex": "Heat the soup in the microwave for two minutes.",
    "ex2": "He microwaved yesterday's leftovers quickly and ate lunch at his desk."
  },
  {
    "word": "oven",
    "zh": "烤箱",
    "pos": "n.",
    "ipa": "",
    "ex": "Preheat the oven to 200 degrees Celsius before baking.",
    "ex2": "She baked three different dishes in the oven at once to prepare for the dinner party."
  },
  {
    "word": "washing machine",
    "zh": "洗衣机",
    "pos": "n.",
    "ipa": "",
    "ex": "The washing machine finished—please hang the clothes out.",
    "ex2": "The washing machines in this building are shared between all twenty apartments on the floor."
  },
  {
    "word": "rent",
    "zh": "租金 / 租",
    "pos": "n./v.",
    "ipa": "",
    "ex": "The monthly rent is 8,000 yuan, utilities not included.",
    "ex2": "They rented a two-bedroom apartment in the city centre for a year before buying their own home."
  },
  {
    "word": "landlord",
    "zh": "房东",
    "pos": "n.",
    "ipa": "",
    "ex": "My landlord fixed the broken heater within 24 hours.",
    "ex2": "The landlords of most properties in this area require a three-month deposit upfront."
  },
  {
    "word": "lease",
    "zh": "租约",
    "pos": "n.",
    "ipa": "",
    "ex": "Please read the lease carefully before you sign it.",
    "ex2": "When the lease expired, they decided not to renew it and started looking for a bigger flat."
  },
  {
    "word": "furniture",
    "zh": "家具",
    "pos": "n.",
    "ipa": "",
    "ex": "The apartment comes fully furnished with brand-new furniture.",
    "ex2": "Moving all the heavy furniture up to the fifth floor without a lift took most of the afternoon."
  },
  {
    "word": "grocery store",
    "zh": "超市 / 杂货店",
    "pos": "n.",
    "ipa": "",
    "ex": "I'm heading to the grocery store—do you need anything?",
    "ex2": "The grocery stores in this neighbourhood close at nine, so don't leave it too late."
  },
  {
    "word": "receipt",
    "zh": "收据",
    "pos": "n.",
    "ipa": "",
    "ex": "Keep the receipt in case you need to return the item.",
    "ex2": "She saved all her receipts from the business trip so she could claim the expenses back."
  },
  {
    "word": "cash",
    "zh": "现金",
    "pos": "n.",
    "ipa": "",
    "ex": "Some small shops only accept cash, not cards.",
    "ex2": "He withdrew enough cash to cover the entire weekend trip, just in case cards weren't accepted."
  },
  {
    "word": "credit card",
    "zh": "信用卡",
    "pos": "n.",
    "ipa": "",
    "ex": "I'll pay with my credit card to earn reward points.",
    "ex2": "She used her credit cards so frequently that she had accumulated a significant amount of debt."
  },
  {
    "word": "electricity bill",
    "zh": "电费账单",
    "pos": "n.",
    "ipa": "",
    "ex": "The electricity bill went up because of the air conditioning.",
    "ex2": "Their electricity bills tripled during the heatwave as everyone ran their air conditioners non-stop."
  },
  {
    "word": "utility",
    "zh": "水电费等公用费",
    "pos": "n.",
    "ipa": "",
    "ex": "Utilities are included in the monthly rent price.",
    "ex2": "The utilities for this flat—gas, electricity, and water—come to about 500 yuan a month in total."
  },
  {
    "word": "neighborhood",
    "zh": "小区 / 街区",
    "pos": "n.",
    "ipa": "",
    "ex": "This is a quiet neighborhood close to excellent schools.",
    "ex2": "The neighborhoods near the riverside have become increasingly popular with young families recently."
  },
  {
    "word": "elevator",
    "zh": "电梯",
    "pos": "n.",
    "ipa": "",
    "ex": "The elevator is out of order—we'll have to take the stairs.",
    "ex2": "Both elevators in the building were being serviced, so residents had to use the emergency stairwell."
  },
  {
    "word": "parking lot",
    "zh": "停车场",
    "pos": "n.",
    "ipa": "",
    "ex": "The parking lot is full—let's try parking on the street.",
    "ex2": "The shopping centre's parking lots were completely packed on the first day of the sale."
  },
  {
    "word": "mailbox",
    "zh": "邮箱 / 信箱",
    "pos": "n.",
    "ipa": "",
    "ex": "Check the mailbox—I'm expecting an important package.",
    "ex2": "The mailboxes in the lobby are checked by most residents every evening after work."
  },
  {
    "word": "package",
    "zh": "包裹",
    "pos": "n.",
    "ipa": "",
    "ex": "A package arrived for you while you were out.",
    "ex2": "Three packages were delivered to the wrong address, causing a lot of confusion for the residents."
  },
  {
    "word": "roommate",
    "zh": "室友",
    "pos": "n.",
    "ipa": "",
    "ex": "My roommate and I take turns cooking dinner each week.",
    "ex2": "Finding reliable roommates for a three-bedroom apartment in the city centre can be quite challenging."
  },
  {
    "word": "chores",
    "zh": "家务活",
    "pos": "n.",
    "ipa": "",
    "ex": "We split the household chores evenly between the two of us.",
    "ex2": "She resented always being left to do all the chores while her flatmates relaxed in their rooms."
  },
  {
    "word": "routine",
    "zh": "日常习惯",
    "pos": "n.",
    "ipa": "",
    "ex": "A healthy morning routine sets a positive tone for the day.",
    "ex2": "After weeks of disruption, she was relieved to finally get back to her normal daily routines."
  },
  {
    "word": "commute",
    "zh": "通勤",
    "pos": "n./v.",
    "ipa": "",
    "ex": "My commute to the office takes about 40 minutes by subway.",
    "ex2": "Many employees are commuting over two hours each day, which is taking a serious toll on their health."
  },
  {
    "word": "move in",
    "zh": "搬入",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "We plan to move in to the new apartment next month.",
    "ex2": "They moved in on a Saturday and spent the entire weekend unpacking and arranging their belongings."
  },
  {
    "word": "deposit",
    "zh": "押金 / 定金",
    "pos": "n.",
    "ipa": "",
    "ex": "We paid two months' rent as a security deposit.",
    "ex2": "The landlord agreed to return their deposits within two weeks of them vacating the property."
  },
  {
    "word": "repair",
    "zh": "修理",
    "pos": "v./n.",
    "ipa": "",
    "ex": "The plumber came to repair the leaking pipe under the sink.",
    "ex2": "After the flood, the ground floor apartments all needed extensive repairs before they could be occupied again."
  },
  {
    "word": "air conditioner",
    "zh": "空调",
    "pos": "n.",
    "ipa": "",
    "ex": "It's 35 degrees outside—please turn on the air conditioner.",
    "ex2": "All the air conditioners in the building were running at full power during the record-breaking summer heatwave."
  },
  {
    "word": "heater",
    "zh": "暖气 / 取暖器",
    "pos": "n.",
    "ipa": "",
    "ex": "The heater broke down right in the middle of winter.",
    "ex2": "The portable heaters in the office were not powerful enough to keep the large open-plan space warm."
  },
  {
    "word": "Wi-Fi password",
    "zh": "无线网络密码",
    "pos": "n.",
    "ipa": "",
    "ex": "What's the Wi-Fi password? I need to get online for work.",
    "ex2": "She changed all the Wi-Fi passwords as soon as her ex-roommate moved out of the apartment."
  },
  {
    "word": "delivery",
    "zh": "外卖 / 快递",
    "pos": "n.",
    "ipa": "",
    "ex": "I ordered food delivery since there's nothing in the fridge.",
    "ex2": "Food deliveries from local restaurants increased dramatically during the city-wide lockdown period."
  },
  {
    "word": "recycling",
    "zh": "回收",
    "pos": "n.",
    "ipa": "",
    "ex": "Put the plastic bottles in the recycling bin by the door.",
    "ex2": "The city has introduced new guidelines to make recycling easier and more accessible for all residents."
  },
  {
    "word": "tidy up",
    "zh": "整理 / 收拾",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "Let's tidy up the apartment before the guests arrive tonight.",
    "ex2": "She spent Saturday morning tidying up the whole house after her children's birthday party."
  },
  {
    "word": "broken",
    "zh": "坏掉的",
    "pos": "adj.",
    "ipa": "",
    "ex": "The handle of the drawer is broken—be careful.",
    "ex2": "Three of the five machines on the factory floor were broken and waiting to be repaired."
  },
  {
    "word": "grocery list",
    "zh": "购物清单",
    "pos": "n.",
    "ipa": "",
    "ex": "I made a grocery list so we don't forget anything at the store.",
    "ex2": "She always prepares detailed grocery lists before the weekly shop to avoid buying unnecessary things."
  },
  {
    "word": "leftovers",
    "zh": "剩菜 / 剩饭",
    "pos": "n.",
    "ipa": "",
    "ex": "I had yesterday's leftovers for lunch to avoid waste.",
    "ex2": "He turned last night's leftover rice and vegetables into a delicious stir-fry for breakfast."
  },
  {
    "word": "expiry date",
    "zh": "有效期 / 保质期",
    "pos": "n.",
    "ipa": "",
    "ex": "Always check the expiry date before eating that yogurt.",
    "ex2": "The medicines in the cabinet were all past their expiry dates and had to be safely disposed of."
  },
  {
    "word": "smoke detector",
    "zh": "烟雾探测器",
    "pos": "n.",
    "ipa": "",
    "ex": "Test the smoke detector batteries every six months.",
    "ex2": "The smoke detectors went off the moment she accidentally burned the toast that morning."
  },
  {
    "word": "first aid kit",
    "zh": "急救箱",
    "pos": "n.",
    "ipa": "",
    "ex": "Keep a first aid kit in an easily accessible location at home.",
    "ex2": "The first aid kits supplied to all departments were restocked at the beginning of each new term."
  },
  {
    "word": "storage",
    "zh": "储物空间",
    "pos": "n.",
    "ipa": "",
    "ex": "Extra storage boxes are kept in the basement of the building.",
    "ex2": "The new flat was much smaller, so they had to rent additional storage space for their extra furniture."
  },
  {
    "word": "furnished",
    "zh": "附带家具的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Is the apartment furnished or do we need to buy everything?",
    "ex2": "They chose a fully furnished flat so they could move in immediately without buying any furniture."
  },
  {
    "word": "pet-friendly",
    "zh": "允许养宠物的",
    "pos": "adj.",
    "ipa": "",
    "ex": "We chose a pet-friendly apartment for our two cats.",
    "ex2": "Pet-friendly rentals are harder to find in the city centre, and they often cost slightly more per month."
  },
  {
    "word": "colleague",
    "zh": "同事",
    "pos": "n.",
    "ipa": "",
    "ex": "My colleague helped me finish the report before the deadline.",
    "ex2": "Several colleagues volunteered to cover her shifts while she was recovering from surgery."
  },
  {
    "word": "boss",
    "zh": "老板 / 上司",
    "pos": "n.",
    "ipa": "",
    "ex": "My boss approved the new project budget this morning.",
    "ex2": "Her bosses were so impressed by her performance that they offered her a promotion after only six months."
  },
  {
    "word": "manager",
    "zh": "经理",
    "pos": "n.",
    "ipa": "",
    "ex": "Please send the proposal directly to the project manager.",
    "ex2": "The regional managers gathered for their quarterly strategy meeting at the head office last week."
  },
  {
    "word": "employee",
    "zh": "员工",
    "pos": "n.",
    "ipa": "",
    "ex": "The company has over 500 employees across three offices.",
    "ex2": "All employees were required to complete an online safety training course before returning to the office."
  },
  {
    "word": "team",
    "zh": "团队",
    "pos": "n.",
    "ipa": "",
    "ex": "Our team meets every Monday morning to review the week's goals.",
    "ex2": "Three separate teams were working in parallel to ensure the product launched on schedule."
  },
  {
    "word": "department",
    "zh": "部门",
    "pos": "n.",
    "ipa": "",
    "ex": "The HR department handles all new employee onboarding.",
    "ex2": "All departments were asked to reduce their spending by fifteen percent for the rest of the year."
  },
  {
    "word": "deadline",
    "zh": "截止日期",
    "pos": "n.",
    "ipa": "",
    "ex": "The deadline for this report is end of day Friday.",
    "ex2": "She missed two deadlines in a row, which seriously damaged her reputation within the team."
  },
  {
    "word": "project",
    "zh": "项目",
    "pos": "n.",
    "ipa": "",
    "ex": "This project is due next month, so we need to stay on track.",
    "ex2": "Several large infrastructure projects in the city have been delayed due to a shortage of materials."
  },
  {
    "word": "task",
    "zh": "任务",
    "pos": "n.",
    "ipa": "",
    "ex": "Please assign each team member a specific task by tomorrow.",
    "ex2": "The tasks were divided according to each person's strengths, which made the workflow much smoother."
  },
  {
    "word": "report",
    "zh": "报告",
    "pos": "n.",
    "ipa": "",
    "ex": "I need to submit the monthly sales report by noon today.",
    "ex2": "The committee reviewed dozens of reports before making its final recommendation to the board."
  },
  {
    "word": "presentation",
    "zh": "演示 / 汇报",
    "pos": "n.",
    "ipa": "",
    "ex": "She gave an excellent presentation to the board of directors.",
    "ex2": "He rehearsed his presentation over twenty times before the final investor pitch on Friday morning."
  },
  {
    "word": "email",
    "zh": "电子邮件",
    "pos": "n.",
    "ipa": "",
    "ex": "I'll send you the contract via email this afternoon.",
    "ex2": "She sent follow-up emails to every client who had not yet responded to the original proposal."
  },
  {
    "word": "meeting",
    "zh": "会议",
    "pos": "n.",
    "ipa": "",
    "ex": "The team meeting is scheduled for 10 a.m. in Room B.",
    "ex2": "After the merger, senior managers were expected to attend at least four strategy meetings per week."
  },
  {
    "word": "appointment",
    "zh": "预约 / 约会",
    "pos": "n.",
    "ipa": "",
    "ex": "I have a dentist appointment at two o'clock tomorrow.",
    "ex2": "All appointments at the clinic were fully booked for the next three weeks without exception."
  },
  {
    "word": "salary",
    "zh": "薪资",
    "pos": "n.",
    "ipa": "",
    "ex": "He negotiated a higher salary when he changed companies.",
    "ex2": "Salaries in the tech industry have risen significantly over the past five years across most regions."
  },
  {
    "word": "raise",
    "zh": "加薪",
    "pos": "n.",
    "ipa": "",
    "ex": "She asked her manager for a raise after three years in the role.",
    "ex2": "All employees who received outstanding performance ratings were given raises at the end of the year."
  },
  {
    "word": "bonus",
    "zh": "奖金",
    "pos": "n.",
    "ipa": "",
    "ex": "Everyone on the team received a performance bonus this year.",
    "ex2": "Year-end bonuses were much higher than expected, which greatly boosted morale across the entire company."
  },
  {
    "word": "overtime",
    "zh": "加班",
    "pos": "n.",
    "ipa": "",
    "ex": "We had to work overtime to meet the client's tight deadline.",
    "ex2": "She worked overtime three evenings in a row to complete the audit before the quarterly submission date."
  },
  {
    "word": "remote work",
    "zh": "远程工作",
    "pos": "n.",
    "ipa": "",
    "ex": "Remote work has become standard practice in many tech companies.",
    "ex2": "Many employees preferred remote work arrangements even after the offices reopened following the pandemic."
  },
  {
    "word": "home office",
    "zh": "家庭办公室",
    "pos": "n.",
    "ipa": "",
    "ex": "I set up a proper home office with a standing desk and monitor.",
    "ex2": "She invested in ergonomic furniture and proper lighting to make her home office more comfortable and productive."
  },
  {
    "word": "laptop",
    "zh": "笔记本电脑",
    "pos": "n.",
    "ipa": "",
    "ex": "I carry my laptop everywhere so I can work from anywhere.",
    "ex2": "The company issued new laptops to all staff members at the beginning of the new financial year."
  },
  {
    "word": "conference room",
    "zh": "会议室",
    "pos": "n.",
    "ipa": "",
    "ex": "The conference room is booked from 2 to 4 this afternoon.",
    "ex2": "All conference rooms in the building need to be reserved at least 24 hours in advance through the app."
  },
  {
    "word": "agenda",
    "zh": "议程",
    "pos": "n.",
    "ipa": "",
    "ex": "Can you send the meeting agenda at least an hour in advance?",
    "ex2": "The board meeting agendas are always circulated to all directors three days before the scheduled session."
  },
  {
    "word": "minutes",
    "zh": "会议记录",
    "pos": "n.",
    "ipa": "",
    "ex": "Could you take the minutes of today's meeting, please?",
    "ex2": "The secretary distributed the minutes of last week's meeting so everyone could review the action items."
  },
  {
    "word": "feedback",
    "zh": "反馈",
    "pos": "n.",
    "ipa": "",
    "ex": "Please give me feedback on this draft before I send it out.",
    "ex2": "She gathered feedback from twenty users before finalising the design of the new mobile application."
  },
  {
    "word": "performance review",
    "zh": "绩效评估",
    "pos": "n.",
    "ipa": "",
    "ex": "Annual performance reviews are held every December here.",
    "ex2": "Her performance reviews consistently described her as proactive, reliable, and a strong team player."
  },
  {
    "word": "goal",
    "zh": "目标",
    "pos": "n.",
    "ipa": "",
    "ex": "Set clear and measurable goals at the start of each quarter.",
    "ex2": "The team's goals for the second half of the year focused mainly on customer retention and satisfaction."
  },
  {
    "word": "strategy",
    "zh": "策略",
    "pos": "n.",
    "ipa": "",
    "ex": "We need a new marketing strategy to reach younger customers.",
    "ex2": "The long-term strategies outlined in the annual report aim to double the company's revenue within five years."
  },
  {
    "word": "proposal",
    "zh": "提案 / 方案",
    "pos": "n.",
    "ipa": "",
    "ex": "The team submitted a detailed proposal to the client yesterday.",
    "ex2": "Three competing proposals were presented to the committee, and members voted on the best one."
  },
  {
    "word": "contract",
    "zh": "合同",
    "pos": "n.",
    "ipa": "",
    "ex": "Please review the contract carefully before you sign it.",
    "ex2": "Both parties signed the contracts after weeks of difficult negotiations between their legal teams."
  },
  {
    "word": "client",
    "zh": "客户",
    "pos": "n.",
    "ipa": "",
    "ex": "We have a very important client meeting scheduled for Friday.",
    "ex2": "The agency's clients range from small local businesses to large multinational corporations worldwide."
  },
  {
    "word": "budget",
    "zh": "预算",
    "pos": "n.",
    "ipa": "",
    "ex": "The marketing budget for this quarter has already been used up.",
    "ex2": "Budgets for all departments were cut by twenty percent due to the company's declining annual revenues."
  },
  {
    "word": "invoice",
    "zh": "发票",
    "pos": "n.",
    "ipa": "",
    "ex": "Please send the invoice to the accounts payable department.",
    "ex2": "Three invoices were disputed by the client because the amounts did not match the agreed contract."
  },
  {
    "word": "expense",
    "zh": "费用 / 开支",
    "pos": "n.",
    "ipa": "",
    "ex": "Submit all your travel expenses within 30 days of the trip.",
    "ex2": "The company's operating expenses rose sharply due to higher energy prices and raw material costs."
  },
  {
    "word": "reimbursement",
    "zh": "报销",
    "pos": "n.",
    "ipa": "",
    "ex": "Apply for reimbursement by filling in the expense claim form.",
    "ex2": "Reimbursements for all approved expenses were processed and paid within fifteen working days."
  },
  {
    "word": "hire",
    "zh": "雇佣",
    "pos": "v.",
    "ipa": "",
    "ex": "We plan to hire three new developers in the next quarter.",
    "ex2": "The company has been hiring aggressively across all departments to keep up with rapid growth."
  },
  {
    "word": "resign",
    "zh": "辞职",
    "pos": "v.",
    "ipa": "",
    "ex": "She decided to resign after receiving a better offer abroad.",
    "ex2": "He resigned from his position without giving any explanation, which shocked the entire team."
  },
  {
    "word": "promote",
    "zh": "晋升",
    "pos": "v.",
    "ipa": "",
    "ex": "He was promoted to senior manager after two years of hard work.",
    "ex2": "She was promoted three times in four years, making her one of the youngest directors in the company."
  },
  {
    "word": "intern",
    "zh": "实习生",
    "pos": "n.",
    "ipa": "",
    "ex": "We have two interns joining the design team this summer.",
    "ex2": "Several interns from last year's programme were offered full-time positions at the end of their placement."
  },
  {
    "word": "job interview",
    "zh": "工作面试",
    "pos": "n.",
    "ipa": "",
    "ex": "I have a job interview at Google next Tuesday afternoon.",
    "ex2": "She prepared for her job interviews by researching each company thoroughly and practising common questions."
  },
  {
    "word": "resume",
    "zh": "简历",
    "pos": "n.",
    "ipa": "",
    "ex": "Update your resume before applying for the position.",
    "ex2": "He tailored his resume specifically for each role he applied to, highlighting the most relevant experience."
  },
  {
    "word": "cover letter",
    "zh": "求职信",
    "pos": "n.",
    "ipa": "",
    "ex": "A well-written cover letter can make your application stand out.",
    "ex2": "She spent an entire afternoon crafting a personalised cover letter for the director-level position."
  },
  {
    "word": "probation",
    "zh": "试用期",
    "pos": "n.",
    "ipa": "",
    "ex": "New employees complete a three-month probation period here.",
    "ex2": "His contract was extended after the probation period because he consistently exceeded his targets."
  },
  {
    "word": "workload",
    "zh": "工作量",
    "pos": "n.",
    "ipa": "",
    "ex": "My workload this month is much heavier than usual.",
    "ex2": "The team's workloads have been increasing steadily since two senior colleagues left last quarter."
  },
  {
    "word": "priority",
    "zh": "优先级",
    "pos": "n.",
    "ipa": "",
    "ex": "Let's discuss which tasks should be our top priorities today.",
    "ex2": "After the crisis, customer support became the organisation's highest priority for the entire year."
  },
  {
    "word": "urgent",
    "zh": "紧急的",
    "pos": "adj.",
    "ipa": "",
    "ex": "This is urgent—please respond to the client within the hour.",
    "ex2": "She received three urgent messages while she was presenting and had to step out to handle them."
  },
  {
    "word": "collaborate",
    "zh": "合作",
    "pos": "v.",
    "ipa": "",
    "ex": "The two departments will collaborate closely on this product launch.",
    "ex2": "Scientists from six countries have been collaborating on the groundbreaking climate research project."
  },
  {
    "word": "productive",
    "zh": "高效的",
    "pos": "adj.",
    "ipa": "",
    "ex": "We had a very productive brainstorming session this morning.",
    "ex2": "The most productive team members tend to work in short, focused bursts with regular breaks in between."
  },
  {
    "word": "professional",
    "zh": "专业的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Always maintain a professional tone in client communications.",
    "ex2": "She dressed professionally for every client meeting, even those held over video conference."
  },
  {
    "word": "HR",
    "zh": "人力资源部",
    "pos": "n.",
    "ipa": "",
    "ex": "Contact HR if you have questions about your employment contract.",
    "ex2": "The HR department organised a series of well-being workshops to support employees during the merger."
  },
  {
    "word": "annual leave",
    "zh": "年假",
    "pos": "n.",
    "ipa": "",
    "ex": "I'm planning to use my annual leave for a trip to Europe.",
    "ex2": "Staff members are encouraged to take all their annual leave before the end of the calendar year."
  },
  {
    "word": "sick leave",
    "zh": "病假",
    "pos": "n.",
    "ipa": "",
    "ex": "She called in sick and applied for two days of sick leave.",
    "ex2": "He had exhausted all his sick leave after being hospitalised for an operation earlier in the year."
  },
  {
    "word": "benefits",
    "zh": "福利",
    "pos": "n.",
    "ipa": "",
    "ex": "The company offers excellent benefits including health and dental.",
    "ex2": "The benefits package includes private health insurance, gym membership, and a generous pension contribution."
  },
  {
    "word": "full-time",
    "zh": "全职",
    "pos": "adj.",
    "ipa": "",
    "ex": "I'm looking for a full-time position in software development.",
    "ex2": "She transitioned from part-time to full-time work after her youngest child started primary school."
  },
  {
    "word": "part-time",
    "zh": "兼职",
    "pos": "adj.",
    "ipa": "",
    "ex": "She works part-time while finishing her master's degree.",
    "ex2": "The café employs mostly part-time staff who work flexible shifts around their studies."
  },
  {
    "word": "freelance",
    "zh": "自由职业",
    "pos": "adj./n.",
    "ipa": "",
    "ex": "He works as a freelance designer for several tech startups.",
    "ex2": "More and more people are choosing to freelance rather than committing to a single full-time employer."
  },
  {
    "word": "business card",
    "zh": "名片",
    "pos": "n.",
    "ipa": "",
    "ex": "Please exchange business cards with the clients after the lunch.",
    "ex2": "She ran out of business cards on the first day of the conference and had to share her details digitally."
  },
  {
    "word": "networking",
    "zh": "建立人脉",
    "pos": "n.",
    "ipa": "",
    "ex": "Industry conferences are great for networking with peers.",
    "ex2": "She spent months actively networking before finally landing a senior role at a top investment bank."
  },
  {
    "word": "training",
    "zh": "培训",
    "pos": "n.",
    "ipa": "",
    "ex": "New hires attend a one-week training programme before starting.",
    "ex2": "All staff members are required to complete mandatory safety trainings before entering the production floor."
  },
  {
    "word": "onboarding",
    "zh": "入职培训",
    "pos": "n.",
    "ipa": "",
    "ex": "The onboarding process includes a tour and introductions to all teams.",
    "ex2": "A well-designed onboarding programme significantly reduces the time it takes new hires to become fully productive."
  },
  {
    "word": "handover",
    "zh": "工作交接",
    "pos": "n.",
    "ipa": "",
    "ex": "Please prepare a detailed handover document before your last day.",
    "ex2": "The handovers between shifts were poorly managed, which led to several important tasks being missed entirely."
  },
  {
    "word": "delegate",
    "zh": "委派 / 授权",
    "pos": "v.",
    "ipa": "",
    "ex": "A good manager knows how to delegate tasks effectively.",
    "ex2": "She delegated the routine reporting tasks so she could focus on the most strategic parts of the project."
  },
  {
    "word": "attendee",
    "zh": "参会者",
    "pos": "n.",
    "ipa": "",
    "ex": "Please confirm the list of attendees before sending invitations.",
    "ex2": "Over three hundred attendees registered for the annual conference, far exceeding last year's numbers."
  },
  {
    "word": "chairperson",
    "zh": "主持人 / 主席",
    "pos": "n.",
    "ipa": "",
    "ex": "The chairperson opened the meeting and reviewed the agenda.",
    "ex2": "The newly elected chairperson introduced several reforms that changed the way the committee operates."
  },
  {
    "word": "presenter",
    "zh": "演讲者",
    "pos": "n.",
    "ipa": "",
    "ex": "Each presenter has 15 minutes to deliver their quarterly update.",
    "ex2": "The presenters were asked to submit their slides at least 48 hours before the event began."
  },
  {
    "word": "video conference",
    "zh": "视频会议",
    "pos": "n.",
    "ipa": "",
    "ex": "We hold a weekly video conference with our overseas team.",
    "ex2": "Video conferences have largely replaced in-person meetings for teams spread across multiple time zones."
  },
  {
    "word": "mute",
    "zh": "静音",
    "pos": "v./adj.",
    "ipa": "",
    "ex": "Please mute yourself when you're not speaking in the call.",
    "ex2": "He forgot to mute his microphone and everyone on the call heard his side conversation with a colleague."
  },
  {
    "word": "screen share",
    "zh": "屏幕共享",
    "pos": "n.",
    "ipa": "",
    "ex": "Can you screen share so everyone can see the presentation?",
    "ex2": "She used screen sharing to walk the client through the new software features step by step."
  },
  {
    "word": "action item",
    "zh": "待办事项",
    "pos": "n.",
    "ipa": "",
    "ex": "Let's assign an action item to each team member before we close.",
    "ex2": "All action items from last week's meeting were reviewed and the owners reported on their progress."
  },
  {
    "word": "takeaway",
    "zh": "主要结论",
    "pos": "n.",
    "ipa": "",
    "ex": "The key takeaway from today's meeting is that we need more data.",
    "ex2": "She summarised the main takeaways from the two-day workshop in a concise email to all participants."
  },
  {
    "word": "deliverable",
    "zh": "可交付成果",
    "pos": "n.",
    "ipa": "",
    "ex": "List all deliverables and their due dates in the project plan.",
    "ex2": "The deliverables for phase one were completed ahead of schedule, which impressed the client significantly."
  },
  {
    "word": "KPI",
    "zh": "关键绩效指标 / Key Performance Indicator",
    "pos": "n.",
    "ipa": "",
    "ex": "Each department tracks its own set of KPIs every quarter.",
    "ex2": "The team's KPIs were revised at the start of the year to better reflect the company's strategic priorities."
  },
  {
    "word": "milestone",
    "zh": "里程碑",
    "pos": "n.",
    "ipa": "",
    "ex": "Hitting the first million users is a major milestone for us.",
    "ex2": "The project team celebrated reaching several key milestones ahead of the original schedule."
  },
  {
    "word": "quarterly",
    "zh": "季度的",
    "pos": "adj.",
    "ipa": "",
    "ex": "We hold quarterly reviews to assess overall business performance.",
    "ex2": "Quarterly earnings reports showed consistent growth, reassuring investors about the company's long-term prospects."
  },
  {
    "word": "fiscal year",
    "zh": "财年",
    "pos": "n.",
    "ipa": "",
    "ex": "Our fiscal year runs from April to March.",
    "ex2": "Results for the current fiscal year have exceeded all expectations set at the beginning of the period."
  },
  {
    "word": "revenue",
    "zh": "营收",
    "pos": "n.",
    "ipa": "",
    "ex": "Revenue grew by 35% compared to the same period last year.",
    "ex2": "Despite a challenging economic climate, revenues remained stable across all the company's core business lines."
  },
  {
    "word": "profit",
    "zh": "利润",
    "pos": "n.",
    "ipa": "",
    "ex": "The company returned to profit after two difficult quarters.",
    "ex2": "Profits were reinvested into research and development rather than being distributed to shareholders."
  },
  {
    "word": "ROI",
    "zh": "投资回报率 / Return on Investment",
    "pos": "n.",
    "ipa": "",
    "ex": "The campaign delivered an impressive ROI of over 200%.",
    "ex2": "Before approving the project, management required a detailed analysis of the expected ROI over five years."
  },
  {
    "word": "market share",
    "zh": "市场份额",
    "pos": "n.",
    "ipa": "",
    "ex": "We aim to grow our market share to 20% within two years.",
    "ex2": "The company's market share in Southeast Asia has doubled since it launched its localised product range."
  },
  {
    "word": "forecast",
    "zh": "预测",
    "pos": "n./v.",
    "ipa": "",
    "ex": "The sales forecast for next quarter looks very promising.",
    "ex2": "Analysts are forecasting a significant slowdown in consumer spending throughout the second half of the year."
  },
  {
    "word": "negotiation",
    "zh": "谈判",
    "pos": "n.",
    "ipa": "",
    "ex": "Price negotiation with the supplier took three rounds of talks.",
    "ex2": "The negotiations dragged on for weeks before both sides finally agreed on the revised contract terms."
  },
  {
    "word": "terms and conditions",
    "zh": "条款与条件",
    "pos": "n.",
    "ipa": "",
    "ex": "Please read the terms and conditions before signing the agreement.",
    "ex2": "The updated terms and conditions included new clauses about data privacy and liability limitations."
  },
  {
    "word": "discount",
    "zh": "折扣",
    "pos": "n.",
    "ipa": "",
    "ex": "We can offer a 10% discount for orders above 1,000 units.",
    "ex2": "Loyal customers were offered exclusive discounts of up to thirty percent during the anniversary sale."
  },
  {
    "word": "close a deal",
    "zh": "成交",
    "pos": "phr.",
    "ipa": "",
    "ex": "We finally closed the deal after three months of negotiation.",
    "ex2": "He closed five major deals in a single month, setting a new record for the sales team."
  },
  {
    "word": "approve",
    "zh": "批准",
    "pos": "v.",
    "ipa": "",
    "ex": "The board approved the new investment plan unanimously.",
    "ex2": "The safety regulations were formally approved by the government after two years of public consultation."
  },
  {
    "word": "postpone",
    "zh": "推迟",
    "pos": "v.",
    "ipa": "",
    "ex": "We had to postpone the product launch due to supply chain issues.",
    "ex2": "The summit was postponed indefinitely after several key leaders withdrew from the programme."
  },
  {
    "word": "reschedule",
    "zh": "重新安排",
    "pos": "v.",
    "ipa": "",
    "ex": "Can we reschedule Friday's meeting to the following Monday?",
    "ex2": "The flight was cancelled and all passengers were rescheduled onto the next available departure."
  },
  {
    "word": "wrap up",
    "zh": "总结 / 结束",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "Let's wrap up—we only have five minutes left in this meeting.",
    "ex2": "She wrapped up the three-day conference with a compelling speech that energised the entire audience."
  },
  {
    "word": "follow up",
    "zh": "跟进",
    "pos": "phr.v./n.",
    "ipa": "",
    "ex": "I'll follow up with the client after they review the proposal.",
    "ex2": "He diligently followed up on every lead generated by the trade show within 48 hours of the event."
  },
  {
    "word": "action plan",
    "zh": "行动计划",
    "pos": "n.",
    "ipa": "",
    "ex": "We need a clear action plan before the end of this meeting.",
    "ex2": "The management team presented a detailed action plan to address the issues raised in the audit report."
  },
  {
    "word": "stakeholder",
    "zh": "利益相关方",
    "pos": "n.",
    "ipa": "",
    "ex": "All key stakeholders must be informed before any major decision.",
    "ex2": "Engaging stakeholders early in the process helped the team avoid costly misunderstandings later on."
  },
  {
    "word": "heads up",
    "zh": "提前告知",
    "pos": "n./phr.",
    "ipa": "",
    "ex": "Just a heads up—the client may ask about pricing tomorrow.",
    "ex2": "She gave her team a heads up about the CEO's surprise visit so they could prepare in advance."
  },
  {
    "word": "bottom line",
    "zh": "底线 / 净利润",
    "pos": "n.",
    "ipa": "",
    "ex": "The bottom line is that we can't afford to delay any further.",
    "ex2": "Cost-cutting measures significantly improved the company's bottom line during the difficult trading period."
  },
  {
    "word": "loop in",
    "zh": "将某人加入沟通",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "Please loop in the legal team before we finalize the contract.",
    "ex2": "He looped in three different departments to make sure everyone had visibility on the project's progress."
  },
  {
    "word": "off the record",
    "zh": "私下里 / 非正式地",
    "pos": "phr.",
    "ipa": "",
    "ex": "Off the record, I think the merger is very unlikely to happen.",
    "ex2": "The journalist agreed to keep the interview off the record, so no names were mentioned in the article."
  },
  {
    "word": "due diligence",
    "zh": "尽职调查",
    "pos": "n.",
    "ipa": "",
    "ex": "We performed full due diligence before acquiring the startup.",
    "ex2": "Investors are conducting thorough due diligence on the company's financials before committing any capital."
  },
  {
    "word": "benchmark",
    "zh": "基准 / 对标",
    "pos": "n.",
    "ipa": "",
    "ex": "Let's benchmark our performance against industry standards.",
    "ex2": "The new app was benchmarked against the five most popular competitors in the market."
  },
  {
    "word": "passport",
    "zh": "护照",
    "pos": "n.",
    "ipa": "",
    "ex": "Make sure your passport is valid for at least six more months.",
    "ex2": "Her passport was confiscated at the border because the details did not match the visa application."
  },
  {
    "word": "visa",
    "zh": "签证",
    "pos": "n.",
    "ipa": "",
    "ex": "I need to apply for a Schengen visa before I travel to Europe.",
    "ex2": "Work visas for skilled professionals in the technology sector are processed significantly faster than other categories."
  },
  {
    "word": "flight",
    "zh": "航班",
    "pos": "n.",
    "ipa": "",
    "ex": "My flight departs at 8 a.m., so I need to leave home by 5:30.",
    "ex2": "All flights out of the city were cancelled due to the severe storm that lasted three days."
  },
  {
    "word": "airline",
    "zh": "航空公司",
    "pos": "n.",
    "ipa": "",
    "ex": "Which airline do you usually fly when travelling to Europe?",
    "ex2": "Several budget airlines have announced new routes connecting smaller cities across Southeast Asia."
  },
  {
    "word": "airport",
    "zh": "机场",
    "pos": "n.",
    "ipa": "",
    "ex": "We should arrive at the airport at least two hours early.",
    "ex2": "Both major airports in the city are being expanded to handle the growing volume of international passengers."
  },
  {
    "word": "check in",
    "zh": "值机 / 办理入住",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "You can check in online up to 24 hours before departure.",
    "ex2": "They checked in early and were upgraded to a superior room because a suite had become available."
  },
  {
    "word": "boarding pass",
    "zh": "登机牌",
    "pos": "n.",
    "ipa": "",
    "ex": "Please have your boarding pass ready to show at the gate.",
    "ex2": "Digital boarding passes stored on smartphones are now accepted at most international airports worldwide."
  },
  {
    "word": "gate",
    "zh": "登机口",
    "pos": "n.",
    "ipa": "",
    "ex": "Our flight departs from Gate 27 at the far end of Terminal 2.",
    "ex2": "Passengers were asked to proceed immediately to their gates as boarding had already started."
  },
  {
    "word": "departure",
    "zh": "出发 / 离港",
    "pos": "n.",
    "ipa": "",
    "ex": "Check the departure board for your gate number and time.",
    "ex2": "The departure lounge was packed with travellers all trying to rebook after the delays were announced."
  },
  {
    "word": "arrival",
    "zh": "到达 / 到港",
    "pos": "n.",
    "ipa": "",
    "ex": "The arrival time has been changed to 11:30 p.m. due to a delay.",
    "ex2": "The arrivals hall was full of families holding signs and balloons as they waited for their loved ones."
  },
  {
    "word": "delay",
    "zh": "延误",
    "pos": "n./v.",
    "ipa": "",
    "ex": "The flight was delayed by two hours because of bad weather.",
    "ex2": "Passengers were frustrated by repeated delays with no clear explanation from the airline's ground staff."
  },
  {
    "word": "cancel",
    "zh": "取消",
    "pos": "v.",
    "ipa": "",
    "ex": "The airline cancelled the flight and rebooked all passengers.",
    "ex2": "Hundreds of events across the country were cancelled following the government's announcement on public gatherings."
  },
  {
    "word": "baggage",
    "zh": "行李",
    "pos": "n.",
    "ipa": "",
    "ex": "Each passenger is allowed one piece of checked baggage up to 23 kg.",
    "ex2": "Several pieces of baggage were lost during the connecting flight and took three days to be returned."
  },
  {
    "word": "carry-on",
    "zh": "随身行李",
    "pos": "n.",
    "ipa": "",
    "ex": "My carry-on bag fits perfectly in the overhead bin.",
    "ex2": "Carry-on restrictions have become stricter, with many airlines now limiting both the size and weight allowed."
  },
  {
    "word": "customs",
    "zh": "海关",
    "pos": "n.",
    "ipa": "",
    "ex": "You must declare any goods over the duty-free limit at customs.",
    "ex2": "Customs officers searched the luggage thoroughly after the sniffer dog alerted them to one particular case."
  },
  {
    "word": "declaration",
    "zh": "申报",
    "pos": "n.",
    "ipa": "",
    "ex": "Fill in the customs declaration form before landing.",
    "ex2": "Several passengers were stopped at customs because their declarations did not include the goods they were carrying."
  },
  {
    "word": "immigration",
    "zh": "入境检查 / 移民局",
    "pos": "n.",
    "ipa": "",
    "ex": "The immigration queue at the airport was almost two hours long.",
    "ex2": "New biometric immigration systems have significantly reduced waiting times at international airports."
  },
  {
    "word": "hostel",
    "zh": "青旅 / 青年旅舍",
    "pos": "n.",
    "ipa": "",
    "ex": "Staying in a hostel is a great way to meet fellow travellers.",
    "ex2": "The hostels in that city are remarkably clean and well-organised, especially considering how affordable they are."
  },
  {
    "word": "reservation",
    "zh": "预订",
    "pos": "n.",
    "ipa": "",
    "ex": "I made a reservation for two at the restaurant for 7 p.m.",
    "ex2": "All reservations were cancelled automatically when the hotel was forced to close for renovation works."
  },
  {
    "word": "check out",
    "zh": "退房 / 结账",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "Check-out time is 11 a.m.—please leave your key at the front desk.",
    "ex2": "They checked out early in the morning to catch the first train of the day to the capital."
  },
  {
    "word": "room service",
    "zh": "客房服务",
    "pos": "n.",
    "ipa": "",
    "ex": "I ordered breakfast via room service so I didn't have to go down.",
    "ex2": "Room service at this hotel is available around the clock, which is ideal for guests arriving on late flights."
  },
  {
    "word": "front desk",
    "zh": "前台 / 接待台",
    "pos": "n.",
    "ipa": "",
    "ex": "Please call the front desk if you need extra towels or pillows.",
    "ex2": "The front desk staff were incredibly helpful in arranging transport and restaurant bookings for the guests."
  },
  {
    "word": "tour guide",
    "zh": "导游",
    "pos": "n.",
    "ipa": "",
    "ex": "Our tour guide spoke excellent English and knew everything about the city.",
    "ex2": "The tour guides at this historic site are all trained historians with specialist knowledge of the period."
  },
  {
    "word": "sightseeing",
    "zh": "观光",
    "pos": "n.",
    "ipa": "",
    "ex": "We spent the whole afternoon sightseeing around the Old Town.",
    "ex2": "After two days of business meetings, they finally had a chance to do some sightseeing before flying home."
  },
  {
    "word": "landmark",
    "zh": "地标",
    "pos": "n.",
    "ipa": "",
    "ex": "The Eiffel Tower is the most famous landmark in Paris.",
    "ex2": "Dozens of iconic landmarks were damaged by the earthquake, causing both cultural and economic losses."
  },
  {
    "word": "museum",
    "zh": "博物馆",
    "pos": "n.",
    "ipa": "",
    "ex": "The British Museum is free to enter and open every day.",
    "ex2": "The city's museums attract millions of visitors every year, contributing significantly to the local economy."
  },
  {
    "word": "attraction",
    "zh": "景点",
    "pos": "n.",
    "ipa": "",
    "ex": "The city has dozens of top tourist attractions worth visiting.",
    "ex2": "The newly opened theme park has quickly become one of the country's most popular tourist attractions."
  },
  {
    "word": "subway",
    "zh": "地铁",
    "pos": "n.",
    "ipa": "",
    "ex": "Taking the subway is the fastest way to get across the city.",
    "ex2": "The subway lines were extended to three new districts as part of the city's major expansion programme."
  },
  {
    "word": "rent a car",
    "zh": "租车",
    "pos": "phr.",
    "ipa": "",
    "ex": "We decided to rent a car so we could explore the countryside.",
    "ex2": "She rented a car for the week and drove along the coast, stopping at all the scenic viewpoints."
  },
  {
    "word": "toll",
    "zh": "过路费",
    "pos": "n.",
    "ipa": "",
    "ex": "Keep some cash handy for the highway toll booths.",
    "ex2": "Road tolls on the expressway were increased last month as part of an infrastructure funding programme."
  },
  {
    "word": "traffic jam",
    "zh": "交通堵塞",
    "pos": "n.",
    "ipa": "",
    "ex": "We were stuck in a traffic jam for over an hour on the motorway.",
    "ex2": "Traffic jams in the city centre have worsened significantly since the main bridge was closed for repairs."
  },
  {
    "word": "lost",
    "zh": "迷路的",
    "pos": "adj.",
    "ipa": "",
    "ex": "We got completely lost in the old part of the city.",
    "ex2": "She got hopelessly lost in the maze of narrow streets and had to ask a local for help finding her way."
  },
  {
    "word": "direction",
    "zh": "方向",
    "pos": "n.",
    "ipa": "",
    "ex": "Excuse me, could you give me directions to the train station?",
    "ex2": "The directions provided by the app were confusing, leading them to the wrong side of the building."
  },
  {
    "word": "turn left",
    "zh": "左转",
    "pos": "phr.",
    "ipa": "",
    "ex": "Turn left at the traffic lights and walk for about 200 metres.",
    "ex2": "Turn left after crossing the bridge and you will see the hospital entrance directly ahead of you."
  },
  {
    "word": "turn right",
    "zh": "右转",
    "pos": "phr.",
    "ipa": "",
    "ex": "Turn right after the pharmacy and the hotel is on your left.",
    "ex2": "The sat-nav told us to turn right twice in quick succession, which seemed very unusual for that road."
  },
  {
    "word": "straight ahead",
    "zh": "直走",
    "pos": "phr.",
    "ipa": "",
    "ex": "Go straight ahead for two blocks and you'll see the entrance.",
    "ex2": "The sat-nav told her to go straight ahead for five kilometres before turning off the motorway."
  },
  {
    "word": "round trip",
    "zh": "往返",
    "pos": "n.",
    "ipa": "",
    "ex": "A round-trip ticket to Tokyo costs about USD 800.",
    "ex2": "She booked a round-trip flight for the family holiday, saving money by flying mid-week."
  },
  {
    "word": "one way",
    "zh": "单程",
    "pos": "n.",
    "ipa": "",
    "ex": "I only need a one-way ticket since I'm coming back by train.",
    "ex2": "He purchased a one-way ticket with no return date, as he planned to travel indefinitely."
  },
  {
    "word": "economy class",
    "zh": "经济舱",
    "pos": "n.",
    "ipa": "",
    "ex": "Economy class tickets are much cheaper if booked in advance.",
    "ex2": "Travelling economy class for twelve hours was exhausting, so he decided to upgrade on the way back."
  },
  {
    "word": "business class",
    "zh": "商务舱",
    "pos": "n.",
    "ipa": "",
    "ex": "The company paid for a business class seat on the long-haul flight.",
    "ex2": "After years of frequent travel, she finally treated herself to a business class seat for her holiday."
  },
  {
    "word": "window seat",
    "zh": "靠窗座位",
    "pos": "n.",
    "ipa": "",
    "ex": "I always request a window seat so I can see the view below.",
    "ex2": "Both children insisted on window seats, so their parents sat in the middle and aisle."
  },
  {
    "word": "aisle seat",
    "zh": "靠走道座位",
    "pos": "n.",
    "ipa": "",
    "ex": "She prefers an aisle seat so she can stretch her legs easily.",
    "ex2": "He always reserves aisle seats on long flights so he can move around without disturbing others."
  },
  {
    "word": "turbulence",
    "zh": "气流颤动",
    "pos": "n.",
    "ipa": "",
    "ex": "The pilot asked everyone to fasten seatbelts due to turbulence.",
    "ex2": "The aircraft experienced severe turbulence for over thirty minutes, which frightened many of the passengers."
  },
  {
    "word": "jet lag",
    "zh": "时差反应",
    "pos": "n.",
    "ipa": "",
    "ex": "I suffered from terrible jet lag after the 12-hour flight.",
    "ex2": "She battled jet lag for nearly a week after returning from her first trip across three different time zones."
  },
  {
    "word": "time zone",
    "zh": "时区",
    "pos": "n.",
    "ipa": "",
    "ex": "London and Beijing are 8 hours apart in time zones.",
    "ex2": "The team was spread across six different time zones, making it very difficult to schedule a meeting for everyone."
  },
  {
    "word": "exchange rate",
    "zh": "汇率",
    "pos": "n.",
    "ipa": "",
    "ex": "Check the exchange rate before converting your money at the airport.",
    "ex2": "Favourable exchange rates meant their budget went much further than expected during the European trip."
  },
  {
    "word": "tip",
    "zh": "小费",
    "pos": "n./v.",
    "ipa": "",
    "ex": "It is customary to tip around 15-20% at restaurants in the US.",
    "ex2": "She tipped the hotel porter generously after he helped carry all five suitcases up to the room."
  },
  {
    "word": "souvenir",
    "zh": "纪念品",
    "pos": "n.",
    "ipa": "",
    "ex": "I bought some local souvenirs for my family back home.",
    "ex2": "The market stalls were filled with handmade souvenirs that made perfect, meaningful gifts for friends."
  },
  {
    "word": "itinerary",
    "zh": "行程安排",
    "pos": "n.",
    "ipa": "",
    "ex": "Please email me the full itinerary at least a week before we go.",
    "ex2": "The tour operator sent a detailed itinerary covering fifteen cities across seven countries in three weeks."
  },
  {
    "word": "travel insurance",
    "zh": "旅行保险",
    "pos": "n.",
    "ipa": "",
    "ex": "Always buy travel insurance before going on a long international trip.",
    "ex2": "Her travel insurance covered the cost of the emergency hospital visit when she fell ill abroad."
  },
  {
    "word": "suitcase",
    "zh": "行李箱",
    "pos": "n.",
    "ipa": "",
    "ex": "My suitcase was overweight—I had to remove two books.",
    "ex2": "Both suitcases were lost in transit, and it took three days for the airline to locate and return them."
  },
  {
    "word": "backpack",
    "zh": "背包",
    "pos": "n.",
    "ipa": "",
    "ex": "Backpackers usually carry everything they need in one large backpack.",
    "ex2": "She packed all her belongings into a single backpack and set off for a six-month journey around Asia."
  },
  {
    "word": "layover",
    "zh": "中途转机停留",
    "pos": "n.",
    "ipa": "",
    "ex": "We have a four-hour layover in Dubai before the connecting flight.",
    "ex2": "Their long layover in Singapore gave them just enough time to explore the city for a few hours."
  },
  {
    "word": "transit",
    "zh": "中转",
    "pos": "n.",
    "ipa": "",
    "ex": "I'm on a transit visa and cannot leave the international terminal.",
    "ex2": "Passengers in transit were required to remain in the designated lounge area throughout their stopover."
  },
  {
    "word": "baggage claim",
    "zh": "行李领取处",
    "pos": "n.",
    "ipa": "",
    "ex": "Meet me at the baggage claim area after you clear immigration.",
    "ex2": "After waiting forty minutes at the baggage claim, they realised their luggage had been put on the wrong carousel."
  },
  {
    "word": "lost luggage",
    "zh": "行李丢失",
    "pos": "phr.",
    "ipa": "",
    "ex": "Report lost luggage to the airline counter before you leave the airport.",
    "ex2": "Cases of lost luggage increased significantly during the busy summer holiday period at major airports."
  },
  {
    "word": "do not disturb",
    "zh": "请勿打扰",
    "pos": "phr.",
    "ipa": "",
    "ex": "I hung the do-not-disturb sign on the door so I could sleep in.",
    "ex2": "She left the do-not-disturb sign on for the entire morning so she could work without any interruptions."
  },
  {
    "word": "housekeeping",
    "zh": "客房打扫服务",
    "pos": "n.",
    "ipa": "",
    "ex": "I asked housekeeping to bring extra towels and a hair dryer.",
    "ex2": "Housekeeping staff cleaned all thirty rooms on the floor in under three hours every morning."
  },
  {
    "word": "complimentary",
    "zh": "免费赠送的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Breakfast is complimentary for guests staying three nights or more.",
    "ex2": "The hotel provided complimentary airport transfers for all guests who had booked through their website."
  },
  {
    "word": "late checkout",
    "zh": "延迟退房",
    "pos": "n.",
    "ipa": "",
    "ex": "Can I request a late checkout until 2 p.m. for an extra fee?",
    "ex2": "Late checkouts were being offered as a complimentary perk to guests who were members of the loyalty programme."
  },
  {
    "word": "peak season",
    "zh": "旺季",
    "pos": "n.",
    "ipa": "",
    "ex": "Flights are much more expensive during the peak summer season.",
    "ex2": "Hotels in the coastal resort were fully booked every weekend throughout the entire peak summer season."
  },
  {
    "word": "off season",
    "zh": "淡季",
    "pos": "n.",
    "ipa": "",
    "ex": "Travelling in the off season saves money and means fewer crowds.",
    "ex2": "They visited the ski resort during the off season and enjoyed the hiking trails with almost no other tourists around."
  },
  {
    "word": "local SIM card",
    "zh": "当地SIM卡",
    "pos": "n.",
    "ipa": "",
    "ex": "Buy a local SIM card at the airport for cheaper data and calls.",
    "ex2": "She picked up local SIM cards in each country to avoid the excessive roaming charges from her home provider."
  },
  {
    "word": "power bank",
    "zh": "移动电源",
    "pos": "n.",
    "ipa": "",
    "ex": "Always carry a power bank when you travel—outlets can be hard to find.",
    "ex2": "His power bank ran out halfway through the long train journey, leaving his phone dead for hours."
  },
  {
    "word": "security check",
    "zh": "安全检查",
    "pos": "n.",
    "ipa": "",
    "ex": "You must remove your laptop from the bag at the security check.",
    "ex2": "The security checks at this international airport are among the most thorough and time-consuming in the world."
  },
  {
    "word": "boarding time",
    "zh": "登机时间",
    "pos": "n.",
    "ipa": "",
    "ex": "Boarding time is 7:15 a.m.—don't be late!",
    "ex2": "They completely missed the boarding time and were denied entry to the gate despite having valid passes."
  },
  {
    "word": "check-in counter",
    "zh": "值机柜台",
    "pos": "n.",
    "ipa": "",
    "ex": "Go to the check-in counter to drop your bags and get your pass.",
    "ex2": "The check-in counters for international flights opened three hours before the scheduled departure time."
  },
  {
    "word": "all-inclusive",
    "zh": "全包价",
    "pos": "adj.",
    "ipa": "",
    "ex": "We chose an all-inclusive resort so we didn't have to worry about costs.",
    "ex2": "All-inclusive resorts are especially popular with families who prefer to pay a fixed price upfront."
  },
  {
    "word": "application form",
    "zh": "申请表",
    "pos": "n.",
    "ipa": "",
    "ex": "Fill in the application form clearly and accurately in block letters.",
    "ex2": "The completed application forms had to be submitted along with all supporting documents before the deadline."
  },
  {
    "word": "fill out",
    "zh": "填写",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "Please fill out the form completely before submitting it.",
    "ex2": "It took her nearly two hours to fill out the lengthy visa application form with all the required information."
  },
  {
    "word": "submit",
    "zh": "提交",
    "pos": "v.",
    "ipa": "",
    "ex": "Submit your application at least four weeks before your travel date.",
    "ex2": "All participants submitted their final reports online by midnight on the last day of the competition."
  },
  {
    "word": "embassy",
    "zh": "大使馆",
    "pos": "n.",
    "ipa": "",
    "ex": "I have an appointment at the French Embassy next Wednesday.",
    "ex2": "Embassies in many countries have temporarily suspended in-person appointments due to high demand."
  },
  {
    "word": "consulate",
    "zh": "领事馆",
    "pos": "n.",
    "ipa": "",
    "ex": "Visa applications can be submitted at the nearest consulate.",
    "ex2": "The consulates across the region were processing thousands of applications every working day."
  },
  {
    "word": "invitation letter",
    "zh": "邀请函",
    "pos": "n.",
    "ipa": "",
    "ex": "My friend sent me an official invitation letter for the visa.",
    "ex2": "The university provided official invitation letters for all international conference attendees needing visas."
  },
  {
    "word": "bank statement",
    "zh": "银行流水 / 对账单",
    "pos": "n.",
    "ipa": "",
    "ex": "Provide three months of bank statements to prove financial stability.",
    "ex2": "Bank statements showing a consistent salary were one of the key requirements for the visa application."
  },
  {
    "word": "proof of income",
    "zh": "收入证明",
    "pos": "n.",
    "ipa": "",
    "ex": "A letter from your employer can serve as proof of income.",
    "ex2": "Self-employed applicants needed to provide two years of tax returns as proof of income."
  },
  {
    "word": "employment letter",
    "zh": "在职证明",
    "pos": "n.",
    "ipa": "",
    "ex": "Your employer must provide an employment letter on official letterhead.",
    "ex2": "Her employment letter stated her salary, job title, and confirmed she had permission to take the time off."
  },
  {
    "word": "accommodation proof",
    "zh": "住宿证明",
    "pos": "n.",
    "ipa": "",
    "ex": "A hotel booking confirmation counts as valid accommodation proof.",
    "ex2": "Travellers staying with friends were asked to submit a letter of invitation as accommodation proof."
  },
  {
    "word": "validity",
    "zh": "有效期",
    "pos": "n.",
    "ipa": "",
    "ex": "Your passport must have a validity of at least six months.",
    "ex2": "The visa had a validity of one year but only allowed a total stay of ninety days within that period."
  },
  {
    "word": "single entry",
    "zh": "单次入境",
    "pos": "n.",
    "ipa": "",
    "ex": "A single-entry visa allows you to enter the country only once.",
    "ex2": "She was issued a single-entry visa, so she needed to reapply when she wanted to visit a second time."
  },
  {
    "word": "multiple entry",
    "zh": "多次入境",
    "pos": "n.",
    "ipa": "",
    "ex": "A multiple-entry visa is more convenient for frequent business travellers.",
    "ex2": "Multiple-entry visas are highly valued by professionals who travel frequently for international work."
  },
  {
    "word": "tourist visa",
    "zh": "旅游签证",
    "pos": "n.",
    "ipa": "",
    "ex": "Apply for a tourist visa if you're visiting purely for leisure.",
    "ex2": "Tourist visas for this country can now be obtained online in as little as 48 hours."
  },
  {
    "word": "business visa",
    "zh": "商务签证",
    "pos": "n.",
    "ipa": "",
    "ex": "A business visa is required for attending trade conferences abroad.",
    "ex2": "He applied for a business visa so he could attend meetings and sign contracts on behalf of his company."
  },
  {
    "word": "student visa",
    "zh": "学生签证",
    "pos": "n.",
    "ipa": "",
    "ex": "She received her student visa four weeks after applying online.",
    "ex2": "International students must renew their student visas annually throughout the duration of their degree."
  },
  {
    "word": "transit visa",
    "zh": "过境签证",
    "pos": "n.",
    "ipa": "",
    "ex": "Some nationalities need a transit visa even for a short layover.",
    "ex2": "Transit visas were not required for passengers remaining within the international terminal area."
  },
  {
    "word": "rejection",
    "zh": "拒签",
    "pos": "n.",
    "ipa": "",
    "ex": "After the rejection, she reapplied with more supporting documents.",
    "ex2": "Visa rejections have become more frequent due to increased scrutiny at border control authorities."
  },
  {
    "word": "appeal",
    "zh": "申诉",
    "pos": "n./v.",
    "ipa": "",
    "ex": "You have the right to appeal if your visa application is refused.",
    "ex2": "He appealed the decision after his application was rejected, and the case was reviewed by a senior officer."
  },
  {
    "word": "processing time",
    "zh": "审理时间",
    "pos": "n.",
    "ipa": "",
    "ex": "The standard processing time for this visa is ten working days.",
    "ex2": "Processing times for popular destinations have increased significantly during the summer travel season."
  },
  {
    "word": "biometrics",
    "zh": "生物特征采集",
    "pos": "n.",
    "ipa": "",
    "ex": "Attend your biometrics appointment to provide fingerprints and a photo.",
    "ex2": "Biometrics data collected at the visa centre were stored securely and used to verify identity at border control."
  },
  {
    "word": "fingerprint",
    "zh": "指纹",
    "pos": "n.",
    "ipa": "",
    "ex": "You will be asked to scan all ten fingerprints at the visa centre.",
    "ex2": "Digital fingerprinting technology has made the border clearance process much faster at major international airports."
  },
  {
    "word": "notarization",
    "zh": "公证",
    "pos": "n.",
    "ipa": "",
    "ex": "Documents in Chinese require notarization and official translation.",
    "ex2": "The notarization of foreign documents often adds several weeks to the overall visa application process."
  },
  {
    "word": "certified copy",
    "zh": "经认证副本",
    "pos": "n.",
    "ipa": "",
    "ex": "Submit certified copies of your birth certificate and marriage licence.",
    "ex2": "All certified copies must be authenticated by a recognised official before they are accepted by the consulate."
  },
  {
    "word": "reference number",
    "zh": "参考编号",
    "pos": "n.",
    "ipa": "",
    "ex": "Quote your reference number when enquiring about your application.",
    "ex2": "She lost her reference number and could not track the progress of her visa application online."
  },
  {
    "word": "duration of stay",
    "zh": "停留时长",
    "pos": "n.",
    "ipa": "",
    "ex": "The visa permits a maximum duration of stay of 90 days.",
    "ex2": "Travellers who exceed the approved duration of stay may face fines or be banned from future entry."
  },
  {
    "word": "purpose of visit",
    "zh": "访问目的",
    "pos": "n.",
    "ipa": "",
    "ex": "State your purpose of visit clearly on the application form.",
    "ex2": "The immigration officer asked several questions about the purpose of his visit and his employment status."
  },
  {
    "word": "overstay",
    "zh": "超期逗留",
    "pos": "v./n.",
    "ipa": "",
    "ex": "Overstaying your visa can result in a ban from re-entering the country.",
    "ex2": "Thousands of tourists overstayed their visas each year, creating significant challenges for immigration authorities."
  },
  {
    "word": "residence permit",
    "zh": "居留许可",
    "pos": "n.",
    "ipa": "",
    "ex": "After living there for a year, she applied for a residence permit.",
    "ex2": "Residence permits must be renewed every two years and require proof of ongoing employment or study."
  },
  {
    "word": "extension",
    "zh": "续签 / 延期",
    "pos": "n.",
    "ipa": "",
    "ex": "She applied for a visa extension before her original one expired.",
    "ex2": "Extensions to the original visa were only granted in exceptional circumstances, such as medical emergencies."
  },
  {
    "word": "point of entry",
    "zh": "入境口岸",
    "pos": "n.",
    "ipa": "",
    "ex": "Declare your point of entry clearly on the arrival card.",
    "ex2": "All points of entry along the border were temporarily closed due to the regional health emergency."
  },
  {
    "word": "sponsor",
    "zh": "担保人",
    "pos": "n.",
    "ipa": "",
    "ex": "The company acted as a sponsor for the employee's work visa.",
    "ex2": "Applicants without a local sponsor found it significantly harder to obtain a long-stay visa."
  },
  {
    "word": "self-employed",
    "zh": "自雇",
    "pos": "adj.",
    "ipa": "",
    "ex": "Self-employed applicants must submit tax records as income proof.",
    "ex2": "Being self-employed makes visa applications more complex, as income can vary significantly from year to year."
  },
  {
    "word": "menu",
    "zh": "菜单",
    "pos": "n.",
    "ipa": "",
    "ex": "Could we see the menu, please? We're ready to order.",
    "ex2": "The restaurant's menus are updated every season to reflect the freshest locally available ingredients."
  },
  {
    "word": "order",
    "zh": "点餐 / 订单",
    "pos": "n./v.",
    "ipa": "",
    "ex": "Are you ready to order, or do you need a few more minutes?",
    "ex2": "She ordered two different starters for the table so they could try a wider variety of dishes."
  },
  {
    "word": "appetizer",
    "zh": "开胃菜",
    "pos": "n.",
    "ipa": "",
    "ex": "We shared a soup and salad as appetizers before the main course.",
    "ex2": "The restaurant is known for its creative appetizers, which change daily based on what the chefs can source."
  },
  {
    "word": "main course",
    "zh": "主菜",
    "pos": "n.",
    "ipa": "",
    "ex": "For the main course, I'll have the grilled salmon, please.",
    "ex2": "Both main courses arrived beautifully presented but unfortunately were not as flavourful as expected."
  },
  {
    "word": "dessert",
    "zh": "甜点",
    "pos": "n.",
    "ipa": "",
    "ex": "I'm too full for dessert—maybe just a coffee.",
    "ex2": "The desserts were so impressive that everyone ordered something, even those who claimed to be full."
  },
  {
    "word": "side dish",
    "zh": "配菜",
    "pos": "n.",
    "ipa": "",
    "ex": "Would you like to choose a side dish to go with your steak?",
    "ex2": "She ordered three different side dishes to share so they could try all the seasonal vegetables on offer."
  },
  {
    "word": "beverage",
    "zh": "饮料",
    "pos": "n.",
    "ipa": "",
    "ex": "What beverages are available? I'd like something non-alcoholic.",
    "ex2": "The premium beverages menu featured artisan teas and freshly squeezed juices alongside the usual soft drinks."
  },
  {
    "word": "sparkling water",
    "zh": "气泡水",
    "pos": "n.",
    "ipa": "",
    "ex": "Still or sparkling water for the table tonight?",
    "ex2": "He prefers sparkling water over still because it aids his digestion after a large meal."
  },
  {
    "word": "vegetarian",
    "zh": "素食的 / 素食者",
    "pos": "adj./n.",
    "ipa": "",
    "ex": "Do you have any vegetarian options on the menu today?",
    "ex2": "Vegetarians at the dinner had a wide selection of creative plant-based dishes to choose from."
  },
  {
    "word": "vegan",
    "zh": "纯素食的 / 纯素食者",
    "pos": "adj./n.",
    "ipa": "",
    "ex": "She is vegan, so she avoids all animal products including dairy.",
    "ex2": "The growing demand from vegans has encouraged many mainstream restaurants to expand their plant-based menus."
  },
  {
    "word": "gluten-free",
    "zh": "无麸质的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Is this dish gluten-free? I have a wheat intolerance.",
    "ex2": "The bakery offers an entirely gluten-free range for customers with coeliac disease or wheat sensitivities."
  },
  {
    "word": "allergen",
    "zh": "过敏原",
    "pos": "n.",
    "ipa": "",
    "ex": "Please check for nut allergens—my son has a severe nut allergy.",
    "ex2": "By law, restaurants must clearly label all major allergens on their menus to protect customers with allergies."
  },
  {
    "word": "spicy",
    "zh": "辣的",
    "pos": "adj.",
    "ipa": "",
    "ex": "How spicy is this dish? I can only handle mild heat.",
    "ex2": "He enjoyed the spiciest dishes on the menu, often adding extra chilli sauce to make them even hotter."
  },
  {
    "word": "well done",
    "zh": "全熟的",
    "pos": "adj.",
    "ipa": "",
    "ex": "I'd like my steak well done, no pink at all please.",
    "ex2": "He always orders his steak well done, which the chef says takes a few extra minutes to prepare properly."
  },
  {
    "word": "medium",
    "zh": "五分熟的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Could I have the burger cooked medium with a little pink inside?",
    "ex2": "She changed her mind and asked the waiter to have her medium steak cooked to well done instead."
  },
  {
    "word": "rare",
    "zh": "三分熟的",
    "pos": "adj.",
    "ipa": "",
    "ex": "He prefers his beef rare—just seared on the outside.",
    "ex2": "The chef recommended the sirloin cooked rare to best appreciate the quality and natural flavour of the meat."
  },
  {
    "word": "portion",
    "zh": "份量",
    "pos": "n.",
    "ipa": "",
    "ex": "The portions here are enormous—we could easily share one dish.",
    "ex2": "Smaller portions allowed the group to order more dishes and share the experience of tasting the whole menu."
  },
  {
    "word": "dine in",
    "zh": "堂食",
    "pos": "phr.",
    "ipa": "",
    "ex": "I prefer to dine in rather than eat at my desk every day.",
    "ex2": "They chose to dine in despite the long wait, as the atmosphere inside the restaurant was simply beautiful."
  },
  {
    "word": "table for two",
    "zh": "两人桌",
    "pos": "phr.",
    "ipa": "",
    "ex": "Good evening—do you have a table for two available tonight?",
    "ex2": "She arrived early to secure a table for two by the window, which had a beautiful view of the harbour."
  },
  {
    "word": "waiter",
    "zh": "服务员",
    "pos": "n.",
    "ipa": "",
    "ex": "Excuse me, waiter—could we have the bill when you're ready?",
    "ex2": "The waiters were attentive and friendly, making the entire dining experience thoroughly enjoyable."
  },
  {
    "word": "bill",
    "zh": "账单",
    "pos": "n.",
    "ipa": "",
    "ex": "Could we have the bill, please? We're in a bit of a hurry.",
    "ex2": "The bills arrived quickly and included a breakdown of all the individual items and the service charge."
  },
  {
    "word": "split the bill",
    "zh": "AA制 / 分摊账单",
    "pos": "phr.",
    "ipa": "",
    "ex": "Shall we split the bill equally or pay for our own orders?",
    "ex2": "They decided to split the bill down the middle rather than calculating each person's individual share."
  },
  {
    "word": "treat",
    "zh": "请客",
    "pos": "v./n.",
    "ipa": "",
    "ex": "I'll treat you to lunch today—it's your birthday after all!",
    "ex2": "He treated the whole team to dinner as a thank-you after they successfully delivered the project on time."
  },
  {
    "word": "recommendation",
    "zh": "推荐",
    "pos": "n.",
    "ipa": "",
    "ex": "What's your recommendation? I've never been here before.",
    "ex2": "The waiter's recommendations were all excellent, so they trusted him completely for the rest of the evening."
  },
  {
    "word": "daily special",
    "zh": "今日特供",
    "pos": "n.",
    "ipa": "",
    "ex": "The daily special is roast duck with seasonal vegetables today.",
    "ex2": "Daily specials are written on a chalkboard at the entrance and change entirely depending on market availability."
  },
  {
    "word": "set meal",
    "zh": "套餐",
    "pos": "n.",
    "ipa": "",
    "ex": "The set meal includes a starter, main course, and a soft drink.",
    "ex2": "Set meals are the most popular choice at lunchtime because they offer great value within a fixed budget."
  },
  {
    "word": "buffet",
    "zh": "自助餐",
    "pos": "n.",
    "ipa": "",
    "ex": "The hotel serves an all-you-can-eat breakfast buffet every morning.",
    "ex2": "The wedding reception featured an extensive buffet with dishes representing five different cuisines."
  },
  {
    "word": "waiting list",
    "zh": "候位名单",
    "pos": "n.",
    "ipa": "",
    "ex": "We're fully booked, but I can put you on the waiting list.",
    "ex2": "Their names had been on the waiting list for over two months before a table finally became available."
  },
  {
    "word": "outdoor seating",
    "zh": "户外座位",
    "pos": "n.",
    "ipa": "",
    "ex": "Could we have a table in the outdoor seating area? The weather's lovely.",
    "ex2": "The new outdoor seating area accommodates an additional forty covers and overlooks the riverside garden."
  },
  {
    "word": "non-smoking",
    "zh": "无烟区",
    "pos": "adj.",
    "ipa": "",
    "ex": "We'd prefer a table in the non-smoking section, please.",
    "ex2": "All indoor dining areas in the city became non-smoking by law, forcing venues to adapt their layouts."
  },
  {
    "word": "refill",
    "zh": "续杯",
    "pos": "n./v.",
    "ipa": "",
    "ex": "May I have a refill on the iced tea? It's very refreshing.",
    "ex2": "Free refills on soft drinks are offered throughout your entire meal at most fast-food restaurants in the US."
  },
  {
    "word": "to go",
    "zh": "打包带走",
    "pos": "phr.",
    "ipa": "",
    "ex": "Could you box up the rest of my pasta to go, please?",
    "ex2": "She asked for everything to go because she had a last-minute meeting and could not stay to eat inside."
  },
  {
    "word": "sauce",
    "zh": "酱料",
    "pos": "n.",
    "ipa": "",
    "ex": "Could I have extra sauce on the side, please?",
    "ex2": "The restaurant is famous for its house-made sauces, which are all prepared fresh each morning from scratch."
  },
  {
    "word": "dairy-free",
    "zh": "无乳制品的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Do you have a dairy-free option? I'm lactose intolerant.",
    "ex2": "The café offers a wide range of dairy-free alternatives, including oat, soy, almond, and coconut milk."
  },
  {
    "word": "grilled",
    "zh": "烤的",
    "pos": "adj.",
    "ipa": "",
    "ex": "I'll have the grilled chicken breast with a green salad.",
    "ex2": "The freshly grilled vegetables were seasoned with olive oil, garlic, and fresh herbs from the garden."
  },
  {
    "word": "steamed",
    "zh": "蒸的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Could you make the vegetables steamed rather than fried?",
    "ex2": "Steamed fish with ginger and spring onions is one of the most popular dishes in Cantonese cooking."
  },
  {
    "word": "fresh",
    "zh": "新鲜的",
    "pos": "adj.",
    "ipa": "",
    "ex": "All our seafood is fresh and delivered daily from the market.",
    "ex2": "The freshest produce is always found at the early morning market before the best items are sold out."
  },
  {
    "word": "organic",
    "zh": "有机的",
    "pos": "adj.",
    "ipa": "",
    "ex": "We use organic, locally sourced ingredients wherever possible.",
    "ex2": "Demand for organic food has grown steadily as consumers become more concerned about health and sustainability."
  },
  {
    "word": "complimentary bread",
    "zh": "赠送的面包",
    "pos": "n.",
    "ipa": "",
    "ex": "The waiter brought complimentary bread and butter to the table.",
    "ex2": "Complimentary breads and dips were served while we waited for our starters to be prepared in the kitchen."
  },
  {
    "word": "corkage fee",
    "zh": "开瓶费",
    "pos": "n.",
    "ipa": "",
    "ex": "There is a small corkage fee if you bring your own wine.",
    "ex2": "The restaurant waived the corkage fees for regular customers who brought a bottle to celebrate a special occasion."
  },
  {
    "word": "nurse",
    "zh": "护士",
    "pos": "n.",
    "ipa": "",
    "ex": "The nurse took my blood pressure and temperature on arrival.",
    "ex2": "The nurses worked twelve-hour shifts and cared for dozens of patients throughout the night."
  },
  {
    "word": "patient",
    "zh": "病人",
    "pos": "n.",
    "ipa": "",
    "ex": "The waiting room was full of patients this morning.",
    "ex2": "Patients who needed urgent care were seen immediately, while those with minor issues waited several hours."
  },
  {
    "word": "clinic",
    "zh": "诊所",
    "pos": "n.",
    "ipa": "",
    "ex": "There is a walk-in clinic open on weekends near the station.",
    "ex2": "Several new clinics have opened in underserved communities to improve access to basic medical care."
  },
  {
    "word": "emergency room",
    "zh": "急诊室",
    "pos": "n.",
    "ipa": "",
    "ex": "He was rushed to the emergency room after the car accident.",
    "ex2": "Emergency rooms across the city were overwhelmed during the winter flu season with record patient numbers."
  },
  {
    "word": "waiting room",
    "zh": "候诊室",
    "pos": "n.",
    "ipa": "",
    "ex": "Please take a seat in the waiting room—the doctor will see you soon.",
    "ex2": "The waiting rooms had been redesigned to be more comfortable and calming for anxious patients."
  },
  {
    "word": "prescription",
    "zh": "处方",
    "pos": "n.",
    "ipa": "",
    "ex": "The doctor wrote me a prescription for antibiotics.",
    "ex2": "She picked up all three prescriptions from the pharmacy and carefully read the instructions for each."
  },
  {
    "word": "medicine",
    "zh": "药",
    "pos": "n.",
    "ipa": "",
    "ex": "Take this medicine twice a day with food, not on an empty stomach.",
    "ex2": "She organised her medicines in a weekly pill organiser so she never forgot to take any of them."
  },
  {
    "word": "tablet",
    "zh": "药片",
    "pos": "n.",
    "ipa": "",
    "ex": "Swallow the tablet whole with a full glass of water.",
    "ex2": "He forgot to take his tablets for three days in a row and his symptoms started to return."
  },
  {
    "word": "dosage",
    "zh": "用量 / 剂量",
    "pos": "n.",
    "ipa": "",
    "ex": "Do not exceed the recommended dosage stated on the label.",
    "ex2": "The dosages were carefully adjusted based on the patient's weight, age, and current kidney function."
  },
  {
    "word": "side effect",
    "zh": "副作用",
    "pos": "n.",
    "ipa": "",
    "ex": "Drowsiness is a common side effect of this antihistamine.",
    "ex2": "The medication had several unpleasant side effects, so the doctor switched her to an alternative treatment."
  },
  {
    "word": "symptom",
    "zh": "症状",
    "pos": "n.",
    "ipa": "",
    "ex": "What are your main symptoms, and when did they first appear?",
    "ex2": "Common symptoms of the infection include fever, a dry cough, fatigue, and loss of taste or smell."
  },
  {
    "word": "diagnosis",
    "zh": "诊断",
    "pos": "n.",
    "ipa": "",
    "ex": "The doctor gave a preliminary diagnosis of a mild respiratory infection.",
    "ex2": "The final diagnoses were confirmed only after receiving the results of multiple laboratory tests."
  },
  {
    "word": "treatment",
    "zh": "治疗",
    "pos": "n.",
    "ipa": "",
    "ex": "The treatment involves a two-week course of antibiotics.",
    "ex2": "The treatments available for this condition have improved significantly over the past decade."
  },
  {
    "word": "surgery",
    "zh": "手术",
    "pos": "n.",
    "ipa": "",
    "ex": "He had surgery on his knee after the sports injury last month.",
    "ex2": "She underwent two surgeries in the space of a year and spent months recovering from each one."
  },
  {
    "word": "recovery",
    "zh": "康复",
    "pos": "n.",
    "ipa": "",
    "ex": "Her recovery is going well—she should be home within the week.",
    "ex2": "His recovery from the operation was remarkably quick, thanks to his excellent physical condition beforehand."
  },
  {
    "word": "discharge",
    "zh": "出院",
    "pos": "n./v.",
    "ipa": "",
    "ex": "The doctor will discharge him if the test results look normal.",
    "ex2": "She was discharged with detailed instructions for wound care and a follow-up appointment for the following week."
  },
  {
    "word": "health insurance",
    "zh": "医疗保险",
    "pos": "n.",
    "ipa": "",
    "ex": "Please bring your health insurance card when you visit the clinic.",
    "ex2": "Without health insurance, the cost of the treatment would have been completely unaffordable for the family."
  },
  {
    "word": "referral",
    "zh": "转诊",
    "pos": "n.",
    "ipa": "",
    "ex": "You'll need a GP referral before seeing a specialist.",
    "ex2": "The referrals for specialist care were taking several months due to extremely high demand at local hospitals."
  },
  {
    "word": "specialist",
    "zh": "专科医生",
    "pos": "n.",
    "ipa": "",
    "ex": "My GP referred me to a specialist for further tests.",
    "ex2": "She was finally seen by a specialist after waiting six weeks for her initial consultation appointment."
  },
  {
    "word": "GP",
    "zh": "全科医生 / General Practitioner",
    "pos": "n.",
    "ipa": "",
    "ex": "Register with a local GP as soon as you move to a new area.",
    "ex2": "Her GP had been monitoring her blood pressure closely for three years and was pleased with the improvement."
  },
  {
    "word": "blood test",
    "zh": "血液检测",
    "pos": "n.",
    "ipa": "",
    "ex": "The doctor ordered a blood test to check for vitamin deficiencies.",
    "ex2": "Blood tests were taken at regular intervals throughout the course of treatment to monitor her progress."
  },
  {
    "word": "X-ray",
    "zh": "X射线检查",
    "pos": "n.",
    "ipa": "",
    "ex": "The nurse took an X-ray to check if the bone was fractured.",
    "ex2": "X-rays of both knees were taken to assess the extent of the damage from the fall."
  },
  {
    "word": "MRI",
    "zh": "核磁共振",
    "pos": "n.",
    "ipa": "",
    "ex": "The MRI scan showed no abnormalities in the brain.",
    "ex2": "MRI scans are particularly useful for detecting soft tissue injuries that do not show up on standard X-rays."
  },
  {
    "word": "blood pressure",
    "zh": "血压",
    "pos": "n.",
    "ipa": "",
    "ex": "Your blood pressure is slightly high—try to reduce salt intake.",
    "ex2": "High blood pressure often shows no symptoms, which is why regular monitoring is so important for older adults."
  },
  {
    "word": "temperature",
    "zh": "体温",
    "pos": "n.",
    "ipa": "",
    "ex": "The nurse checked my temperature—it was 38.5 degrees.",
    "ex2": "Temperatures were checked at the entrance to the venue as a health screening measure during the outbreak."
  },
  {
    "word": "allergy",
    "zh": "过敏",
    "pos": "n.",
    "ipa": "",
    "ex": "I have a serious allergy to penicillin—please note it on my file.",
    "ex2": "Food allergies can develop at any age, even in people who have eaten the food safely for many years before."
  },
  {
    "word": "injection",
    "zh": "注射",
    "pos": "n.",
    "ipa": "",
    "ex": "The nurse gave me an injection in my upper arm.",
    "ex2": "She received her second injection at the follow-up appointment, completing the full course of vaccinations."
  },
  {
    "word": "vaccination",
    "zh": "疫苗接种",
    "pos": "n.",
    "ipa": "",
    "ex": "Annual flu vaccination is recommended for elderly patients.",
    "ex2": "Mass vaccination programmes have successfully eliminated or greatly reduced many previously deadly diseases."
  },
  {
    "word": "vaccine",
    "zh": "疫苗",
    "pos": "n.",
    "ipa": "",
    "ex": "The vaccine is free of charge for all children under five.",
    "ex2": "New vaccines for the disease are being developed simultaneously by research teams across multiple countries."
  },
  {
    "word": "bandage",
    "zh": "绷带",
    "pos": "n.",
    "ipa": "",
    "ex": "The nurse cleaned the wound and wrapped it in a clean bandage.",
    "ex2": "The bandages needed to be changed every day to keep the wound clean and to check for any signs of infection."
  },
  {
    "word": "wound",
    "zh": "伤口",
    "pos": "n.",
    "ipa": "",
    "ex": "Keep the wound clean and dry to prevent infection.",
    "ex2": "The wounds healed slowly because she continued to work throughout her recovery instead of resting."
  },
  {
    "word": "headache",
    "zh": "头痛",
    "pos": "n.",
    "ipa": "",
    "ex": "I've had a splitting headache since this morning—do you have aspirin?",
    "ex2": "Recurring headaches that last several days should be discussed with a doctor as they may signal an underlying issue."
  },
  {
    "word": "stomachache",
    "zh": "胃痛 / 腹痛",
    "pos": "n.",
    "ipa": "",
    "ex": "He complained of a stomachache after eating at the street stall.",
    "ex2": "Children often complain of stomachaches before school when they are feeling anxious about the day ahead."
  },
  {
    "word": "fever",
    "zh": "发烧",
    "pos": "n.",
    "ipa": "",
    "ex": "She has a high fever—her temperature is 39 degrees Celsius.",
    "ex2": "Fevers in young children can escalate very quickly and should always be monitored closely by a parent."
  },
  {
    "word": "cold",
    "zh": "感冒",
    "pos": "n.",
    "ipa": "",
    "ex": "I caught a cold and had to stay home for three days.",
    "ex2": "She caught three colds in quick succession last winter due to her exhausted immune system."
  },
  {
    "word": "flu",
    "zh": "流感",
    "pos": "n.",
    "ipa": "",
    "ex": "The flu spread quickly through the entire office in January.",
    "ex2": "Seasonal flu strains mutate annually, which is why health authorities recommend getting vaccinated every year."
  },
  {
    "word": "cough",
    "zh": "咳嗽",
    "pos": "n./v.",
    "ipa": "",
    "ex": "I've had a dry cough for over a week—should I see a doctor?",
    "ex2": "She was coughing so frequently during the lecture that she had to excuse herself from the classroom."
  },
  {
    "word": "runny nose",
    "zh": "流鼻涕",
    "pos": "phr.",
    "ipa": "",
    "ex": "He woke up with a runny nose and sore throat this morning.",
    "ex2": "She suffered from a persistent runny nose for weeks before the doctor identified it as a dust allergy."
  },
  {
    "word": "sore throat",
    "zh": "喉咙痛",
    "pos": "n.",
    "ipa": "",
    "ex": "Gargling with salt water can soothe a sore throat.",
    "ex2": "He developed a sore throat and mild fever the day after attending the crowded outdoor concert."
  },
  {
    "word": "infection",
    "zh": "感染",
    "pos": "n.",
    "ipa": "",
    "ex": "The wound became infected—she needs a course of antibiotics.",
    "ex2": "Bacterial infections can develop rapidly if minor wounds are not properly cleaned and covered in time."
  },
  {
    "word": "antibiotic",
    "zh": "抗生素",
    "pos": "n.",
    "ipa": "",
    "ex": "Finish the full course of antibiotics, even if you feel better.",
    "ex2": "Overuse of antibiotics has led to the emergence of resistant strains of bacteria that are difficult to treat."
  },
  {
    "word": "painkiller",
    "zh": "止痛药",
    "pos": "n.",
    "ipa": "",
    "ex": "Take one painkiller every six hours if the pain is severe.",
    "ex2": "She relied heavily on painkillers during the first week of recovery, but gradually reduced her intake as she healed."
  },
  {
    "word": "pharmacy",
    "zh": "药房 / 药店",
    "pos": "n.",
    "ipa": "",
    "ex": "The nearest 24-hour pharmacy is two blocks down the street.",
    "ex2": "The pharmacies near the hospital are always busy with patients collecting prescriptions after their appointments."
  },
  {
    "word": "medical record",
    "zh": "病历",
    "pos": "n.",
    "ipa": "",
    "ex": "Please bring your medical records when visiting a new hospital.",
    "ex2": "Her complete medical records were transferred electronically to the new specialist she had been referred to."
  },
  {
    "word": "follow-up",
    "zh": "复诊",
    "pos": "n.",
    "ipa": "",
    "ex": "Book a follow-up appointment in two weeks to check your progress.",
    "ex2": "All post-operative patients were required to attend follow-up consultations at one week, one month, and six months."
  },
  {
    "word": "ambulance",
    "zh": "救护车",
    "pos": "n.",
    "ipa": "",
    "ex": "Call an ambulance immediately—he's not breathing properly.",
    "ex2": "Ambulances were dispatched to the scene within six minutes and the patient was stabilised before reaching the hospital."
  },
  {
    "word": "emergency",
    "zh": "紧急情况",
    "pos": "n.",
    "ipa": "",
    "ex": "In a medical emergency, call 120 in China or 911 in the US.",
    "ex2": "The team was trained to respond calmly and effectively to a wide range of medical emergencies in the workplace."
  },
  {
    "word": "fracture",
    "zh": "骨折",
    "pos": "n.",
    "ipa": "",
    "ex": "The X-ray confirmed she had a hairline fracture in her wrist.",
    "ex2": "Stress fractures are common in runners who increase their training intensity too quickly without adequate rest."
  },
  {
    "word": "sprain",
    "zh": "扭伤",
    "pos": "n./v.",
    "ipa": "",
    "ex": "I sprained my ankle while running and had to use crutches.",
    "ex2": "She sprained her wrist so badly during the fall that she could not type or write for nearly three weeks."
  },
  {
    "word": "nausea",
    "zh": "恶心",
    "pos": "n.",
    "ipa": "",
    "ex": "She felt severe nausea after taking the medication on an empty stomach.",
    "ex2": "Persistent nausea lasting more than a few days is a symptom that should always be discussed with a doctor."
  },
  {
    "word": "vomit",
    "zh": "呕吐",
    "pos": "v./n.",
    "ipa": "",
    "ex": "He vomited twice overnight, so we took him straight to the clinic.",
    "ex2": "She was vomiting frequently after the surgery as a reaction to the anaesthetic, which gradually wore off."
  },
  {
    "word": "diarrhea",
    "zh": "腹泻",
    "pos": "n.",
    "ipa": "",
    "ex": "Drink plenty of fluids if you have diarrhea to stay hydrated.",
    "ex2": "Travellers often experience diarrhea when their digestive systems are exposed to unfamiliar food and water abroad."
  },
  {
    "word": "rash",
    "zh": "皮疹",
    "pos": "n.",
    "ipa": "",
    "ex": "She developed a red rash all over her arms after touching the plant.",
    "ex2": "The allergic rashes spread rapidly after she unknowingly consumed the allergen at the dinner event."
  },
  {
    "word": "dizzy",
    "zh": "头晕的",
    "pos": "adj.",
    "ipa": "",
    "ex": "I felt dizzy when I stood up too quickly from the chair.",
    "ex2": "She had been feeling dizzy and lightheaded all day, which her doctor attributed to dehydration and low iron."
  },
  {
    "word": "faint",
    "zh": "昏厥 / 晕倒",
    "pos": "v./adj.",
    "ipa": "",
    "ex": "She fainted during the ceremony because of the extreme heat.",
    "ex2": "He fainted on the platform and was carried to a first aid room while waiting for the paramedics to arrive."
  },
  {
    "word": "ward",
    "zh": "病房",
    "pos": "n.",
    "ipa": "",
    "ex": "He was moved from the ICU to a general ward after two days.",
    "ex2": "Visiting hours on the wards were strictly limited to prevent disturbing patients who needed rest."
  },
  {
    "word": "physical exam",
    "zh": "体检",
    "pos": "n.",
    "ipa": "",
    "ex": "A full physical exam is required before starting the new job.",
    "ex2": "Annual physical exams help identify health issues early, often before any obvious symptoms have appeared."
  },
  {
    "word": "chronic",
    "zh": "慢性的",
    "pos": "adj.",
    "ipa": "",
    "ex": "He manages his chronic back pain with physiotherapy and exercise.",
    "ex2": "Living with chronic pain requires long-term strategies involving medication, therapy, and lifestyle adjustments."
  },
  {
    "word": "second opinion",
    "zh": "第二诊断意见",
    "pos": "n.",
    "ipa": "",
    "ex": "I'd like to get a second opinion before agreeing to surgery.",
    "ex2": "She sought second opinions from three different specialists before finally deciding on the best course of treatment."
  },
  {
    "word": "consent form",
    "zh": "知情同意书",
    "pos": "n.",
    "ipa": "",
    "ex": "Sign the consent form before any surgical procedure can begin.",
    "ex2": "Consent forms for clinical trials must be written in plain language so that all participants can understand them."
  },
  {
    "word": "outpatient",
    "zh": "门诊 / 门诊患者",
    "pos": "adj./n.",
    "ipa": "",
    "ex": "The procedure is done on an outpatient basis—no overnight stay needed.",
    "ex2": "Most outpatients were seen within an hour of their scheduled appointment time at the new clinic."
  },
  {
    "word": "shop",
    "zh": "商店 / 购物",
    "pos": "n./v.",
    "ipa": "",
    "ex": "I love to shop for fresh produce at the weekend market.",
    "ex2": "She spent the entire afternoon shopping for new furniture and appliances for the newly renovated apartment."
  },
  {
    "word": "mall",
    "zh": "购物中心",
    "pos": "n.",
    "ipa": "",
    "ex": "The new mall has over 200 stores and a large food court.",
    "ex2": "Malls in the city centre were offering extended opening hours during the festive shopping season."
  },
  {
    "word": "sale",
    "zh": "特卖 / 打折",
    "pos": "n.",
    "ipa": "",
    "ex": "Everything in the store is 50% off during the annual sale.",
    "ex2": "The end-of-season sales attracted thousands of bargain hunters who queued outside stores from early morning."
  },
  {
    "word": "promotion",
    "zh": "促销活动",
    "pos": "n.",
    "ipa": "",
    "ex": "There's a buy-one-get-one-free promotion on all shoes this week.",
    "ex2": "The restaurant's lunchtime promotions have attracted a completely new group of customers on weekdays."
  },
  {
    "word": "coupon",
    "zh": "优惠券",
    "pos": "n.",
    "ipa": "",
    "ex": "I saved over 200 yuan by using coupons at the supermarket.",
    "ex2": "Digital coupons are sent directly to members' phones each week, encouraging repeat visits to the store."
  },
  {
    "word": "price tag",
    "zh": "价格标签",
    "pos": "n.",
    "ipa": "",
    "ex": "Check the price tag—this jacket costs more than I expected.",
    "ex2": "The price tags on several items had been placed incorrectly, causing confusion at the checkout counter."
  },
  {
    "word": "try on",
    "zh": "试穿",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "Can I try on this dress in a size medium, please?",
    "ex2": "She tried on fourteen different pairs of shoes before finally finding the perfect ones for the wedding."
  },
  {
    "word": "fitting room",
    "zh": "试衣间",
    "pos": "n.",
    "ipa": "",
    "ex": "The fitting rooms are at the back of the store on the right.",
    "ex2": "All fitting rooms were occupied throughout the sale, with long queues of impatient shoppers waiting outside."
  },
  {
    "word": "exchange",
    "zh": "换货",
    "pos": "n./v.",
    "ipa": "",
    "ex": "Can I exchange this shirt for a larger size? It doesn't fit.",
    "ex2": "She exchanged both pairs of shoes within seven days as the sizes were slightly different from what she expected."
  },
  {
    "word": "return",
    "zh": "退货",
    "pos": "n./v.",
    "ipa": "",
    "ex": "You can return the item within 30 days with the original receipt.",
    "ex2": "Returned goods must be in their original packaging with all tags still attached and the receipt presented."
  },
  {
    "word": "warranty",
    "zh": "质保 / 保修",
    "pos": "n.",
    "ipa": "",
    "ex": "The laptop comes with a two-year warranty covering all defects.",
    "ex2": "Extended warranties are available for purchase at an additional cost when you buy most major appliances."
  },
  {
    "word": "brand",
    "zh": "品牌",
    "pos": "n.",
    "ipa": "",
    "ex": "She only buys shoes from well-known international brands.",
    "ex2": "Many luxury brands have opened flagship stores in the new shopping district to attract high-end shoppers."
  },
  {
    "word": "out of stock",
    "zh": "缺货",
    "pos": "phr.",
    "ipa": "",
    "ex": "Sorry, this colour is currently out of stock—check back next week.",
    "ex2": "The most popular sizes were all out of stock within the first hour of the online flash sale going live."
  },
  {
    "word": "sold out",
    "zh": "售罄",
    "pos": "phr.",
    "ipa": "",
    "ex": "The new model sold out within minutes of going on sale.",
    "ex2": "Both evening performances were completely sold out, so they had to book tickets for the Sunday matinée instead."
  },
  {
    "word": "online shopping",
    "zh": "网购",
    "pos": "n.",
    "ipa": "",
    "ex": "Online shopping has become the default for most young consumers.",
    "ex2": "The convenience of online shopping has led to a significant decline in foot traffic in traditional high streets."
  },
  {
    "word": "free shipping",
    "zh": "免运费",
    "pos": "phr.",
    "ipa": "",
    "ex": "Orders above 200 yuan qualify for free shipping to your door.",
    "ex2": "Free shipping offers on all purchases over a minimum spend have significantly boosted the site's conversion rates."
  },
  {
    "word": "tracking number",
    "zh": "快递单号",
    "pos": "n.",
    "ipa": "",
    "ex": "Use your tracking number to check where your parcel is right now.",
    "ex2": "She shared the tracking number with her colleague so he could monitor the delivery himself."
  },
  {
    "word": "checkout",
    "zh": "结账",
    "pos": "n.",
    "ipa": "",
    "ex": "Add items to your cart and proceed to checkout when you're ready.",
    "ex2": "The checkout process was redesigned to reduce the number of steps and improve the customer's experience."
  },
  {
    "word": "refund",
    "zh": "退款",
    "pos": "n./v.",
    "ipa": "",
    "ex": "The refund should appear in your account within five working days.",
    "ex2": "She was refunded the full amount within 24 hours after the company confirmed the error in her order."
  },
  {
    "word": "customer service",
    "zh": "客户服务",
    "pos": "n.",
    "ipa": "",
    "ex": "Contact customer service if your item arrives damaged.",
    "ex2": "The company's customer service team won an industry award for resolving complaints within the shortest time."
  },
  {
    "word": "bargain",
    "zh": "便宜货 / 讨价还价",
    "pos": "n./v.",
    "ipa": "",
    "ex": "You can often bargain at the night market and get a much better price.",
    "ex2": "She bargained confidently at the antique market and eventually bought the vase for half the asking price."
  },
  {
    "word": "second-hand",
    "zh": "二手的",
    "pos": "adj.",
    "ipa": "",
    "ex": "I bought a second-hand bicycle in great condition for a fraction of the price.",
    "ex2": "Second-hand clothing markets have become fashionable as younger shoppers look for unique and sustainable options."
  },
  {
    "word": "authentic",
    "zh": "正品的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Always buy from official stores to ensure the product is authentic.",
    "ex2": "The watch was certified as authentic by an independent expert before the final sale price was agreed."
  },
  {
    "word": "clearance",
    "zh": "清仓",
    "pos": "n.",
    "ipa": "",
    "ex": "They're having a clearance sale to make room for new stock.",
    "ex2": "Clearance items are non-refundable and cannot be exchanged once purchased, as noted on all price tags."
  },
  {
    "word": "limited edition",
    "zh": "限量版",
    "pos": "n.",
    "ipa": "",
    "ex": "This limited edition sneaker sold out in under ten minutes.",
    "ex2": "Limited edition collaborations between fashion brands and artists often sell for far more than their original price."
  },
  {
    "word": "gift wrap",
    "zh": "礼品包装",
    "pos": "n.",
    "ipa": "",
    "ex": "Would you like gift wrapping? It's free for purchases over 50 yuan.",
    "ex2": "She requested gift wrapping for all three items as they were birthday presents for different members of the family."
  },
  {
    "word": "duty free",
    "zh": "免税",
    "pos": "adj.",
    "ipa": "",
    "ex": "You can buy perfume and spirits duty free at the airport.",
    "ex2": "Duty free allowances vary by country, so it is worth checking the regulations before making large purchases."
  },
  {
    "word": "bestseller",
    "zh": "畅销品",
    "pos": "n.",
    "ipa": "",
    "ex": "This book has been on the bestseller list for six consecutive months.",
    "ex2": "The store's bestsellers are displayed prominently near the entrance to attract customers as soon as they walk in."
  },
  {
    "word": "defective",
    "zh": "有缺陷的",
    "pos": "adj.",
    "ipa": "",
    "ex": "They sent a defective item so I'm returning it for a replacement.",
    "ex2": "Thousands of defective units were recalled by the manufacturer after safety concerns were reported by users."
  },
  {
    "word": "metro",
    "zh": "地铁 / 城铁",
    "pos": "n.",
    "ipa": "",
    "ex": "Take the metro Line 2 and get off at People's Square station.",
    "ex2": "Metro systems in major Chinese cities are remarkably clean, punctual, and affordable compared to many global counterparts."
  },
  {
    "word": "tram",
    "zh": "有轨电车",
    "pos": "n.",
    "ipa": "",
    "ex": "The historic tram runs along the waterfront every 15 minutes.",
    "ex2": "The old city trams were restored as part of a heritage tourism initiative to attract visitors to the historic area."
  },
  {
    "word": "ride-share",
    "zh": "顺风车 / 网约车",
    "pos": "n.",
    "ipa": "",
    "ex": "Book a ride-share using the app—it's cheaper than a regular taxi.",
    "ex2": "Ride-share services have transformed urban transport in many cities, reducing the need to own a private car."
  },
  {
    "word": "fare",
    "zh": "票价 / 车费",
    "pos": "n.",
    "ipa": "",
    "ex": "The bus fare is 2 yuan for any distance within the city.",
    "ex2": "Fares on the intercity express train were reduced during the holiday period to encourage more people to travel."
  },
  {
    "word": "route",
    "zh": "路线",
    "pos": "n.",
    "ipa": "",
    "ex": "The fastest route to the airport avoids the city centre entirely.",
    "ex2": "The cycling routes through the national park were clearly marked and well-maintained throughout the year."
  },
  {
    "word": "platform",
    "zh": "站台",
    "pos": "n.",
    "ipa": "",
    "ex": "The train to Shanghai departs from Platform 5 in ten minutes.",
    "ex2": "Passengers were asked to stand behind the yellow line on the platforms until the train had come to a complete stop."
  },
  {
    "word": "rush hour",
    "zh": "高峰时间",
    "pos": "n.",
    "ipa": "",
    "ex": "Avoid taking the subway during rush hour if you can—it's packed.",
    "ex2": "The new express service was introduced specifically to reduce congestion during the morning rush hours."
  },
  {
    "word": "traffic",
    "zh": "交通 / 车流",
    "pos": "n.",
    "ipa": "",
    "ex": "Heavy traffic on the ring road is causing delays of 40 minutes.",
    "ex2": "Traffic on the main roads into the city was significantly lighter than usual due to the public holiday."
  },
  {
    "word": "speed limit",
    "zh": "限速",
    "pos": "n.",
    "ipa": "",
    "ex": "The speed limit on this road is 60 km/h—slow down.",
    "ex2": "Speed limits in school zones were lowered to 30 km/h and strictly enforced with new cameras."
  },
  {
    "word": "driver's license",
    "zh": "驾驶执照",
    "pos": "n.",
    "ipa": "",
    "ex": "You must carry your driver's license whenever you drive.",
    "ex2": "She passed her driver's license test on the first attempt after months of intensive lessons and practice."
  },
  {
    "word": "electric vehicle",
    "zh": "电动汽车",
    "pos": "n.",
    "ipa": "",
    "ex": "Electric vehicles are becoming more affordable and popular each year.",
    "ex2": "The government offered subsidies to encourage more people to switch to electric vehicles and reduce emissions."
  },
  {
    "word": "navigation",
    "zh": "导航",
    "pos": "n.",
    "ipa": "",
    "ex": "Turn on navigation—I'm not sure of the exact address.",
    "ex2": "Modern navigation apps update routes in real time based on live traffic data and road conditions."
  },
  {
    "word": "detour",
    "zh": "绕道 / 绕行",
    "pos": "n./v.",
    "ipa": "",
    "ex": "We had to take a detour because of the road construction ahead.",
    "ex2": "The detour added thirty minutes to their journey but took them through some unexpectedly beautiful countryside."
  },
  {
    "word": "pedestrian",
    "zh": "行人",
    "pos": "n.",
    "ipa": "",
    "ex": "Always give way to pedestrians at a crosswalk.",
    "ex2": "Pedestrians in the city centre complained about cyclists riding on the pavements instead of the road."
  },
  {
    "word": "crosswalk",
    "zh": "人行横道",
    "pos": "n.",
    "ipa": "",
    "ex": "Wait for the green signal before crossing at the crosswalk.",
    "ex2": "Additional crosswalks were painted outside the school to improve safety for students walking to class."
  },
  {
    "word": "traffic light",
    "zh": "交通灯 / 红绿灯",
    "pos": "n.",
    "ipa": "",
    "ex": "Turn left at the next set of traffic lights.",
    "ex2": "The traffic lights at the main junction were out of order for two days, causing significant congestion."
  },
  {
    "word": "intersection",
    "zh": "十字路口",
    "pos": "n.",
    "ipa": "",
    "ex": "There was a minor collision at the intersection this morning.",
    "ex2": "The dangerous intersection was redesigned with a roundabout after several serious accidents occurred there."
  },
  {
    "word": "U-turn",
    "zh": "U形转弯",
    "pos": "n.",
    "ipa": "",
    "ex": "Make a U-turn at the roundabout and head back the other way.",
    "ex2": "U-turns are prohibited on this stretch of road and are monitored by cameras at both ends."
  },
  {
    "word": "lane",
    "zh": "车道",
    "pos": "n.",
    "ipa": "",
    "ex": "Stay in the left lane when approaching the junction.",
    "ex2": "The highway was widened by adding two extra lanes in each direction to ease the growing volume of traffic."
  },
  {
    "word": "highway",
    "zh": "高速公路",
    "pos": "n.",
    "ipa": "",
    "ex": "We drove on the highway to avoid all the city centre traffic.",
    "ex2": "Highway tolls along this stretch of road fund the ongoing maintenance and expansion of the expressway network."
  },
  {
    "word": "parking meter",
    "zh": "停车计时器",
    "pos": "n.",
    "ipa": "",
    "ex": "Pay the parking meter before you walk to the restaurant.",
    "ex2": "Parking meters in the shopping district accept both coins and contactless payment via the city's parking app."
  },
  {
    "word": "flat tire",
    "zh": "爆胎",
    "pos": "n.",
    "ipa": "",
    "ex": "We got a flat tire on the motorway and had to call for help.",
    "ex2": "She had two flat tires in the same month, both caused by road debris left after construction work."
  },
  {
    "word": "breakdown",
    "zh": "故障 / 抛锚",
    "pos": "n.",
    "ipa": "",
    "ex": "The car had a breakdown in the middle of the tunnel.",
    "ex2": "Roadside assistance was called after the van suffered a breakdown on the way to the delivery depot."
  },
  {
    "word": "seat belt",
    "zh": "安全带",
    "pos": "n.",
    "ipa": "",
    "ex": "Always buckle your seat belt before starting the engine.",
    "ex2": "Wearing seat belts in all seats, including the back, became legally compulsory following a sharp rise in fatalities."
  },
  {
    "word": "car rental",
    "zh": "租车",
    "pos": "n.",
    "ipa": "",
    "ex": "Car rental is available at the airport with an international licence.",
    "ex2": "Car rental prices during the peak summer season were nearly double the rates charged the rest of the year."
  },
  {
    "word": "bicycle lane",
    "zh": "自行车道",
    "pos": "n.",
    "ipa": "",
    "ex": "Cyclists must stay in the designated bicycle lane at all times.",
    "ex2": "The city added forty kilometres of protected bicycle lanes last year as part of its green transport strategy."
  },
  {
    "word": "ferry",
    "zh": "渡轮",
    "pos": "n.",
    "ipa": "",
    "ex": "Take the ferry across the harbour—it only takes 10 minutes.",
    "ex2": "The ferry service was suspended for three days due to severe weather and rough sea conditions."
  },
  {
    "word": "bus stop",
    "zh": "公共汽车站",
    "pos": "n.",
    "ipa": "",
    "ex": "The bus stop is right outside the hotel entrance on the main road.",
    "ex2": "New shelters were installed at all bus stops along the route to protect commuters from the wind and rain."
  },
  {
    "word": "transfer",
    "zh": "换乘",
    "pos": "n.",
    "ipa": "",
    "ex": "Transfer to Line 4 at the central station and ride for three stops.",
    "ex2": "Transfers between bus and metro are now free within a 90-minute window, thanks to the new integrated ticketing system."
  },
  {
    "word": "timetable",
    "zh": "时刻表",
    "pos": "n.",
    "ipa": "",
    "ex": "Check the timetable before leaving—trains run less frequently on weekends.",
    "ex2": "Updated timetables were published online following the introduction of the new high-speed rail service."
  },
  {
    "word": "bank account",
    "zh": "银行账户",
    "pos": "n.",
    "ipa": "",
    "ex": "Open a bank account as soon as you arrive in a new country.",
    "ex2": "Both bank accounts were frozen by the authorities while the financial fraud investigation was ongoing."
  },
  {
    "word": "savings account",
    "zh": "储蓄账户",
    "pos": "n.",
    "ipa": "",
    "ex": "Move 20% of your paycheck into a savings account each month.",
    "ex2": "She opened a high-interest savings account and set up an automatic monthly transfer to grow her emergency fund."
  },
  {
    "word": "withdraw",
    "zh": "取款",
    "pos": "v.",
    "ipa": "",
    "ex": "I need to withdraw some local currency before the trip.",
    "ex2": "She withdrew all her savings from the bank and invested them in a new business venture she had planned."
  },
  {
    "word": "wire transfer",
    "zh": "电汇",
    "pos": "n.",
    "ipa": "",
    "ex": "International wire transfers typically take one to three working days.",
    "ex2": "Wire transfers above a certain threshold require additional identity verification under anti-money laundering laws."
  },
  {
    "word": "balance",
    "zh": "余额",
    "pos": "n.",
    "ipa": "",
    "ex": "Check your account balance before making a large purchase.",
    "ex2": "Her balances across all three accounts were reviewed at the end of each month during budget planning."
  },
  {
    "word": "statement",
    "zh": "账单 / 对账单",
    "pos": "n.",
    "ipa": "",
    "ex": "Your monthly statement will be sent to your registered email address.",
    "ex2": "She printed twelve months of bank statements to show the mortgage adviser during her home loan application."
  },
  {
    "word": "interest rate",
    "zh": "利率",
    "pos": "n.",
    "ipa": "",
    "ex": "The current interest rate on savings accounts is very low.",
    "ex2": "Rising interest rates have made mortgages significantly more expensive for first-time buyers in recent months."
  },
  {
    "word": "loan",
    "zh": "贷款",
    "pos": "n.",
    "ipa": "",
    "ex": "He took out a personal loan to pay for his education.",
    "ex2": "Banks are tightening their requirements and making it harder for individuals to obtain large personal loans."
  },
  {
    "word": "ATM",
    "zh": "自动取款机 / Automated Teller Machine",
    "pos": "n.",
    "ipa": "",
    "ex": "There's an ATM on every corner in this part of the city.",
    "ex2": "ATMs in rural areas are frequently out of service, leaving residents with limited access to cash."
  },
  {
    "word": "PIN",
    "zh": "个人识别码 / Personal Identification Number",
    "pos": "n.",
    "ipa": "",
    "ex": "Never share your PIN with anyone, not even bank staff.",
    "ex2": "She changed all her PINs immediately after losing her wallet, to prevent any unauthorised transactions."
  },
  {
    "word": "debit card",
    "zh": "借记卡",
    "pos": "n.",
    "ipa": "",
    "ex": "I use my debit card for daily spending to avoid debt.",
    "ex2": "Debit cards linked directly to your current account help you stick to a budget more easily than credit cards."
  },
  {
    "word": "credit limit",
    "zh": "信用额度",
    "pos": "n.",
    "ipa": "",
    "ex": "You can apply to increase your credit limit after six months.",
    "ex2": "Her credit limit was automatically increased after two years of consistently on-time full payments."
  },
  {
    "word": "currency",
    "zh": "货币",
    "pos": "n.",
    "ipa": "",
    "ex": "Which currency do you need? We stock over 30 different ones.",
    "ex2": "Many currencies across the region lost significant value against the US dollar during the financial crisis."
  },
  {
    "word": "foreign exchange",
    "zh": "外汇",
    "pos": "n.",
    "ipa": "",
    "ex": "You can exchange foreign currency at the bank or the airport.",
    "ex2": "Foreign exchange rates fluctuate constantly and can make a significant difference to the cost of overseas travel."
  },
  {
    "word": "transaction fee",
    "zh": "交易手续费",
    "pos": "n.",
    "ipa": "",
    "ex": "Some ATMs charge a foreign transaction fee—check yours first.",
    "ex2": "Transaction fees for international payments were waived for all premium account holders as a loyalty benefit."
  },
  {
    "word": "invest",
    "zh": "投资",
    "pos": "v.",
    "ipa": "",
    "ex": "She decided to invest part of her savings in index funds.",
    "ex2": "He has been investing a fixed amount each month for twenty years and has built a substantial retirement portfolio."
  },
  {
    "word": "debt",
    "zh": "债务",
    "pos": "n.",
    "ipa": "",
    "ex": "Pay off high-interest debt before investing your spare cash.",
    "ex2": "Student debts have increased dramatically over the past decade, creating a significant burden for many graduates."
  },
  {
    "word": "credit score",
    "zh": "信用评分",
    "pos": "n.",
    "ipa": "",
    "ex": "A good credit score makes it easier to get a mortgage.",
    "ex2": "Her credit score dropped sharply after she missed several monthly repayments during a period of unemployment."
  },
  {
    "word": "mortgage",
    "zh": "房贷",
    "pos": "n.",
    "ipa": "",
    "ex": "They applied for a 30-year mortgage to buy their first home.",
    "ex2": "Monthly mortgage repayments are now the single largest expense for most homeowners across the country."
  },
  {
    "word": "insurance premium",
    "zh": "保险费",
    "pos": "n.",
    "ipa": "",
    "ex": "Your health insurance premium will be deducted from your paycheck.",
    "ex2": "Insurance premiums have been rising steadily every year, making comprehensive coverage increasingly unaffordable."
  },
  {
    "word": "direct debit",
    "zh": "直接扣款",
    "pos": "n.",
    "ipa": "",
    "ex": "Set up a direct debit so you never miss a rent payment.",
    "ex2": "All regular monthly expenses were set up as direct debits to simplify her household financial management."
  },
  {
    "word": "overdraft",
    "zh": "透支",
    "pos": "n.",
    "ipa": "",
    "ex": "Avoid going into overdraft—the fees are very high.",
    "ex2": "He went into overdraft twice in a row due to unexpected expenses and was charged hefty fees both times."
  },
  {
    "word": "net worth",
    "zh": "净资产",
    "pos": "n.",
    "ipa": "",
    "ex": "Calculate your net worth by subtracting liabilities from total assets.",
    "ex2": "Her net worth had grown significantly over five years as a result of careful investing and disciplined saving."
  },
  {
    "word": "paycheck",
    "zh": "薪资 / 工资",
    "pos": "n.",
    "ipa": "",
    "ex": "My paycheck is deposited directly into my bank account each month.",
    "ex2": "After paying rent and essential bills, there was very little left from her paychecks each month."
  },
  {
    "word": "cash flow",
    "zh": "现金流",
    "pos": "n.",
    "ipa": "",
    "ex": "Managing cash flow carefully is essential for small businesses.",
    "ex2": "Poor cash flow management was identified as the primary reason many small businesses struggled to survive."
  },
  {
    "word": "smartphone",
    "zh": "智能手机",
    "pos": "n.",
    "ipa": "",
    "ex": "Most people now use their smartphone as their primary camera.",
    "ex2": "Smartphones have replaced many dedicated devices, including cameras, GPS units, music players, and alarm clocks."
  },
  {
    "word": "app",
    "zh": "应用程序",
    "pos": "n.",
    "ipa": "",
    "ex": "Download the app and create an account to get started.",
    "ex2": "The new apps released by the government allowed citizens to access public services entirely from their phones."
  },
  {
    "word": "download",
    "zh": "下载",
    "pos": "v./n.",
    "ipa": "",
    "ex": "Download the software update—it fixes several security bugs.",
    "ex2": "The report was downloaded by over a million people within the first 24 hours of being published online."
  },
  {
    "word": "upload",
    "zh": "上传",
    "pos": "v./n.",
    "ipa": "",
    "ex": "Upload the document to the shared folder so everyone can access it.",
    "ex2": "She uploaded all the supporting files before the submission deadline and received a confirmation email."
  },
  {
    "word": "Wi-Fi",
    "zh": "无线网络",
    "pos": "n.",
    "ipa": "",
    "ex": "Is there free Wi-Fi here? I need to send an important email.",
    "ex2": "The hotel's Wi-Fi signal was strong throughout the building, including in the basement conference rooms."
  },
  {
    "word": "username",
    "zh": "用户名",
    "pos": "n.",
    "ipa": "",
    "ex": "Enter your username and password to log in to the platform.",
    "ex2": "New members are asked to choose a username that is at least eight characters long and contains no spaces."
  },
  {
    "word": "log in",
    "zh": "登录",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "I can't log in to my account—the password isn't working.",
    "ex2": "Users are required to log in again after fifteen minutes of inactivity for security reasons."
  },
  {
    "word": "log out",
    "zh": "退出登录",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "Always log out when using a shared or public computer.",
    "ex2": "She forgot to log out of her work account on the shared laptop and could not recover it remotely."
  },
  {
    "word": "update",
    "zh": "更新",
    "pos": "v./n.",
    "ipa": "",
    "ex": "Install the latest update to get new features and security fixes.",
    "ex2": "The system updates were pushed overnight so users would not experience any disruption during working hours."
  },
  {
    "word": "crash",
    "zh": "崩溃 / 死机",
    "pos": "v./n.",
    "ipa": "",
    "ex": "The app crashed and I lost all my unsaved work.",
    "ex2": "The website kept crashing throughout the day because of unusually high traffic following a viral social media post."
  },
  {
    "word": "browser",
    "zh": "浏览器",
    "pos": "n.",
    "ipa": "",
    "ex": "Clear your browser cache if the website isn't loading properly.",
    "ex2": "Different browsers rendered the webpage slightly differently, so the developers tested it across all major ones."
  },
  {
    "word": "notification",
    "zh": "通知",
    "pos": "n.",
    "ipa": "",
    "ex": "Turn off non-essential notifications so you can focus on work.",
    "ex2": "She was receiving over one hundred notifications a day from various apps and decided to review her settings."
  },
  {
    "word": "privacy settings",
    "zh": "隐私设置",
    "pos": "n.",
    "ipa": "",
    "ex": "Review your privacy settings on social media every few months.",
    "ex2": "After the data breach, millions of users updated their privacy settings to restrict access to their personal information."
  },
  {
    "word": "cloud storage",
    "zh": "云存储",
    "pos": "n.",
    "ipa": "",
    "ex": "Back up your photos to cloud storage so you don't lose them.",
    "ex2": "Cloud storage services allow users to access their files from any device, anywhere in the world."
  },
  {
    "word": "backup",
    "zh": "备份",
    "pos": "n./v.",
    "ipa": "",
    "ex": "Always backup your data before performing a factory reset.",
    "ex2": "Regular backups to an external drive helped him recover all his files after the laptop was stolen."
  },
  {
    "word": "cybersecurity",
    "zh": "网络安全",
    "pos": "n.",
    "ipa": "",
    "ex": "Cybersecurity threats are increasing—use strong, unique passwords.",
    "ex2": "Companies are investing heavily in cybersecurity infrastructure following a series of high-profile data breaches."
  },
  {
    "word": "two-factor authentication",
    "zh": "双重认证",
    "pos": "n.",
    "ipa": "",
    "ex": "Enable two-factor authentication on all your important accounts.",
    "ex2": "Two-factor authentication was made mandatory for all employees accessing the company's internal systems."
  },
  {
    "word": "VPN",
    "zh": "虚拟专用网络 / Virtual Private Network",
    "pos": "n.",
    "ipa": "",
    "ex": "Use a VPN when connecting to public Wi-Fi to protect your data.",
    "ex2": "Many remote workers use VPNs to securely access their company's internal network and confidential files."
  },
  {
    "word": "software",
    "zh": "软件",
    "pos": "n.",
    "ipa": "",
    "ex": "The company uses project management software to track all tasks.",
    "ex2": "Outdated software poses a serious security risk, as it may contain vulnerabilities that hackers can exploit."
  },
  {
    "word": "screenshot",
    "zh": "截图",
    "pos": "n.",
    "ipa": "",
    "ex": "Take a screenshot and send it to me so I can see the error.",
    "ex2": "She took screenshots of all the key steps in the process and compiled them into a step-by-step guide."
  },
  {
    "word": "video call",
    "zh": "视频通话",
    "pos": "n.",
    "ipa": "",
    "ex": "Let's have a quick video call instead of writing a long email.",
    "ex2": "Video calls have become an indispensable part of modern working life, especially for internationally distributed teams."
  },
  {
    "word": "social media",
    "zh": "社交媒体",
    "pos": "n.",
    "ipa": "",
    "ex": "Limit your social media time to avoid distraction during work hours.",
    "ex2": "The politician's social media accounts were hacked overnight and removed before the team regained control."
  },
  {
    "word": "streaming",
    "zh": "流媒体",
    "pos": "n.",
    "ipa": "",
    "ex": "Streaming services have largely replaced traditional cable TV.",
    "ex2": "Streaming platforms are now investing billions in producing original content to compete with established broadcasters."
  },
  {
    "word": "phishing",
    "zh": "网络钓鱼",
    "pos": "n.",
    "ipa": "",
    "ex": "Never click links in suspicious emails—they could be phishing attacks.",
    "ex2": "Employees were trained to identify phishing emails as part of the company's annual cybersecurity awareness programme."
  },
  {
    "word": "spam",
    "zh": "垃圾邮件",
    "pos": "n.",
    "ipa": "",
    "ex": "Mark the email as spam so your inbox stays clean and organised.",
    "ex2": "The new email filter successfully blocked over ninety percent of spam messages before they reached users' inboxes."
  },
  {
    "word": "QR code",
    "zh": "二维码",
    "pos": "n.",
    "ipa": "",
    "ex": "Scan the QR code to access the digital menu on your phone.",
    "ex2": "QR codes on product packaging now link directly to detailed information about ingredients, sourcing, and sustainability."
  },
  {
    "word": "charger",
    "zh": "充电器",
    "pos": "n.",
    "ipa": "",
    "ex": "Could I borrow a phone charger? My battery is almost dead.",
    "ex2": "Universal chargers compatible with multiple devices are now available in most hotel rooms and airport lounges."
  },
  {
    "word": "foggy",
    "zh": "有雾的",
    "pos": "adj.",
    "ipa": "",
    "ex": "The foggy conditions caused several flight delays this morning.",
    "ex2": "It was so foggy along the coastal road that drivers could barely see the car in front of them."
  },
  {
    "word": "humid",
    "zh": "潮湿的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Summers here are incredibly humid—the air feels heavy and sticky.",
    "ex2": "She struggled to sleep in the humid weather and ended up running the air conditioner all night."
  },
  {
    "word": "freezing",
    "zh": "极寒的 / 冰冻的",
    "pos": "adj.",
    "ipa": "",
    "ex": "It's absolutely freezing outside—wear your warmest coat.",
    "ex2": "Temperatures dropped to freezing overnight, covering the roads in ice and making driving very dangerous."
  },
  {
    "word": "storm",
    "zh": "暴风雨",
    "pos": "n.",
    "ipa": "",
    "ex": "A severe storm is forecast for the weekend—stay indoors if possible.",
    "ex2": "The storms that swept through the region caused widespread damage to homes and infrastructure overnight."
  },
  {
    "word": "thunder",
    "zh": "雷声",
    "pos": "n.",
    "ipa": "",
    "ex": "I could hear loud thunder in the distance all evening.",
    "ex2": "The thunder woke everyone in the house just before midnight and the lights flickered several times."
  },
  {
    "word": "lightning",
    "zh": "闪电",
    "pos": "n.",
    "ipa": "",
    "ex": "Stay away from tall trees during a lightning storm.",
    "ex2": "Lightning struck the old oak tree at the edge of the field, splitting its trunk completely in two."
  },
  {
    "word": "Celsius",
    "zh": "摄氏度",
    "pos": "n.",
    "ipa": "",
    "ex": "It's 38 degrees Celsius in the shade today—drink plenty of water.",
    "ex2": "Temperatures dropped sharply to just two degrees Celsius overnight, catching many residents completely unprepared."
  },
  {
    "word": "umbrella",
    "zh": "雨伞",
    "pos": "n.",
    "ipa": "",
    "ex": "Take an umbrella—the sky looks like it's about to pour.",
    "ex2": "She lost two umbrellas in a single week by leaving them on public transport after boarding in the rush."
  },
  {
    "word": "raincoat",
    "zh": "雨衣",
    "pos": "n.",
    "ipa": "",
    "ex": "I wore a raincoat but still got completely soaked.",
    "ex2": "He packed a lightweight raincoat in his day bag just in case the weather turned while he was out hiking."
  },
  {
    "word": "sunscreen",
    "zh": "防晒霜",
    "pos": "n.",
    "ipa": "",
    "ex": "Apply sunscreen before going to the beach to avoid sunburn.",
    "ex2": "Dermatologists recommend applying sunscreen of at least SPF 30 daily, even on overcast days."
  },
  {
    "word": "heatwave",
    "zh": "热浪",
    "pos": "n.",
    "ipa": "",
    "ex": "A heatwave hit the region, breaking 60-year temperature records.",
    "ex2": "The prolonged heatwaves experienced this summer have been directly linked to climate change by scientists."
  },
  {
    "word": "flood",
    "zh": "洪水",
    "pos": "n.",
    "ipa": "",
    "ex": "Heavy rainfall caused flooding in the low-lying parts of the city.",
    "ex2": "Floods destroyed thousands of homes and displaced hundreds of thousands of residents in the affected provinces."
  },
  {
    "word": "drought",
    "zh": "干旱",
    "pos": "n.",
    "ipa": "",
    "ex": "The prolonged drought damaged crops across the entire region.",
    "ex2": "Droughts in the area have become more frequent and severe over the past decade, threatening local water supplies."
  },
  {
    "word": "season",
    "zh": "季节",
    "pos": "n.",
    "ipa": "",
    "ex": "What season is the best time to visit your country?",
    "ex2": "All four seasons are clearly defined here, each bringing distinctive weather, plants, and outdoor activities."
  },
  {
    "word": "confused",
    "zh": "困惑的",
    "pos": "adj.",
    "ipa": "",
    "ex": "I'm a bit confused—could you explain that point again?",
    "ex2": "She looked confused when she received the email and called her manager immediately to ask for clarification."
  },
  {
    "word": "surprised",
    "zh": "惊讶的",
    "pos": "adj.",
    "ipa": "",
    "ex": "I was completely surprised by the unexpected promotion.",
    "ex2": "Everyone was surprised to learn that the company had been acquired without any prior announcement."
  },
  {
    "word": "disappointed",
    "zh": "失望的",
    "pos": "adj.",
    "ipa": "",
    "ex": "We were disappointed when the concert was cancelled last minute.",
    "ex2": "He was deeply disappointed when his application was rejected after making it all the way to the final interview."
  },
  {
    "word": "satisfied",
    "zh": "满意的",
    "pos": "adj.",
    "ipa": "",
    "ex": "I'm very satisfied with the quality of the service I received.",
    "ex2": "Customers were generally satisfied with the new product, though some noted the packaging could be improved."
  },
  {
    "word": "frustrated",
    "zh": "沮丧的 / 挫败的",
    "pos": "adj.",
    "ipa": "",
    "ex": "I get so frustrated when the internet connection keeps dropping.",
    "ex2": "She was increasingly frustrated by the lack of response from the team, despite sending three reminder emails."
  },
  {
    "word": "grateful",
    "zh": "感激的",
    "pos": "adj.",
    "ipa": "",
    "ex": "I'm truly grateful for all the support you've given me this year.",
    "ex2": "He was deeply grateful to his mentor, who had guided him through every challenge of the first two years."
  },
  {
    "word": "proud",
    "zh": "骄傲的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Her parents were incredibly proud when she graduated top of her class.",
    "ex2": "She felt proud of what her team had achieved together, knowing how hard everyone had worked."
  },
  {
    "word": "embarrassed",
    "zh": "尴尬的",
    "pos": "adj.",
    "ipa": "",
    "ex": "I was so embarrassed when I forgot his name during introductions.",
    "ex2": "He was embarrassed to admit that he had misunderstood the instructions and completed the wrong task entirely."
  },
  {
    "word": "stressed",
    "zh": "压力大的",
    "pos": "adj.",
    "ipa": "",
    "ex": "She's very stressed about the upcoming deadlines and presentations.",
    "ex2": "He had been feeling increasingly stressed as the project deadline drew closer."
  },
  {
    "word": "relaxed",
    "zh": "放松的",
    "pos": "adj.",
    "ipa": "",
    "ex": "I feel completely relaxed after a week of holiday by the sea.",
    "ex2": "She looked more relaxed than usual after taking a proper lunch break."
  },
  {
    "word": "confident",
    "zh": "自信的",
    "pos": "adj.",
    "ipa": "",
    "ex": "He walked into the interview looking calm and confident.",
    "ex2": "After months of practice, she felt confident enough to present in front of the board."
  },
  {
    "word": "overwhelmed",
    "zh": "不知所措的",
    "pos": "adj.",
    "ipa": "",
    "ex": "I feel completely overwhelmed with everything on my plate right now.",
    "ex2": "New employees often feel overwhelmed during their first week in a fast-paced environment."
  },
  {
    "word": "motivated",
    "zh": "有动力的",
    "pos": "adj.",
    "ipa": "",
    "ex": "The inspiring speech left the whole team feeling motivated.",
    "ex2": "She stayed highly motivated throughout the training despite the long hours."
  },
  {
    "word": "optimistic",
    "zh": "乐观的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Despite the challenges, she remains optimistic about the future.",
    "ex2": "He was more optimistic about the outcome after seeing the positive early results."
  },
  {
    "word": "anxious",
    "zh": "焦虑的",
    "pos": "adj.",
    "ipa": "",
    "ex": "I always feel anxious when I have to speak in front of a large crowd.",
    "ex2": "She grew increasingly anxious as the flight kept getting delayed without explanation."
  },
  {
    "word": "relieved",
    "zh": "如释重负的",
    "pos": "adj.",
    "ipa": "",
    "ex": "I was so relieved when I heard the test results came back negative.",
    "ex2": "Everyone felt relieved once the difficult negotiation had finally reached an agreement."
  },
  {
    "word": "homesick",
    "zh": "思乡的",
    "pos": "adj.",
    "ipa": "",
    "ex": "I started feeling homesick after my first month living abroad.",
    "ex2": "She grew homesick during the holidays and called her family every single day."
  },
  {
    "word": "lonely",
    "zh": "孤独的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Moving to a new city can be lonely before you make new friends.",
    "ex2": "He felt lonelier than he had expected during his first year studying overseas."
  },
  {
    "word": "cheerful",
    "zh": "开朗的",
    "pos": "adj.",
    "ipa": "",
    "ex": "She's always cheerful and positive, even on difficult days.",
    "ex2": "The cheerful atmosphere in the office made it a pleasure to come to work."
  },
  {
    "word": "calm",
    "zh": "冷静的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Stay calm and think clearly—panic won't help the situation.",
    "ex2": "She remained calmer than anyone expected when the fire alarm went off mid-presentation."
  },
  {
    "word": "curious",
    "zh": "好奇的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Children are naturally curious about the world around them.",
    "ex2": "I was curious to find out more after reading the first few pages of the report."
  },
  {
    "word": "jealous",
    "zh": "嫉妒的",
    "pos": "adj.",
    "ipa": "",
    "ex": "He felt a little jealous of his colleague's quick promotion.",
    "ex2": "She admitted feeling jealous when her best friend got the role she had auditioned for."
  },
  {
    "word": "I need...",
    "zh": "我需要…",
    "pos": "phr.",
    "ipa": "",
    "ex": "I need a taxi to the airport as soon as possible.",
    "ex2": "I need all the signed contracts returned to us by the end of this week."
  },
  {
    "word": "Can I have...?",
    "zh": "我可以要…吗？",
    "pos": "phr.",
    "ipa": "",
    "ex": "Can I have a glass of water and the menu, please?",
    "ex2": "Can I have a few more days to review the proposal before giving feedback?"
  },
  {
    "word": "Could you...?",
    "zh": "您能…吗？",
    "pos": "phr.",
    "ipa": "",
    "ex": "Could you help me carry this luggage to my room?",
    "ex2": "Could you send me a summary of the key points discussed in today's meeting?"
  },
  {
    "word": "Would you mind...?",
    "zh": "你介意…吗？",
    "pos": "phr.",
    "ipa": "",
    "ex": "Would you mind turning down the music a little?",
    "ex2": "Would you mind checking over my report before I submit it to the manager?"
  },
  {
    "word": "Is it possible to...?",
    "zh": "…可能吗？",
    "pos": "phr.",
    "ipa": "",
    "ex": "Is it possible to get a refund if I cancel the booking?",
    "ex2": "Is it possible to reschedule the meeting to a time that suits everyone?"
  },
  {
    "word": "How much is...?",
    "zh": "…多少钱？",
    "pos": "phr.",
    "ipa": "",
    "ex": "How much is a single room for one night?",
    "ex2": "How much is the delivery charge if I order more than five items at once?"
  },
  {
    "word": "Where is...?",
    "zh": "…在哪里？",
    "pos": "phr.",
    "ipa": "",
    "ex": "Excuse me, where is the nearest pharmacy?",
    "ex2": "Could you tell me where the registration desk is for the conference?"
  },
  {
    "word": "What time is...?",
    "zh": "…几点？",
    "pos": "phr.",
    "ipa": "",
    "ex": "What time is the last train to the airport?",
    "ex2": "What time is the closing ceremony scheduled to begin on the final day?"
  },
  {
    "word": "How long does it take?",
    "zh": "要多长时间？",
    "pos": "phr.",
    "ipa": "",
    "ex": "How long does it take to walk to the city centre from here?",
    "ex2": "How long does it take to process a visa application through the embassy?"
  },
  {
    "word": "Can you help me?",
    "zh": "你能帮我吗？",
    "pos": "phr.",
    "ipa": "",
    "ex": "Can you help me fill out this form in English?",
    "ex2": "Can you help me set up the presentation equipment before the guests arrive?"
  },
  {
    "word": "I'm looking for...",
    "zh": "我在找…",
    "pos": "phr.",
    "ipa": "",
    "ex": "I'm looking for a pharmacy near the hotel.",
    "ex2": "I'm looking for a lightweight laptop suitable for long-distance travel."
  },
  {
    "word": "Do you have...?",
    "zh": "你有…吗？",
    "pos": "phr.",
    "ipa": "",
    "ex": "Do you have any rooms available for tonight?",
    "ex2": "Do you have any earlier appointment slots available this week?"
  },
  {
    "word": "I'd like to...",
    "zh": "我想…",
    "pos": "phr.",
    "ipa": "",
    "ex": "I'd like to make a reservation for dinner this evening.",
    "ex2": "I'd like to formally raise a concern about the timeline before the project begins."
  },
  {
    "word": "Just a moment",
    "zh": "请稍等",
    "pos": "phr.",
    "ipa": "",
    "ex": "Just a moment—let me check my diary for an available slot.",
    "ex2": "Just a moment—I need to pull up the correct file before we continue."
  },
  {
    "word": "Hold on",
    "zh": "等一下",
    "pos": "phr.",
    "ipa": "",
    "ex": "Hold on—I'll transfer you to the right department now.",
    "ex2": "Hold on—let me double-check the figures before giving you a final answer."
  },
  {
    "word": "After you",
    "zh": "您先请",
    "pos": "phr.",
    "ipa": "",
    "ex": "After you—please go ahead and enter first.",
    "ex2": "He held the door open and gestured, saying, 'After you—please come through.'"
  },
  {
    "word": "Go ahead",
    "zh": "请便 / 继续",
    "pos": "phr.",
    "ipa": "",
    "ex": "Go ahead with the plan—we all agree it's the best approach.",
    "ex2": "Please go ahead and start without us—we'll join the call in five minutes."
  },
  {
    "word": "No worries",
    "zh": "不用担心",
    "pos": "phr.",
    "ipa": "",
    "ex": "No worries! Take your time—there's no rush at all.",
    "ex2": "She smiled and said, 'No worries—mistakes happen, and we'll fix it together.'"
  },
  {
    "word": "on time",
    "zh": "准时",
    "pos": "phr.",
    "ipa": "",
    "ex": "The train arrived exactly on time—very impressive.",
    "ex2": "All deliveries were completed on time despite the bad weather and road closures."
  },
  {
    "word": "running late",
    "zh": "要迟到了",
    "pos": "phr.",
    "ipa": "",
    "ex": "I'm running late—please start the meeting without me.",
    "ex2": "She texted to say she was running late due to unexpected traffic on the motorway."
  },
  {
    "word": "as soon as possible",
    "zh": "尽快",
    "pos": "phr.",
    "ipa": "",
    "ex": "Please send me the revised document as soon as possible.",
    "ex2": "We need to respond to the client's complaint as soon as possible to avoid escalation."
  },
  {
    "word": "in advance",
    "zh": "提前",
    "pos": "phr.",
    "ipa": "",
    "ex": "Book your tickets in advance to get the best available price.",
    "ex2": "She had prepared all the materials well in advance to ensure a smooth presentation."
  },
  {
    "word": "at the moment",
    "zh": "目前 / 此刻",
    "pos": "phr.",
    "ipa": "",
    "ex": "I'm busy at the moment—can I call you back in ten minutes?",
    "ex2": "At the moment, the team is focused on fixing the bugs before the release date."
  },
  {
    "word": "in the meantime",
    "zh": "在此期间",
    "pos": "phr.",
    "ipa": "",
    "ex": "In the meantime, please review the draft and leave comments.",
    "ex2": "The repairs will take three days; in the meantime, please use the temporary workstation."
  },
  {
    "word": "first of all",
    "zh": "首先",
    "pos": "phr.",
    "ipa": "",
    "ex": "First of all, let me thank everyone for coming today.",
    "ex2": "First of all, we need to agree on the budget before discussing the timeline."
  },
  {
    "word": "at least",
    "zh": "至少",
    "pos": "phr.",
    "ipa": "",
    "ex": "You should drink at least eight glasses of water per day.",
    "ex2": "At least three members of the team raised concerns about the proposed changes."
  },
  {
    "word": "approximately",
    "zh": "大约",
    "pos": "adv.",
    "ipa": "",
    "ex": "The journey takes approximately two hours by train.",
    "ex2": "The new system has reduced processing time by approximately forty percent."
  },
  {
    "word": "according to",
    "zh": "根据",
    "pos": "prep.",
    "ipa": "",
    "ex": "According to the weather forecast, it will snow tomorrow.",
    "ex2": "According to the latest report, customer satisfaction has improved significantly."
  },
  {
    "word": "despite",
    "zh": "尽管",
    "pos": "prep.",
    "ipa": "",
    "ex": "Despite the heavy rain, the match continued as planned.",
    "ex2": "She maintained a positive attitude despite facing numerous setbacks throughout the year."
  },
  {
    "word": "although",
    "zh": "虽然",
    "pos": "conj.",
    "ipa": "",
    "ex": "Although it was expensive, the holiday was absolutely worth it.",
    "ex2": "Although the project ran over budget, the final results exceeded all expectations."
  },
  {
    "word": "unless",
    "zh": "除非",
    "pos": "conj.",
    "ipa": "",
    "ex": "Don't sign the contract unless you've read every clause.",
    "ex2": "The meeting will go ahead as planned unless we receive confirmation otherwise."
  },
  {
    "word": "in case",
    "zh": "以防",
    "pos": "phr.",
    "ipa": "",
    "ex": "Bring an umbrella in case it rains later this afternoon.",
    "ex2": "Keep a copy of your passport with you in case the original is lost or stolen."
  },
  {
    "word": "as long as",
    "zh": "只要",
    "pos": "phr.",
    "ipa": "",
    "ex": "As long as you finish by Friday, the method doesn't matter.",
    "ex2": "You are welcome to work remotely as long as you are available during core hours."
  },
  {
    "word": "in order to",
    "zh": "为了",
    "pos": "phr.",
    "ipa": "",
    "ex": "In order to improve your English, you need daily practice.",
    "ex2": "We restructured the department in order to improve communication between teams."
  },
  {
    "word": "due to",
    "zh": "由于",
    "pos": "prep.",
    "ipa": "",
    "ex": "The event was cancelled due to unforeseen circumstances.",
    "ex2": "The project was delayed due to a critical shortage of raw materials last quarter."
  },
  {
    "word": "regardless of",
    "zh": "不管",
    "pos": "prep.",
    "ipa": "",
    "ex": "We will proceed regardless of the outcome of the vote.",
    "ex2": "All employees are treated equally regardless of their rank or years of experience."
  },
  {
    "word": "in my opinion",
    "zh": "在我看来",
    "pos": "phr.",
    "ipa": "",
    "ex": "In my opinion, we should invest more in customer service.",
    "ex2": "In my opinion, the second design option is stronger and more consistent with our brand."
  },
  {
    "word": "as far as I know",
    "zh": "据我所知",
    "pos": "phr.",
    "ipa": "",
    "ex": "As far as I know, no one has reported the same issue before.",
    "ex2": "As far as I know, the updated policy has not yet been officially announced to the team."
  },
  {
    "word": "to be honest",
    "zh": "说实话",
    "pos": "phr.",
    "ipa": "",
    "ex": "To be honest, I'm not entirely convinced by this proposal.",
    "ex2": "To be honest, I wasn't expecting such positive feedback from such a tough audience."
  },
  {
    "word": "keep in mind",
    "zh": "请记住",
    "pos": "phr.",
    "ipa": "",
    "ex": "Keep in mind that the deadline is non-negotiable this time.",
    "ex2": "Keep in mind that customers often respond better to personalised messages than generic ones."
  },
  {
    "word": "at the end of the day",
    "zh": "归根到底",
    "pos": "phr.",
    "ipa": "",
    "ex": "At the end of the day, what matters most is the result.",
    "ex2": "At the end of the day, strong teamwork will always outperform individual brilliance."
  },
  {
    "word": "long story short",
    "zh": "长话短说",
    "pos": "phr.",
    "ipa": "",
    "ex": "Long story short, we lost the contract because of a typo.",
    "ex2": "Long story short, after months of negotiations, we finally reached an agreement."
  },
  {
    "word": "give it a shot",
    "zh": "试试看",
    "pos": "phr.",
    "ipa": "",
    "ex": "I've never cooked Thai food before, but I'll give it a shot.",
    "ex2": "She'd never done public speaking, but she gave it a shot and impressed everyone."
  },
  {
    "word": "hang in there",
    "zh": "坚持住",
    "pos": "phr.",
    "ipa": "",
    "ex": "Hang in there—things will get easier once you settle in.",
    "ex2": "He kept hanging in there through the tough months, and his persistence paid off."
  },
  {
    "word": "take it easy",
    "zh": "放轻松",
    "pos": "phr.",
    "ipa": "",
    "ex": "Take it easy this weekend—you've been working too hard lately.",
    "ex2": "The doctor advised her to take it easy for at least two weeks after the surgery."
  },
  {
    "word": "so far so good",
    "zh": "到目前为止还不错",
    "pos": "phr.",
    "ipa": "",
    "ex": "So far so good—we're on track and within budget.",
    "ex2": "The new system has been running for a week and so far so good—no major issues."
  },
  {
    "word": "it depends",
    "zh": "看情况",
    "pos": "phr.",
    "ipa": "",
    "ex": "Should I bring a jacket? It depends on the weather tomorrow.",
    "ex2": "Whether the project succeeds really depends on how well the teams communicate."
  },
  {
    "word": "that being said",
    "zh": "话虽如此",
    "pos": "phr.",
    "ipa": "",
    "ex": "That being said, we should still be careful about the risks.",
    "ex2": "The results look promising; that being said, we need more data before drawing conclusions."
  },
  {
    "word": "more or less",
    "zh": "或多或少 / 大致",
    "pos": "phr.",
    "ipa": "",
    "ex": "The project is more or less finished—just a few tweaks left.",
    "ex2": "The two proposals are more or less identical in terms of cost and timeline."
  },
  {
    "word": "off the top of my head",
    "zh": "不假思索地",
    "pos": "phr.",
    "ipa": "",
    "ex": "Off the top of my head, I'd say the cost is around $500.",
    "ex2": "Off the top of my head, I can think of at least three alternative solutions."
  },
  {
    "word": "between you and me",
    "zh": "这是咱们之间的话",
    "pos": "phr.",
    "ipa": "",
    "ex": "Between you and me, I think the manager made the wrong call.",
    "ex2": "Between you and me, I'm not sure the new strategy is going to deliver the results they're expecting."
  },
  {
    "word": "fingers crossed",
    "zh": "祈祷好运",
    "pos": "phr.",
    "ipa": "",
    "ex": "My exam results come out tomorrow—fingers crossed!",
    "ex2": "We've submitted the proposal and are keeping our fingers crossed for good news."
  },
  {
    "word": "better safe than sorry",
    "zh": "小心驶得万年船",
    "pos": "phr.",
    "ipa": "",
    "ex": "Back up your files—better safe than sorry.",
    "ex2": "We decided to run extra tests, since better safe than sorry applies in medical research."
  },
  {
    "word": "once in a while",
    "zh": "偶尔",
    "pos": "phr.",
    "ipa": "",
    "ex": "I treat myself to a nice dinner out once in a while.",
    "ex2": "Even experienced professionals make mistakes once in a while—it's part of learning."
  },
  {
    "word": "right away",
    "zh": "马上",
    "pos": "phr.",
    "ipa": "",
    "ex": "I'll get back to you with the figures right away.",
    "ex2": "The IT team resolved the server issue right away before it affected more users."
  },
  {
    "word": "catch up",
    "zh": "叙旧 / 赶上",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "Let's grab a coffee and catch up—it's been ages!",
    "ex2": "She worked through the weekend to catch up on the work she had missed while sick."
  },
  {
    "word": "show up",
    "zh": "出现 / 露面",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "He promised to show up by nine but still hasn't arrived.",
    "ex2": "Only half the registered participants showed up on the day of the workshop."
  },
  {
    "word": "figure out",
    "zh": "弄明白 / 解决",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "I'll figure out the best route before we leave tomorrow.",
    "ex2": "The engineers spent two days figuring out the root cause of the system failure."
  },
  {
    "word": "look forward to",
    "zh": "期待",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "I really look forward to seeing you at the conference next week.",
    "ex2": "We are looking forward to welcoming the new members to our growing team."
  },
  {
    "word": "deal with",
    "zh": "处理 / 应对",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "I need to deal with this complaint before it escalates further.",
    "ex2": "She has been dealing with a very difficult client all week without losing her composure."
  },
  {
    "word": "count on",
    "zh": "依靠 / 信赖",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "You can always count on her to deliver excellent work on time.",
    "ex2": "When things go wrong, he's the one person you can always count on to stay calm."
  },
  {
    "word": "come up with",
    "zh": "想出 / 提出",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "Let's come up with a solution before the client meeting tomorrow.",
    "ex2": "She came up with an innovative idea that saved the campaign at the last minute."
  },
  {
    "word": "go over",
    "zh": "仔细检查 / 过一遍",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "Let's go over the agenda one more time before the meeting starts.",
    "ex2": "The editor went over every page carefully before the book was sent to print."
  },
  {
    "word": "bring up",
    "zh": "提起 / 提出",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "I need to bring up the budget issue at the next team meeting.",
    "ex2": "She finally brought up the problem that had been bothering the team for weeks."
  },
  {
    "word": "turn down",
    "zh": "拒绝 / 调低",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "She turned down the job offer because the salary was too low.",
    "ex2": "He turned down three opportunities before finally accepting an offer that matched his expectations."
  },
  {
    "word": "run out of",
    "zh": "用完 / 耗尽",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "We've run out of milk—could you pick some up on the way home?",
    "ex2": "The printer ran out of ink just before the important client documents needed to be printed."
  },
  {
    "word": "put off",
    "zh": "推迟",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "Don't put off dealing with difficult emails—reply the same day.",
    "ex2": "They kept putting off the difficult conversation until it could no longer be avoided."
  },
  {
    "word": "set up",
    "zh": "建立 / 安排",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "Let me set up a meeting for the three of us next Monday morning.",
    "ex2": "The IT team set up the new workstations over the weekend so staff could begin immediately."
  },
  {
    "word": "get back to",
    "zh": "回复 / 回头联系",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "I'll get back to you with a decision by the end of business today.",
    "ex2": "She promised to get back to all pending enquiries before the close of business Friday."
  },
  {
    "word": "o'clock",
    "zh": "…点整",
    "pos": "n.",
    "ipa": "",
    "ex": "The meeting starts at nine o'clock sharp—don't be late.",
    "ex2": "She set three alarms at six o'clock to make sure she would not oversleep."
  },
  {
    "word": "half past",
    "zh": "…点半",
    "pos": "phr.",
    "ipa": "",
    "ex": "It's half past two—let's take a short break.",
    "ex2": "The flight departs at half past eight, so we should leave the hotel by six at the latest."
  },
  {
    "word": "quarter to",
    "zh": "差一刻…",
    "pos": "phr.",
    "ipa": "",
    "ex": "It's quarter to eight—we need to leave now or we'll miss the bus.",
    "ex2": "The show begins at quarter to seven—please be seated before the curtain rises."
  },
  {
    "word": "day after tomorrow",
    "zh": "后天",
    "pos": "phr.",
    "ipa": "",
    "ex": "The parcel is expected to arrive the day after tomorrow.",
    "ex2": "Can we schedule the final review for the day after tomorrow before the end of the week?"
  },
  {
    "word": "punctual",
    "zh": "准时的",
    "pos": "adj.",
    "ipa": "",
    "ex": "He is always punctual—never a minute late for any meeting.",
    "ex2": "Being punctual for client appointments shows respect and builds professional trust."
  },
  {
    "word": "annual",
    "zh": "年度的 / 每年的",
    "pos": "adj.",
    "ipa": "",
    "ex": "The annual team retreat is held every September in the mountains.",
    "ex2": "The company's annual revenue grew by fifteen percent compared to the previous year."
  },
  {
    "word": "monthly",
    "zh": "每月的",
    "pos": "adj.",
    "ipa": "",
    "ex": "A monthly newsletter is sent to all registered members.",
    "ex2": "Monthly performance reviews help employees track their progress and set goals."
  },
  {
    "word": "weekly",
    "zh": "每周的",
    "pos": "adj.",
    "ipa": "",
    "ex": "We have a weekly check-in call every Monday at 9 a.m.",
    "ex2": "The team holds weekly standups to ensure everyone is aligned on priorities."
  },
  {
    "word": "daily",
    "zh": "每天的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Reading for 30 minutes daily can significantly improve your vocabulary.",
    "ex2": "She followed a daily routine of exercise, reading, and planning to stay productive."
  },
  {
    "word": "duration",
    "zh": "时长 / 持续时间",
    "pos": "n.",
    "ipa": "",
    "ex": "The course has a total duration of six weeks.",
    "ex2": "Flights of a long duration often include at least one scheduled meal service."
  },
  {
    "word": "expire",
    "zh": "到期 / 过期",
    "pos": "v.",
    "ipa": "",
    "ex": "Your membership will expire at the end of this month.",
    "ex2": "The visa expired before she could complete her travel plans, causing significant delays."
  },
  {
    "word": "immediately",
    "zh": "立刻",
    "pos": "adv.",
    "ipa": "",
    "ex": "Please respond immediately—this is an urgent matter.",
    "ex2": "She left the building immediately after the fire alarm sounded without waiting."
  },
  {
    "word": "recently",
    "zh": "最近",
    "pos": "adv.",
    "ipa": "",
    "ex": "I recently started learning Spanish online in my spare time.",
    "ex2": "The company has recently launched several new initiatives to support employee wellbeing."
  },
  {
    "word": "frequently",
    "zh": "经常",
    "pos": "adv.",
    "ipa": "",
    "ex": "She travels frequently for work—at least twice a month.",
    "ex2": "He frequently checks in with his team to ensure no one is struggling silently."
  },
  {
    "word": "occasionally",
    "zh": "偶尔",
    "pos": "adv.",
    "ipa": "",
    "ex": "I occasionally work from a café to change my environment.",
    "ex2": "She occasionally stayed late to catch up, but never made it a regular habit."
  },
  {
    "word": "meanwhile",
    "zh": "与此同时",
    "pos": "adv.",
    "ipa": "",
    "ex": "Meanwhile, the second team continued working on the report.",
    "ex2": "The director was attending the conference; meanwhile, her deputy managed the office."
  },
  {
    "word": "eventually",
    "zh": "最终",
    "pos": "adv.",
    "ipa": "",
    "ex": "He struggled at first but eventually passed the exam.",
    "ex2": "After years of hard work and setbacks, she eventually achieved her dream of running her own company."
  },
  {
    "word": "prior to",
    "zh": "在…之前",
    "pos": "prep.",
    "ipa": "",
    "ex": "Please review the materials prior to attending the training.",
    "ex2": "Prior to joining the company, she had spent five years working in management consulting."
  },
  {
    "word": "university",
    "zh": "大学",
    "pos": "n.",
    "ipa": "",
    "ex": "She graduated from university with a degree in economics.",
    "ex2": "Many universities now offer online programmes that allow students to study from anywhere."
  },
  {
    "word": "degree",
    "zh": "学位",
    "pos": "n.",
    "ipa": "",
    "ex": "A bachelor's degree is the minimum requirement for this position.",
    "ex2": "She earned her master's degree while working full-time, which required exceptional dedication."
  },
  {
    "word": "major",
    "zh": "主修专业",
    "pos": "n.",
    "ipa": "",
    "ex": "Her major is computer science with a minor in mathematics.",
    "ex2": "Students who majored in engineering were offered the most competitive starting salaries."
  },
  {
    "word": "professor",
    "zh": "教授",
    "pos": "n.",
    "ipa": "",
    "ex": "The professor gave a fascinating lecture on global economics.",
    "ex2": "Several professors co-authored the paper, which was published in a leading academic journal."
  },
  {
    "word": "lecture",
    "zh": "讲座 / 课",
    "pos": "n.",
    "ipa": "",
    "ex": "The morning lecture runs from 8 to 10 a.m. in Hall B.",
    "ex2": "She attended every lecture without fail and always sat in the front row to focus better."
  },
  {
    "word": "assignment",
    "zh": "作业 / 任务",
    "pos": "n.",
    "ipa": "",
    "ex": "Submit your assignment through the online portal by Friday.",
    "ex2": "The assignments were designed to challenge students to apply theory to real-world problems."
  },
  {
    "word": "exam",
    "zh": "考试",
    "pos": "n.",
    "ipa": "",
    "ex": "I have a final exam next Monday—I need to start studying now.",
    "ex2": "Students who scored top marks in the entrance exams were offered full scholarships."
  },
  {
    "word": "grade",
    "zh": "成绩 / 年级",
    "pos": "n.",
    "ipa": "",
    "ex": "She got excellent grades throughout all four years of college.",
    "ex2": "The grading system was adjusted to reflect both coursework performance and exam results."
  },
  {
    "word": "scholarship",
    "zh": "奖学金",
    "pos": "n.",
    "ipa": "",
    "ex": "He won a full scholarship to study abroad at a top university.",
    "ex2": "Several scholarships are available for students from low-income families who demonstrate academic excellence."
  },
  {
    "word": "tuition",
    "zh": "学费",
    "pos": "n.",
    "ipa": "",
    "ex": "University tuition fees have increased significantly this year.",
    "ex2": "Many students take out loans to cover their tuition fees and living expenses during their studies."
  },
  {
    "word": "campus",
    "zh": "校园",
    "pos": "n.",
    "ipa": "",
    "ex": "The campus is large and has its own gym, library, and cafeteria.",
    "ex2": "The university has campuses in three different cities, making it accessible to more students."
  },
  {
    "word": "library",
    "zh": "图书馆",
    "pos": "n.",
    "ipa": "",
    "ex": "I reserved a study room at the library for the afternoon.",
    "ex2": "The libraries on campus are open until midnight during the examination period."
  },
  {
    "word": "semester",
    "zh": "学期",
    "pos": "n.",
    "ipa": "",
    "ex": "The new semester begins in early September after the summer break.",
    "ex2": "She used her final semester to focus on her dissertation and part-time work experience."
  },
  {
    "word": "graduate",
    "zh": "毕业 / 毕业生",
    "pos": "v./n.",
    "ipa": "",
    "ex": "She graduated with first-class honours from a top-ranked university.",
    "ex2": "Recent graduates often face tough competition when applying for entry-level positions."
  },
  {
    "word": "enrol",
    "zh": "注册 / 报名",
    "pos": "v.",
    "ipa": "",
    "ex": "Enrol in the online course before the registration deadline.",
    "ex2": "Over two thousand students enrolled in the new data science programme in its first year."
  },
  {
    "word": "certificate",
    "zh": "证书",
    "pos": "n.",
    "ipa": "",
    "ex": "You'll receive a certificate upon completing the full programme.",
    "ex2": "She collected several professional certificates to strengthen her CV before applying for promotion."
  },
  {
    "word": "curriculum",
    "zh": "课程体系",
    "pos": "n.",
    "ipa": "",
    "ex": "The curriculum covers both theory and practical application.",
    "ex2": "The school redesigned its curriculum to place greater emphasis on critical thinking and creativity."
  },
  {
    "word": "textbook",
    "zh": "教材 / 课本",
    "pos": "n.",
    "ipa": "",
    "ex": "The required textbook is available in both print and digital formats.",
    "ex2": "Many students now prefer digital textbooks because they are cheaper and easier to carry."
  },
  {
    "word": "note-taking",
    "zh": "记笔记",
    "pos": "n.",
    "ipa": "",
    "ex": "Effective note-taking helps you retain information much longer.",
    "ex2": "She developed her own note-taking system using colour-coded summaries and mind maps."
  },
  {
    "word": "ingredient",
    "zh": "食材 / 原料",
    "pos": "n.",
    "ipa": "",
    "ex": "Gather all the ingredients before you start cooking.",
    "ex2": "The recipe calls for fresh ingredients, so try to avoid anything that has been frozen."
  },
  {
    "word": "recipe",
    "zh": "食谱",
    "pos": "n.",
    "ipa": "",
    "ex": "I found a simple recipe for homemade pasta online.",
    "ex2": "She collected hundreds of traditional recipes passed down from her grandmother over the years."
  },
  {
    "word": "chop",
    "zh": "切碎",
    "pos": "v.",
    "ipa": "",
    "ex": "Chop the onions finely and fry them until golden.",
    "ex2": "She chopped all the vegetables in advance so dinner could be prepared in under twenty minutes."
  },
  {
    "word": "fry",
    "zh": "炒 / 炸",
    "pos": "v.",
    "ipa": "",
    "ex": "Fry the garlic in olive oil over medium heat.",
    "ex2": "He fried the tofu until it was golden and crispy before adding the vegetables."
  },
  {
    "word": "boil",
    "zh": "煮沸",
    "pos": "v.",
    "ipa": "",
    "ex": "Boil the pasta for ten minutes and then drain it.",
    "ex2": "She boiled the eggs for exactly seven minutes to get a perfectly runny yolk."
  },
  {
    "word": "marinate",
    "zh": "腌制",
    "pos": "v.",
    "ipa": "",
    "ex": "Marinate the chicken overnight for the best flavour.",
    "ex2": "The beef had been marinating for twelve hours in a blend of spices, soy sauce, and garlic."
  },
  {
    "word": "seasoning",
    "zh": "调味料",
    "pos": "n.",
    "ipa": "",
    "ex": "Add seasoning to taste—salt, pepper, and a pinch of paprika.",
    "ex2": "The chef blended her own seasonings using dried herbs grown in the restaurant's garden."
  },
  {
    "word": "frozen food",
    "zh": "冷冻食品",
    "pos": "n.",
    "ipa": "",
    "ex": "Stock up on frozen food so you always have a quick meal option.",
    "ex2": "The demand for healthier frozen foods has grown significantly over the past few years."
  },
  {
    "word": "cuisine",
    "zh": "菜系 / 烹饪风格",
    "pos": "n.",
    "ipa": "",
    "ex": "Italian cuisine is loved worldwide for its simplicity and flavour.",
    "ex2": "She has always been passionate about exploring different cuisines whenever she travels abroad."
  },
  {
    "word": "spice",
    "zh": "香料 / 调料",
    "pos": "n.",
    "ipa": "",
    "ex": "Indian cooking uses a wide variety of aromatic spices.",
    "ex2": "The market was full of brightly coloured spices that filled the air with an incredible aroma."
  },
  {
    "word": "herb",
    "zh": "香草 / 药草",
    "pos": "n.",
    "ipa": "",
    "ex": "Fresh herbs like basil and rosemary enhance any dish.",
    "ex2": "She planted a small herb garden on her balcony to have fresh flavours all year round."
  },
  {
    "word": "protein",
    "zh": "蛋白质",
    "pos": "n.",
    "ipa": "",
    "ex": "Chicken, fish, and beans are all excellent sources of protein.",
    "ex2": "Athletes need to consume enough protein to support muscle recovery and overall performance."
  },
  {
    "word": "carbohydrate",
    "zh": "碳水化合物",
    "pos": "n.",
    "ipa": "",
    "ex": "Rice, bread, and pasta are all high in carbohydrates.",
    "ex2": "She reduced her carbohydrate intake and replaced them with more vegetables and lean protein."
  },
  {
    "word": "nutrition",
    "zh": "营养",
    "pos": "n.",
    "ipa": "",
    "ex": "Good nutrition is as important as regular exercise for good health.",
    "ex2": "The hospital hired a specialist to advise patients on nutrition during their recovery."
  },
  {
    "word": "calorie",
    "zh": "卡路里",
    "pos": "n.",
    "ipa": "",
    "ex": "This dessert contains over 600 calories—quite indulgent!",
    "ex2": "He tracked the calories in every meal for a month as part of his weight management plan."
  },
  {
    "word": "diet",
    "zh": "饮食 / 节食",
    "pos": "n.",
    "ipa": "",
    "ex": "A balanced diet includes plenty of vegetables, lean protein, and whole grains.",
    "ex2": "Her doctor recommended a low-sodium diet after her blood pressure readings came back elevated."
  },
  {
    "word": "junk food",
    "zh": "垃圾食品",
    "pos": "n.",
    "ipa": "",
    "ex": "Try to limit junk food to an occasional treat rather than a daily habit.",
    "ex2": "Studies show that children who regularly eat junk food perform worse in school on average."
  },
  {
    "word": "exercise",
    "zh": "锻炼",
    "pos": "n./v.",
    "ipa": "",
    "ex": "Regular exercise improves both physical and mental wellbeing.",
    "ex2": "She exercised for thirty minutes every morning before work, regardless of the weather."
  },
  {
    "word": "gym",
    "zh": "健身房",
    "pos": "n.",
    "ipa": "",
    "ex": "I go to the gym three times a week after work.",
    "ex2": "The gyms in the city were packed with new members throughout January after the New Year."
  },
  {
    "word": "jogging",
    "zh": "慢跑",
    "pos": "n.",
    "ipa": "",
    "ex": "Early morning jogging is a great way to start the day.",
    "ex2": "She had been jogging regularly for six months before entering her first five-kilometre race."
  },
  {
    "word": "yoga",
    "zh": "瑜伽",
    "pos": "n.",
    "ipa": "",
    "ex": "She does yoga every morning to improve flexibility and reduce stress.",
    "ex2": "Many companies now offer yoga sessions during lunch breaks to improve employee wellbeing."
  },
  {
    "word": "swimming",
    "zh": "游泳",
    "pos": "n.",
    "ipa": "",
    "ex": "Swimming is one of the best full-body exercises available.",
    "ex2": "He has been swimming competitively since the age of eight and has won several regional titles."
  },
  {
    "word": "cycling",
    "zh": "骑自行车",
    "pos": "n.",
    "ipa": "",
    "ex": "Cycling to work is both eco-friendly and great exercise.",
    "ex2": "She started cycling longer distances on weekends to prepare for a charity fundraising ride."
  },
  {
    "word": "match",
    "zh": "比赛",
    "pos": "n.",
    "ipa": "",
    "ex": "The football match starts at 8 p.m.—want to watch it together?",
    "ex2": "The team has played twelve matches this season and has yet to suffer a defeat."
  },
  {
    "word": "team sport",
    "zh": "团体运动",
    "pos": "n.",
    "ipa": "",
    "ex": "Team sports build collaboration and communication skills.",
    "ex2": "Participating in team sports during childhood is linked to better social skills in adulthood."
  },
  {
    "word": "coach",
    "zh": "教练",
    "pos": "n.",
    "ipa": "",
    "ex": "The coach gave a motivating team talk before the final.",
    "ex2": "She has been coaching junior athletes for over fifteen years and has produced several champions."
  },
  {
    "word": "tournament",
    "zh": "锦标赛",
    "pos": "n.",
    "ipa": "",
    "ex": "Our company is entering a table tennis tournament next month.",
    "ex2": "Teams from twenty countries competed in the international basketball tournament held in Seoul."
  },
  {
    "word": "hobby",
    "zh": "爱好",
    "pos": "n.",
    "ipa": "",
    "ex": "My hobbies include reading, cooking, and hiking in the mountains.",
    "ex2": "She turned her hobby of painting into a small business selling prints online."
  },
  {
    "word": "travel",
    "zh": "旅行",
    "pos": "n./v.",
    "ipa": "",
    "ex": "I love to travel to new places whenever I have the chance.",
    "ex2": "He has been travelling extensively for work and has visited over forty countries in five years."
  },
  {
    "word": "concert",
    "zh": "音乐会",
    "pos": "n.",
    "ipa": "",
    "ex": "We have tickets to a jazz concert downtown this Saturday.",
    "ex2": "The concert attracted over fifty thousand fans from across the country and sold out in minutes."
  },
  {
    "word": "exhibition",
    "zh": "展览",
    "pos": "n.",
    "ipa": "",
    "ex": "There's a fantastic photography exhibition at the gallery this month.",
    "ex2": "The exhibition featured over three hundred works by artists from more than twenty countries."
  },
  {
    "word": "cinema",
    "zh": "电影院",
    "pos": "n.",
    "ipa": "",
    "ex": "Let's catch a movie at the cinema after dinner tonight.",
    "ex2": "The cinema was packed for the opening weekend of the most anticipated film of the year."
  },
  {
    "word": "theatre",
    "zh": "剧场 / 剧院",
    "pos": "n.",
    "ipa": "",
    "ex": "We saw an amazing play at the West End theatre last weekend.",
    "ex2": "The theatres were fully booked for the entire run of the award-winning production."
  },
  {
    "word": "photography",
    "zh": "摄影",
    "pos": "n.",
    "ipa": "",
    "ex": "He takes up photography as a hobby and has a great eye for detail.",
    "ex2": "She studied photography at art school and now shoots for major fashion magazines."
  },
  {
    "word": "weekend getaway",
    "zh": "周末短途旅行",
    "pos": "n.",
    "ipa": "",
    "ex": "A weekend getaway to the countryside is just what we need.",
    "ex2": "They planned a short weekend getaway to recharge before a particularly busy month at work."
  },
  {
    "word": "staycation",
    "zh": "居家度假",
    "pos": "n.",
    "ipa": "",
    "ex": "We had a staycation this summer and explored our own city.",
    "ex2": "More people opted for staycations during the pandemic and discovered hidden gems in their own city."
  },
  {
    "word": "backache",
    "zh": "背痛",
    "pos": "n.",
    "ipa": "",
    "ex": "Sitting at a desk all day can cause chronic backache.",
    "ex2": "He suffered from backaches for years before a physiotherapist helped him correct his posture."
  },
  {
    "word": "toothache",
    "zh": "牙痛",
    "pos": "n.",
    "ipa": "",
    "ex": "My toothache has been unbearable—I need to see a dentist today.",
    "ex2": "She ignored the toothache for two weeks until the pain became too severe to manage."
  },
  {
    "word": "fit",
    "zh": "健康的 / 合适的",
    "pos": "adj.",
    "ipa": "",
    "ex": "She keeps fit by running five kilometres every morning.",
    "ex2": "He has been getting fitter since joining the gym and changing his diet three months ago."
  },
  {
    "word": "overweight",
    "zh": "超重的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Being overweight increases the risk of heart disease and diabetes.",
    "ex2": "The doctor advised him not to focus solely on weight but on overall fitness and healthy habits."
  },
  {
    "word": "weight",
    "zh": "体重",
    "pos": "n.",
    "ipa": "",
    "ex": "His doctor advised him to watch his weight and cut down on sugar.",
    "ex2": "She lost a significant amount of weight after adopting a more active and balanced lifestyle."
  },
  {
    "word": "dentist",
    "zh": "牙医",
    "pos": "n.",
    "ipa": "",
    "ex": "I go to the dentist for a check-up every six months.",
    "ex2": "The dentist recommended she wear a night guard to prevent further damage from teeth grinding."
  },
  {
    "word": "optician",
    "zh": "眼科医生 / 眼镜师",
    "pos": "n.",
    "ipa": "",
    "ex": "I need to visit the optician—my eyesight has got worse.",
    "ex2": "The optician tested her vision and confirmed she needed a stronger prescription for both eyes."
  },
  {
    "word": "prescription glasses",
    "zh": "处方眼镜",
    "pos": "n.",
    "ipa": "",
    "ex": "I wear prescription glasses for reading and working at a screen.",
    "ex2": "She finally got prescription glasses after years of squinting at presentations during meetings."
  },
  {
    "word": "stress",
    "zh": "压力",
    "pos": "n.",
    "ipa": "",
    "ex": "Too much stress at work can have serious long-term health effects.",
    "ex2": "She managed her stress by exercising regularly, journalling, and maintaining a strict work-life boundary."
  },
  {
    "word": "mental health",
    "zh": "心理健康",
    "pos": "n.",
    "ipa": "",
    "ex": "Looking after your mental health is just as important as your physical health.",
    "ex2": "Companies are increasingly offering mental health support and counselling to their employees."
  },
  {
    "word": "meditation",
    "zh": "冥想",
    "pos": "n.",
    "ipa": "",
    "ex": "Ten minutes of meditation each morning helps me start the day calmly.",
    "ex2": "She began meditating during the pandemic and found it dramatically reduced her anxiety levels."
  },
  {
    "word": "hydration",
    "zh": "补水",
    "pos": "n.",
    "ipa": "",
    "ex": "Good hydration improves concentration, energy, and skin health.",
    "ex2": "Athletes pay close attention to hydration levels before, during, and after intense training sessions."
  },
  {
    "word": "vitamins",
    "zh": "维生素",
    "pos": "n.",
    "ipa": "",
    "ex": "Take vitamin D supplements if you don't get much sunlight.",
    "ex2": "She started taking a range of vitamins after her blood test showed several nutritional deficiencies."
  },
  {
    "word": "blood sugar",
    "zh": "血糖",
    "pos": "n.",
    "ipa": "",
    "ex": "Diabetic patients must monitor their blood sugar levels daily.",
    "ex2": "Eating refined sugar causes blood sugar levels to spike rapidly and then drop sharply."
  },
  {
    "word": "surgery recovery",
    "zh": "术后恢复",
    "pos": "n.",
    "ipa": "",
    "ex": "Surgery recovery can take several weeks depending on the procedure.",
    "ex2": "She followed all the physiotherapist's instructions carefully during her surgery recovery period."
  },
  {
    "word": "outfit",
    "zh": "全套服装",
    "pos": "n.",
    "ipa": "",
    "ex": "She put together a stylish outfit for the business dinner.",
    "ex2": "He planned his outfits for the entire conference week to avoid last-minute wardrobe decisions."
  },
  {
    "word": "suit",
    "zh": "西装",
    "pos": "n.",
    "ipa": "",
    "ex": "He always wears a suit to client meetings.",
    "ex2": "She bought a tailored suit for the job interview and made a strong first impression."
  },
  {
    "word": "casual",
    "zh": "休闲的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Friday is casual dress day at our office.",
    "ex2": "The event was described as casual, so she opted for smart jeans and a clean blazer."
  },
  {
    "word": "formal",
    "zh": "正式的",
    "pos": "adj.",
    "ipa": "",
    "ex": "The awards ceremony is formal, so dress accordingly.",
    "ex2": "He wore his most formal attire to the gala dinner, which was hosted by the company CEO."
  },
  {
    "word": "tight",
    "zh": "紧的",
    "pos": "adj.",
    "ipa": "",
    "ex": "These trousers are a bit tight around the waist—do you have a bigger size?",
    "ex2": "The shirt was too tight across the shoulders, so she exchanged it for a larger size."
  },
  {
    "word": "loose",
    "zh": "宽松的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Loose, comfortable clothing is ideal for a long flight.",
    "ex2": "She preferred looser clothing during summer to stay cool in the heat."
  },
  {
    "word": "fabric",
    "zh": "布料",
    "pos": "n.",
    "ipa": "",
    "ex": "This fabric is 100% cotton, so it's breathable and soft.",
    "ex2": "The dress was made from a delicate fabric that required gentle hand-washing after every wear."
  },
  {
    "word": "laundry",
    "zh": "洗衣",
    "pos": "n.",
    "ipa": "",
    "ex": "Read the laundry label before washing to avoid shrinking.",
    "ex2": "She set aside Sunday afternoons to catch up on laundry and prepare for the week ahead."
  },
  {
    "word": "iron",
    "zh": "熨斗 / 熨烫",
    "pos": "n./v.",
    "ipa": "",
    "ex": "Iron your shirt the night before to save time in the morning.",
    "ex2": "He ironed all his shirts at once on Sunday evening to avoid the rush during the week."
  },
  {
    "word": "dry clean only",
    "zh": "只可干洗",
    "pos": "phr.",
    "ipa": "",
    "ex": "The label says dry clean only—don't put it in the washing machine.",
    "ex2": "She ruined her favourite jacket by ignoring the dry clean only instruction on the label."
  },
  {
    "word": "wardrobe",
    "zh": "衣橱 / 衣柜",
    "pos": "n.",
    "ipa": "",
    "ex": "I need to declutter my wardrobe and donate clothes I no longer wear.",
    "ex2": "She organised her wardrobe by colour and season to make getting dressed in the morning easier."
  },
  {
    "word": "accessory",
    "zh": "配饰",
    "pos": "n.",
    "ipa": "",
    "ex": "A simple scarf or belt can really elevate a basic outfit.",
    "ex2": "She completed her look with carefully chosen accessories that matched both her outfit and the occasion."
  },
  {
    "word": "dress code",
    "zh": "着装规定",
    "pos": "n.",
    "ipa": "",
    "ex": "Check the dress code before booking the restaurant—some require smart attire.",
    "ex2": "The company enforces a strict dress code for all client-facing employees and external meetings."
  },
  {
    "word": "introduce",
    "zh": "介绍",
    "pos": "v.",
    "ipa": "",
    "ex": "Let me introduce you to our new marketing director.",
    "ex2": "She introduced herself confidently to every person she met at the networking event."
  },
  {
    "word": "shake hands",
    "zh": "握手",
    "pos": "phr.",
    "ipa": "",
    "ex": "It is customary to shake hands when meeting a client for the first time.",
    "ex2": "They shook hands warmly after signing the contract and agreed to celebrate at dinner."
  },
  {
    "word": "compliment",
    "zh": "称赞",
    "pos": "n./v.",
    "ipa": "",
    "ex": "She received many compliments on her thoughtful presentation.",
    "ex2": "He complimented the chef directly on the exceptional quality of every course of the meal."
  },
  {
    "word": "apologise",
    "zh": "道歉",
    "pos": "v.",
    "ipa": "",
    "ex": "I'd like to sincerely apologise for the confusion I caused.",
    "ex2": "The manager apologised to the entire team for the miscommunication that led to the delay."
  },
  {
    "word": "interrupt",
    "zh": "打断",
    "pos": "v.",
    "ipa": "",
    "ex": "I'm sorry to interrupt, but could I add a quick point?",
    "ex2": "He kept interrupting the speaker, which made it difficult for anyone else to follow the discussion."
  },
  {
    "word": "clarify",
    "zh": "澄清",
    "pos": "v.",
    "ipa": "",
    "ex": "Could you clarify what you mean by 'acceptable quality'?",
    "ex2": "She asked the client to clarify their requirements before the design work began."
  },
  {
    "word": "confirm",
    "zh": "确认",
    "pos": "v.",
    "ipa": "",
    "ex": "Please confirm your attendance by replying to this email.",
    "ex2": "We need you to confirm the order details before we proceed with production."
  },
  {
    "word": "remind",
    "zh": "提醒",
    "pos": "v.",
    "ipa": "",
    "ex": "I'll send a reminder email before the meeting tomorrow.",
    "ex2": "She reminded the team about the deadline three times to ensure no one would miss it."
  },
  {
    "word": "suggest",
    "zh": "建议",
    "pos": "v.",
    "ipa": "",
    "ex": "I suggest we take a short break and then continue.",
    "ex2": "Several team members suggested alternative approaches that hadn't been considered initially."
  },
  {
    "word": "recommend",
    "zh": "推荐",
    "pos": "v.",
    "ipa": "",
    "ex": "Could you recommend a good hotel near the conference venue?",
    "ex2": "He was highly recommended by two former managers when he applied for the senior position."
  },
  {
    "word": "complain",
    "zh": "投诉 / 抱怨",
    "pos": "v.",
    "ipa": "",
    "ex": "Several guests complained about the slow service at the hotel.",
    "ex2": "She had been complaining about the noise from the construction site for several weeks."
  },
  {
    "word": "argue",
    "zh": "争论",
    "pos": "v.",
    "ipa": "",
    "ex": "It's better to discuss calmly than to argue and damage the relationship.",
    "ex2": "They argued for nearly an hour before finally agreeing on a compromise that satisfied both sides."
  },
  {
    "word": "persuade",
    "zh": "说服",
    "pos": "v.",
    "ipa": "",
    "ex": "She persuaded the team to adopt a more innovative approach.",
    "ex2": "He spent two weeks persuading the board to approve the budget for the new research project."
  },
  {
    "word": "encourage",
    "zh": "鼓励",
    "pos": "v.",
    "ipa": "",
    "ex": "Good managers always encourage their team members to grow.",
    "ex2": "Her parents encouraged her throughout her studies, even when she felt like giving up."
  },
  {
    "word": "negotiate",
    "zh": "谈判 / 协商",
    "pos": "v.",
    "ipa": "",
    "ex": "We negotiated a better price by ordering a larger quantity.",
    "ex2": "The two sides have been negotiating for months but have yet to reach a final agreement."
  },
  {
    "word": "disagree politely",
    "zh": "礼貌地表示不同意",
    "pos": "phr.",
    "ipa": "",
    "ex": "I see your point, but I'd respectfully disagree with that view.",
    "ex2": "She disagreed politely but clearly, explaining her reasoning without dismissing the other person's perspective."
  },
  {
    "word": "make a point",
    "zh": "提出观点",
    "pos": "phr.",
    "ipa": "",
    "ex": "I'd like to make a point about the project timeline.",
    "ex2": "She made a strong point about the need for better communication across departments."
  },
  {
    "word": "keep in touch",
    "zh": "保持联系",
    "pos": "phr.",
    "ipa": "",
    "ex": "Let's keep in touch after the conference—here's my card.",
    "ex2": "They have been keeping in touch regularly since working together five years ago."
  },
  {
    "word": "reach out",
    "zh": "主动联系",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "Don't hesitate to reach out if you have any questions at all.",
    "ex2": "She reached out to several former colleagues when she started looking for a new role."
  },
  {
    "word": "get in touch",
    "zh": "联系",
    "pos": "phr.",
    "ipa": "",
    "ex": "Get in touch with the supplier and ask for a formal quotation.",
    "ex2": "Please get in touch with us at least two weeks before your intended arrival date."
  },
  {
    "word": "touch base",
    "zh": "联系确认",
    "pos": "phr.",
    "ipa": "",
    "ex": "Let's touch base next week to see how things are progressing.",
    "ex2": "He touched base with the client briefly after the product launch to gather initial feedback."
  },
  {
    "word": "small talk",
    "zh": "闲聊",
    "pos": "n.",
    "ipa": "",
    "ex": "Making small talk before a meeting helps break the ice.",
    "ex2": "She found small talk difficult at networking events but made a real effort each time."
  },
  {
    "word": "body language",
    "zh": "肢体语言",
    "pos": "n.",
    "ipa": "",
    "ex": "Good body language—eye contact and upright posture—builds trust.",
    "ex2": "Trainers teach candidates to read body language cues during high-stakes negotiations."
  },
  {
    "word": "tone of voice",
    "zh": "语气",
    "pos": "n.",
    "ipa": "",
    "ex": "Your tone of voice matters as much as the words you choose.",
    "ex2": "She adjusted her tone of voice depending on whether she was speaking to a client or a colleague."
  },
  {
    "word": "desert",
    "zh": "沙漠",
    "pos": "n.",
    "ipa": "",
    "ex": "Temperatures in the Sahara Desert can exceed 50 degrees Celsius.",
    "ex2": "Vast deserts cover more than a third of the African continent."
  },
  {
    "word": "earthquake",
    "zh": "地震",
    "pos": "n.",
    "ipa": "",
    "ex": "A major earthquake struck the region, causing widespread damage.",
    "ex2": "Buildings in earthquake-prone areas must be designed to withstand powerful tremors."
  },
  {
    "word": "pollution",
    "zh": "污染",
    "pos": "n.",
    "ipa": "",
    "ex": "Air pollution in large cities is a serious public health concern.",
    "ex2": "The river was heavily polluted by industrial waste discharged illegally over several years."
  },
  {
    "word": "environment",
    "zh": "环境",
    "pos": "n.",
    "ipa": "",
    "ex": "We all have a responsibility to protect the natural environment.",
    "ex2": "Many businesses are adapting their practices to minimise their impact on the environment."
  },
  {
    "word": "recycle",
    "zh": "回收利用",
    "pos": "v.",
    "ipa": "",
    "ex": "Recycle paper, glass, and plastic to reduce landfill waste.",
    "ex2": "The factory has been recycling nearly 90% of its production waste for the past three years."
  },
  {
    "word": "renewable energy",
    "zh": "可再生能源",
    "pos": "n.",
    "ipa": "",
    "ex": "Solar and wind power are the fastest-growing forms of renewable energy.",
    "ex2": "The country has committed to sourcing all its electricity from renewable energy by 2040."
  },
  {
    "word": "carbon footprint",
    "zh": "碳足迹",
    "pos": "n.",
    "ipa": "",
    "ex": "Reducing your carbon footprint is one way to help slow climate change.",
    "ex2": "The airline offers passengers the option to offset their carbon footprints by funding green projects."
  },
  {
    "word": "climate change",
    "zh": "气候变化",
    "pos": "n.",
    "ipa": "",
    "ex": "Climate change poses one of the greatest challenges of our generation.",
    "ex2": "Scientists have been studying the long-term effects of climate change on coastal regions."
  },
  {
    "word": "wildlife",
    "zh": "野生动物",
    "pos": "n.",
    "ipa": "",
    "ex": "The national park protects a wide variety of endangered wildlife.",
    "ex2": "Deforestation has destroyed the habitats of countless wildlife species across the tropics."
  },
  {
    "word": "sustainability",
    "zh": "可持续性",
    "pos": "n.",
    "ipa": "",
    "ex": "Sustainability is now a core part of our company's business strategy.",
    "ex2": "Many universities now offer dedicated courses in sustainability and environmental management."
  },
  {
    "word": "dozen",
    "zh": "一打（12个）",
    "pos": "n.",
    "ipa": "",
    "ex": "Please buy a dozen eggs on your way home from work.",
    "ex2": "Dozens of applicants were interviewed before the position was finally filled."
  },
  {
    "word": "per cent",
    "zh": "百分之…",
    "pos": "n.",
    "ipa": "",
    "ex": "Sales rose by 15 per cent compared to the same quarter last year.",
    "ex2": "Customer satisfaction ratings improved by over 20 per cent following the service redesign."
  },
  {
    "word": "double",
    "zh": "两倍 / 双份",
    "pos": "adj./v.",
    "ipa": "",
    "ex": "We need to double our output to meet the new contract demands.",
    "ex2": "The number of users has more than doubled since the app was updated six months ago."
  },
  {
    "word": "average",
    "zh": "平均",
    "pos": "n./adj.",
    "ipa": "",
    "ex": "The average salary in this industry is around 15,000 yuan per month.",
    "ex2": "Temperatures have been well above average for this time of year across the region."
  },
  {
    "word": "maximum",
    "zh": "最大值 / 最多",
    "pos": "n./adj.",
    "ipa": "",
    "ex": "The maximum weight limit for carry-on luggage is 7 kilograms.",
    "ex2": "The venue can accommodate a maximum of 200 guests for a seated dinner."
  },
  {
    "word": "minimum",
    "zh": "最小值 / 最少",
    "pos": "n./adj.",
    "ipa": "",
    "ex": "The minimum order quantity is 100 units for a bulk discount.",
    "ex2": "The job requires a minimum of three years of relevant experience in the sector."
  },
  {
    "word": "total",
    "zh": "总计",
    "pos": "n./adj.",
    "ipa": "",
    "ex": "The total cost, including tax and shipping, is 3,500 yuan.",
    "ex2": "When all the expenses were totalled up, the final bill was significantly higher than expected."
  },
  {
    "word": "increase",
    "zh": "增加",
    "pos": "v./n.",
    "ipa": "",
    "ex": "The company expects revenue to increase by 20% next year.",
    "ex2": "There has been a sharp increase in online orders since the new payment system was introduced."
  },
  {
    "word": "decrease",
    "zh": "减少",
    "pos": "v./n.",
    "ipa": "",
    "ex": "The number of complaints has decreased significantly this quarter.",
    "ex2": "Energy consumption decreased by 30% after the efficiency upgrades were completed."
  },
  {
    "word": "significant",
    "zh": "显著的",
    "pos": "adj.",
    "ipa": "",
    "ex": "There has been a significant improvement in customer satisfaction scores.",
    "ex2": "The research findings are significant and will influence policy decisions for years to come."
  },
  {
    "word": "slight",
    "zh": "轻微的",
    "pos": "adj.",
    "ipa": "",
    "ex": "There's been a slight delay, but we're still on schedule overall.",
    "ex2": "There was a slight increase in costs, but nothing that would affect the overall budget significantly."
  },
  {
    "word": "considerable",
    "zh": "相当大的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Considerable effort went into making this event a success.",
    "ex2": "There has been considerable progress in the negotiations over the past two weeks."
  },
  {
    "word": "proportion",
    "zh": "比例",
    "pos": "n.",
    "ipa": "",
    "ex": "A large proportion of our customers now shop via mobile.",
    "ex2": "A growing proportion of the workforce is choosing to work remotely on a permanent basis."
  },
  {
    "word": "majority",
    "zh": "大多数",
    "pos": "n.",
    "ipa": "",
    "ex": "The majority of staff voted in favour of the new flexible policy.",
    "ex2": "The vast majority of participants rated the training programme as excellent or very good."
  },
  {
    "word": "minority",
    "zh": "少数",
    "pos": "n.",
    "ipa": "",
    "ex": "Only a small minority expressed concerns about the new arrangement.",
    "ex2": "A minority of users reported experiencing technical difficulties after the system update."
  },
  {
    "word": "available",
    "zh": "可用的 / 空闲的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Is this room available for the whole of next week?",
    "ex2": "Very few slots are still available for the popular weekend workshop—book quickly."
  },
  {
    "word": "convenient",
    "zh": "方便的",
    "pos": "adj.",
    "ipa": "",
    "ex": "A location near the metro station would be very convenient.",
    "ex2": "It would be more convenient to hold the meeting online rather than requiring everyone to travel."
  },
  {
    "word": "essential",
    "zh": "必要的",
    "pos": "adj.",
    "ipa": "",
    "ex": "A good internet connection is essential for remote work.",
    "ex2": "Strong communication skills are essential for anyone working in a client-facing role."
  },
  {
    "word": "appropriate",
    "zh": "合适的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Please wear appropriate attire for the formal dinner.",
    "ex2": "The manager asked the team to ensure all responses to clients were appropriately worded."
  },
  {
    "word": "sufficient",
    "zh": "足够的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Please ensure there is sufficient time for questions at the end.",
    "ex2": "The team didn't have sufficient resources to complete both projects simultaneously."
  },
  {
    "word": "flexible",
    "zh": "灵活的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Our working hours are flexible—you can start between 8 and 10.",
    "ex2": "She was more flexible about the timeline once she understood the technical constraints involved."
  },
  {
    "word": "relevant",
    "zh": "相关的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Only relevant experience should be included in your CV.",
    "ex2": "Please share any documents that are relevant to the discussion before the meeting begins."
  },
  {
    "word": "accurate",
    "zh": "准确的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Make sure all figures in the report are accurate and up to date.",
    "ex2": "The forecasts were not entirely accurate, which led to some unexpected budget shortfalls."
  },
  {
    "word": "reliable",
    "zh": "可靠的",
    "pos": "adj.",
    "ipa": "",
    "ex": "We need a reliable supplier who can deliver on time, every time.",
    "ex2": "She has proven to be one of the most reliable members of the team over the past two years."
  },
  {
    "word": "efficient",
    "zh": "高效的",
    "pos": "adj.",
    "ipa": "",
    "ex": "The new system is far more efficient than the old paper-based process.",
    "ex2": "By automating routine tasks, the team worked more efficiently and freed up time for strategy."
  },
  {
    "word": "complicated",
    "zh": "复杂的",
    "pos": "adj.",
    "ipa": "",
    "ex": "The visa application process can be very complicated—seek advice.",
    "ex2": "The situation became more complicated when new information emerged on the day of the hearing."
  },
  {
    "word": "straightforward",
    "zh": "简单直接的",
    "pos": "adj.",
    "ipa": "",
    "ex": "The instructions are clear and straightforward to follow.",
    "ex2": "The process is more straightforward than it appears once you understand the basic steps involved."
  },
  {
    "word": "arrange",
    "zh": "安排",
    "pos": "v.",
    "ipa": "",
    "ex": "I'll arrange a car to pick you up from the airport.",
    "ex2": "She arranged all the travel and accommodation for the delegation well in advance of the summit."
  },
  {
    "word": "prepare",
    "zh": "准备",
    "pos": "v.",
    "ipa": "",
    "ex": "Prepare your questions in advance so you don't forget during the call.",
    "ex2": "The team had been preparing for the product launch for over three months before the event."
  },
  {
    "word": "manage",
    "zh": "管理 / 设法做到",
    "pos": "v.",
    "ipa": "",
    "ex": "She managed to finish the whole project ahead of schedule.",
    "ex2": "He managed the entire operation single-handedly while the rest of the team was on leave."
  },
  {
    "word": "achieve",
    "zh": "实现 / 达到",
    "pos": "v.",
    "ipa": "",
    "ex": "We need to work together to achieve our ambitious growth targets.",
    "ex2": "She achieved more in her first year at the company than most employees do in three."
  },
  {
    "word": "improve",
    "zh": "改善 / 提高",
    "pos": "v.",
    "ipa": "",
    "ex": "Regular practice is the best way to improve your spoken English.",
    "ex2": "Customer feedback has improved consistently since the new service protocol was introduced."
  },
  {
    "word": "expand",
    "zh": "扩展 / 扩大",
    "pos": "v.",
    "ipa": "",
    "ex": "The company plans to expand into three new markets next year.",
    "ex2": "They have been expanding their product range steadily to meet growing customer demand."
  },
  {
    "word": "reduce",
    "zh": "减少 / 降低",
    "pos": "v.",
    "ipa": "",
    "ex": "We need to find ways to reduce costs without cutting quality.",
    "ex2": "The new packaging has reduced material waste by nearly a quarter across all product lines."
  },
  {
    "word": "maintain",
    "zh": "维护 / 保持",
    "pos": "v.",
    "ipa": "",
    "ex": "It is important to maintain regular contact with your key clients.",
    "ex2": "The company has maintained strong growth figures for five consecutive years."
  },
  {
    "word": "ensure",
    "zh": "确保",
    "pos": "v.",
    "ipa": "",
    "ex": "Please ensure that all safety guidelines are followed at all times.",
    "ex2": "The team leader ensured that every member was fully briefed before the client visit."
  },
  {
    "word": "consider",
    "zh": "考虑",
    "pos": "v.",
    "ipa": "",
    "ex": "We need to consider all options before making a final decision.",
    "ex2": "The board considered several alternative strategies before agreeing on the current direction."
  },
  {
    "word": "compare",
    "zh": "比较",
    "pos": "v.",
    "ipa": "",
    "ex": "Compare prices from at least three different suppliers before ordering.",
    "ex2": "When the two proposals were compared side by side, the differences were immediately apparent."
  },
  {
    "word": "discuss",
    "zh": "讨论",
    "pos": "v.",
    "ipa": "",
    "ex": "Let's schedule a call to discuss the details in full.",
    "ex2": "The committee has been discussing the proposed changes for several weeks without reaching a conclusion."
  },
  {
    "word": "explain",
    "zh": "解释",
    "pos": "v.",
    "ipa": "",
    "ex": "Could you explain how the new billing system works?",
    "ex2": "The trainer explained each step of the process in detail before asking participants to practise."
  },
  {
    "word": "present",
    "zh": "呈现 / 展示",
    "pos": "v.",
    "ipa": "",
    "ex": "She will present the quarterly results to the board on Thursday.",
    "ex2": "He has been presenting at industry conferences for over a decade and is a polished speaker."
  },
  {
    "word": "address",
    "zh": "处理 / 应对",
    "pos": "v.",
    "ipa": "",
    "ex": "We need to address the customer complaint before it escalates.",
    "ex2": "The CEO addressed the concerns raised by shareholders at the annual general meeting."
  },
  {
    "word": "identify",
    "zh": "识别 / 找出",
    "pos": "v.",
    "ipa": "",
    "ex": "Let's identify the root cause of the problem before proposing a fix.",
    "ex2": "The audit identified several areas where processes could be streamlined and made more efficient."
  },
  {
    "word": "implement",
    "zh": "实施",
    "pos": "v.",
    "ipa": "",
    "ex": "We plan to implement the new policy from the start of next month.",
    "ex2": "The changes were implemented gradually to avoid disrupting day-to-day operations."
  },
  {
    "word": "evaluate",
    "zh": "评估",
    "pos": "v.",
    "ipa": "",
    "ex": "We'll evaluate the pilot programme after three months.",
    "ex2": "The committee evaluated each proposal against a set of pre-agreed criteria before voting."
  },
  {
    "word": "monitor",
    "zh": "监控 / 跟踪",
    "pos": "v.",
    "ipa": "",
    "ex": "The team will monitor the results on a weekly basis.",
    "ex2": "Progress is being monitored closely by senior management throughout the project lifecycle."
  },
  {
    "word": "make a call",
    "zh": "打电话",
    "pos": "phr.",
    "ipa": "",
    "ex": "I need to make a call—could you give me a few minutes?",
    "ex2": "She made several calls to suppliers before finding one that could meet the tight deadline."
  },
  {
    "word": "miss a call",
    "zh": "错过来电",
    "pos": "phr.",
    "ipa": "",
    "ex": "I missed a call from the client—I'll ring back straight away.",
    "ex2": "He had missed three calls from the office while he was in the interview room."
  },
  {
    "word": "put on hold",
    "zh": "让对方等候",
    "pos": "phr.",
    "ipa": "",
    "ex": "The agent put me on hold for ten minutes before answering.",
    "ex2": "The decision was put on hold pending the results of the independent review."
  },
  {
    "word": "call back",
    "zh": "回电话",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "Could you call me back when you're free? I have some questions.",
    "ex2": "She called back within the hour with the information the client had been waiting for."
  },
  {
    "word": "voicemail",
    "zh": "语音留言",
    "pos": "n.",
    "ipa": "",
    "ex": "Please leave a voicemail and I'll return your call this afternoon.",
    "ex2": "He checked his voicemails while commuting and found two urgent messages from the client."
  },
  {
    "word": "conference call",
    "zh": "电话会议",
    "pos": "n.",
    "ipa": "",
    "ex": "We have a conference call with the New York office at 3 p.m.",
    "ex2": "Conference calls across time zones require careful scheduling to find a time that works for all."
  },
  {
    "word": "text message",
    "zh": "短信",
    "pos": "n.",
    "ipa": "",
    "ex": "Send me a text message when you arrive at the airport.",
    "ex2": "She sent several text messages but received no reply, so she called instead."
  },
  {
    "word": "instant message",
    "zh": "即时消息",
    "pos": "n.",
    "ipa": "",
    "ex": "Use instant messaging for quick questions rather than email.",
    "ex2": "He sent an instant message to the whole team to alert them about the last-minute change."
  },
  {
    "word": "subject line",
    "zh": "邮件主题",
    "pos": "n.",
    "ipa": "",
    "ex": "Use a clear subject line so the recipient knows what the email is about.",
    "ex2": "A well-written subject line significantly increases the likelihood of your email being opened."
  },
  {
    "word": "CC",
    "zh": "抄送",
    "pos": "v.",
    "ipa": "",
    "ex": "CC the manager on all client correspondence.",
    "ex2": "Please CC me on all the emails related to this account so I stay up to date."
  },
  {
    "word": "attachment",
    "zh": "附件",
    "pos": "n.",
    "ipa": "",
    "ex": "Please see the attachment for the full project breakdown.",
    "ex2": "He forgot to include the attachments in his first email and had to send a follow-up."
  },
  {
    "word": "reply all",
    "zh": "全部回复",
    "pos": "phr.",
    "ipa": "",
    "ex": "Be careful when you hit reply all—not everyone needs to see this.",
    "ex2": "She accidentally used reply all and sent her personal comments to the entire company mailing list."
  },
  {
    "word": "forward",
    "zh": "转发",
    "pos": "v.",
    "ipa": "",
    "ex": "Can you forward the email thread to the new account manager?",
    "ex2": "She forwarded the proposal to three colleagues and asked for their feedback before the deadline."
  },
  {
    "word": "out of office",
    "zh": "外出/不在办公室",
    "pos": "phr.",
    "ipa": "",
    "ex": "I set up an out-of-office reply while I'm on annual leave.",
    "ex2": "Her out-of-office message directed all urgent queries to a named colleague in her absence."
  },
  {
    "word": "urgent email",
    "zh": "紧急邮件",
    "pos": "n.",
    "ipa": "",
    "ex": "Flag it as an urgent email so they know to open it first.",
    "ex2": "She received an urgent email from the client at 10 p.m. and responded within the hour."
  },
  {
    "word": "subscribe",
    "zh": "订阅",
    "pos": "v.",
    "ipa": "",
    "ex": "Subscribe to the newsletter to get weekly industry updates.",
    "ex2": "Over a million users have subscribed to the channel since it launched two years ago."
  },
  {
    "word": "unsubscribe",
    "zh": "取消订阅",
    "pos": "v.",
    "ipa": "",
    "ex": "Scroll to the bottom to find the unsubscribe link.",
    "ex2": "She unsubscribed from dozens of mailing lists to reduce inbox clutter and improve focus."
  },
  {
    "word": "studio apartment",
    "zh": "开间公寓",
    "pos": "n.",
    "ipa": "",
    "ex": "A studio apartment is perfect for a single person living alone.",
    "ex2": "Studio apartments in the city centre are in high demand among young professionals."
  },
  {
    "word": "terraced house",
    "zh": "联排别墅",
    "pos": "n.",
    "ipa": "",
    "ex": "They bought a terraced house in a quiet street near the park.",
    "ex2": "Rows of terraced houses lined both sides of the Victorian street, all built in the same style."
  },
  {
    "word": "detached house",
    "zh": "独栋别墅",
    "pos": "n.",
    "ipa": "",
    "ex": "A detached house offers more privacy and a larger garden.",
    "ex2": "Detached houses in suburban areas tend to retain their value well over the long term."
  },
  {
    "word": "floor plan",
    "zh": "户型图",
    "pos": "n.",
    "ipa": "",
    "ex": "The agent sent us the floor plan so we could plan the furniture layout.",
    "ex2": "Looking at the floor plans carefully helped them decide which apartment suited their lifestyle best."
  },
  {
    "word": "square metres",
    "zh": "平方米",
    "pos": "n.",
    "ipa": "",
    "ex": "The apartment is 85 square metres—a good size for a couple.",
    "ex2": "The new office space measures over 400 square metres and can accommodate the whole team."
  },
  {
    "word": "renovation",
    "zh": "装修 / 翻新",
    "pos": "n.",
    "ipa": "",
    "ex": "The kitchen is undergoing a full renovation this summer.",
    "ex2": "The building's renovation took eighteen months and cost considerably more than originally budgeted."
  },
  {
    "word": "maintenance",
    "zh": "维护 / 维修",
    "pos": "n.",
    "ipa": "",
    "ex": "Report any maintenance issues to the building manager immediately.",
    "ex2": "Regular maintenance of the equipment reduces the risk of costly breakdowns and delays."
  },
  {
    "word": "property",
    "zh": "房产 / 物业",
    "pos": "n.",
    "ipa": "",
    "ex": "Property prices in this district have risen 15% this year.",
    "ex2": "They have been investing in rental properties as part of their long-term financial plan."
  },
  {
    "word": "real estate",
    "zh": "房地产",
    "pos": "n.",
    "ipa": "",
    "ex": "Investing in real estate can provide stable long-term returns.",
    "ex2": "The real estate market in major cities has slowed significantly due to higher interest rates."
  },
  {
    "word": "estate agent",
    "zh": "房产中介",
    "pos": "n.",
    "ipa": "",
    "ex": "An experienced estate agent can help you find the right property.",
    "ex2": "The estate agents recommended three properties that matched our budget and requirements closely."
  },
  {
    "word": "viewing",
    "zh": "看房",
    "pos": "n.",
    "ipa": "",
    "ex": "We have three property viewings scheduled for this weekend.",
    "ex2": "After several viewings, they finally found a flat that ticked all the boxes."
  },
  {
    "word": "make an offer",
    "zh": "出价 / 报价",
    "pos": "phr.",
    "ipa": "",
    "ex": "We decided to make an offer of 10% below the asking price.",
    "ex2": "After the viewing, they decided to make an offer immediately before someone else did."
  },
  {
    "word": "exchange contracts",
    "zh": "签合同换约",
    "pos": "phr.",
    "ipa": "",
    "ex": "We exchanged contracts last week and complete next Friday.",
    "ex2": "Once contracts are exchanged, neither party can pull out without significant financial penalty."
  },
  {
    "word": "utility bills",
    "zh": "水电费账单",
    "pos": "n.",
    "ipa": "",
    "ex": "Budget about 500 yuan per month for utility bills in a typical flat.",
    "ex2": "Utility bills have risen sharply this year due to increases in gas and electricity prices."
  },
  {
    "word": "common areas",
    "zh": "公共区域",
    "pos": "n.",
    "ipa": "",
    "ex": "All residents are expected to keep common areas clean and tidy.",
    "ex2": "The common areas of the building were recently refurbished and now include a shared workspace."
  },
  {
    "word": "projector",
    "zh": "投影仪",
    "pos": "n.",
    "ipa": "",
    "ex": "Set up the projector before the client presentation this afternoon.",
    "ex2": "The meeting room has a built-in projector that connects wirelessly to any laptop."
  },
  {
    "word": "spreadsheet",
    "zh": "电子表格",
    "pos": "n.",
    "ipa": "",
    "ex": "Update the spreadsheet with this week's sales figures.",
    "ex2": "She created several spreadsheets to track expenses, project progress, and team workloads."
  },
  {
    "word": "database",
    "zh": "数据库",
    "pos": "n.",
    "ipa": "",
    "ex": "All customer records are stored securely in the database.",
    "ex2": "The new database allows staff to search and retrieve customer information in seconds."
  },
  {
    "word": "cloud-based",
    "zh": "基于云的",
    "pos": "adj.",
    "ipa": "",
    "ex": "We switched to a cloud-based system to allow remote access.",
    "ex2": "Cloud-based platforms allow teams to collaborate on documents in real time from anywhere."
  },
  {
    "word": "shared drive",
    "zh": "共享硬盘/网盘",
    "pos": "n.",
    "ipa": "",
    "ex": "Upload the final version to the shared drive so everyone can see it.",
    "ex2": "All project files are stored on the shared drive and are accessible to the whole team."
  },
  {
    "word": "task management",
    "zh": "任务管理",
    "pos": "n.",
    "ipa": "",
    "ex": "We use task management software to track all ongoing projects.",
    "ex2": "Effective task management tools help teams prioritise work and avoid missing deadlines."
  },
  {
    "word": "deadline reminder",
    "zh": "截止提醒",
    "pos": "n.",
    "ipa": "",
    "ex": "Set a deadline reminder so you don't forget to submit on time.",
    "ex2": "Automated deadline reminders were sent to all team members three days before submission was due."
  },
  {
    "word": "file sharing",
    "zh": "文件共享",
    "pos": "n.",
    "ipa": "",
    "ex": "Use the file sharing platform rather than emailing large attachments.",
    "ex2": "The company introduced a secure file sharing system to prevent sensitive data from being emailed."
  },
  {
    "word": "digital signature",
    "zh": "数字签名",
    "pos": "n.",
    "ipa": "",
    "ex": "You can sign the contract electronically using a digital signature.",
    "ex2": "Digital signatures are now widely accepted as legally binding in most business transactions."
  },
  {
    "word": "access code",
    "zh": "访问码",
    "pos": "n.",
    "ipa": "",
    "ex": "I'll send you the access code for the online meeting room.",
    "ex2": "Each participant received a unique access code to log into the secure virtual conference room."
  },
  {
    "word": "RSVP",
    "zh": "请回复 / Répondez s'il vous plaît",
    "pos": "v./n.",
    "ipa": "",
    "ex": "Please RSVP by Friday so we can confirm the catering numbers.",
    "ex2": "Over 150 guests had RSVPed by the deadline, making it the best-attended event of the year."
  },
  {
    "word": "dress smartly",
    "zh": "穿着得体",
    "pos": "phr.",
    "ipa": "",
    "ex": "Dress smartly for the interview—first impressions matter a lot.",
    "ex2": "All staff are expected to dress smartly when attending client-facing events or external meetings."
  },
  {
    "word": "punctuality",
    "zh": "守时",
    "pos": "n.",
    "ipa": "",
    "ex": "Punctuality is highly valued in a professional setting.",
    "ex2": "His punctuality was noted by the hiring manager as a sign of professionalism and reliability."
  },
  {
    "word": "etiquette",
    "zh": "礼仪",
    "pos": "n.",
    "ipa": "",
    "ex": "Familiarise yourself with local business etiquette before the trip.",
    "ex2": "Email etiquette varies across cultures, so it is important to adapt your tone accordingly."
  },
  {
    "word": "toast",
    "zh": "祝酒词 / 干杯",
    "pos": "n./v.",
    "ipa": "",
    "ex": "The host raised a glass and made a toast to the new partnership.",
    "ex2": "Everyone toasted the team's success at the farewell dinner before the project officially closed."
  },
  {
    "word": "host",
    "zh": "主人 / 东道主",
    "pos": "n.",
    "ipa": "",
    "ex": "Thank your host before leaving—a small note of thanks is always appreciated.",
    "ex2": "She hosted the annual conference for the third consecutive year and received glowing feedback."
  },
  {
    "word": "guest",
    "zh": "客人 / 嘉宾",
    "pos": "n.",
    "ipa": "",
    "ex": "We have several important guests arriving for the gala dinner tonight.",
    "ex2": "All guests were welcomed personally at the entrance and given a programme for the evening."
  },
  {
    "word": "networking event",
    "zh": "交流活动",
    "pos": "n.",
    "ipa": "",
    "ex": "I'll be attending a networking event for professionals in finance.",
    "ex2": "She made three valuable connections at the networking event that led to new business opportunities."
  },
  {
    "word": "break the ice",
    "zh": "打破僵局 / 活跃气氛",
    "pos": "phr.",
    "ipa": "",
    "ex": "A short game is a great way to break the ice at the start of a workshop.",
    "ex2": "He told a funny story about his first day at work to break the ice with the new team."
  },
  {
    "word": "first impression",
    "zh": "第一印象",
    "pos": "n.",
    "ipa": "",
    "ex": "A firm handshake and a warm smile make a strong first impression.",
    "ex2": "First impressions are formed within seconds, so how you present yourself matters enormously."
  },
  {
    "word": "polite",
    "zh": "礼貌的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Always be polite when dealing with difficult customers or situations.",
    "ex2": "She remained polite throughout the confrontation, which impressed everyone who witnessed it."
  },
  {
    "word": "respectful",
    "zh": "尊重他人的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Be respectful of different cultural norms when travelling abroad.",
    "ex2": "The team created a respectful and inclusive environment where every voice was heard."
  },
  {
    "word": "formal greeting",
    "zh": "正式问候",
    "pos": "n.",
    "ipa": "",
    "ex": "Use a formal greeting such as 'Good morning' in professional contexts.",
    "ex2": "He used a formal greeting in his email to the board, which set the right professional tone."
  },
  {
    "word": "solution",
    "zh": "解决方案",
    "pos": "n.",
    "ipa": "",
    "ex": "We need to find a workable solution before the client calls tomorrow.",
    "ex2": "Several solutions were proposed during the brainstorming session, each with different trade-offs."
  },
  {
    "word": "alternative",
    "zh": "替代方案",
    "pos": "n.",
    "ipa": "",
    "ex": "If that option isn't possible, what alternative can we offer?",
    "ex2": "The team explored several alternatives before settling on the most cost-effective approach."
  },
  {
    "word": "decision",
    "zh": "决定",
    "pos": "n.",
    "ipa": "",
    "ex": "A final decision must be made before we can move forward.",
    "ex2": "The decisions made during this meeting will affect the direction of the project for months."
  },
  {
    "word": "risk",
    "zh": "风险",
    "pos": "n.",
    "ipa": "",
    "ex": "Every new venture carries some level of financial risk.",
    "ex2": "The team assessed the risks carefully before recommending the most viable path forward."
  },
  {
    "word": "opportunity",
    "zh": "机会",
    "pos": "n.",
    "ipa": "",
    "ex": "This project is a great opportunity to showcase our capabilities.",
    "ex2": "She seized the opportunity to present her ideas directly to the senior leadership team."
  },
  {
    "word": "challenge",
    "zh": "挑战",
    "pos": "n.",
    "ipa": "",
    "ex": "Adapting to change is one of the biggest challenges in today's workplace.",
    "ex2": "The team faced multiple challenges but overcame them through effective collaboration and planning."
  },
  {
    "word": "trade-off",
    "zh": "权衡取舍",
    "pos": "n.",
    "ipa": "",
    "ex": "Every business decision involves a trade-off between cost and quality.",
    "ex2": "There are always trade-offs to consider when choosing between speed and thoroughness."
  },
  {
    "word": "compromise",
    "zh": "妥协 / 折中",
    "pos": "n./v.",
    "ipa": "",
    "ex": "Both sides reached a compromise that everyone could accept.",
    "ex2": "After hours of negotiation, they compromised on a solution that partially satisfied both parties."
  },
  {
    "word": "trial and error",
    "zh": "反复试错",
    "pos": "n.",
    "ipa": "",
    "ex": "Finding the best process often involves trial and error.",
    "ex2": "Through trial and error, the engineering team eventually found a configuration that worked reliably."
  },
  {
    "word": "root cause",
    "zh": "根本原因",
    "pos": "n.",
    "ipa": "",
    "ex": "We need to identify the root cause before proposing any fix.",
    "ex2": "The root causes of the delay were identified as poor communication and unclear task ownership."
  },
  {
    "word": "criteria",
    "zh": "标准 / 条件",
    "pos": "n.",
    "ipa": "",
    "ex": "What criteria will you use to evaluate the different suppliers?",
    "ex2": "The selection criteria were shared with all applicants in advance to ensure a fair process."
  },
  {
    "word": "outcome",
    "zh": "结果 / 成果",
    "pos": "n.",
    "ipa": "",
    "ex": "The outcome of the negotiation was better than we expected.",
    "ex2": "The outcomes of the training programme were evaluated six months after it was completed."
  },
  {
    "word": "workaround",
    "zh": "临时解决方案",
    "pos": "n.",
    "ipa": "",
    "ex": "We found a workaround while the IT team fixes the main system bug.",
    "ex2": "The team devised a workaround that allowed them to continue working while the system was restored."
  },
  {
    "word": "escalate",
    "zh": "升级 / 上报",
    "pos": "v.",
    "ipa": "",
    "ex": "If you can't resolve it yourself, escalate the issue to your manager.",
    "ex2": "The complaint was escalated to senior management after the initial response failed to satisfy the client."
  },
  {
    "word": "initiative",
    "zh": "主动 / 倡议",
    "pos": "n.",
    "ipa": "",
    "ex": "Taking initiative and proposing ideas sets you apart from your peers.",
    "ex2": "Several new initiatives were launched to improve staff wellbeing and reduce employee turnover."
  },
  {
    "word": "pay attention",
    "zh": "注意 / 留心",
    "pos": "phr.",
    "ipa": "",
    "ex": "Pay attention to the details—they matter in a professional context.",
    "ex2": "She paid close attention to the client's tone during the call and adjusted her approach accordingly."
  },
  {
    "word": "take notes",
    "zh": "做笔记",
    "pos": "phr.",
    "ipa": "",
    "ex": "Take notes during the meeting so you don't forget any action items.",
    "ex2": "He had been taking detailed notes throughout the training that proved invaluable when reviewing later."
  },
  {
    "word": "double-check",
    "zh": "再次核实",
    "pos": "v.",
    "ipa": "",
    "ex": "Always double-check the figures before sending the report to the client.",
    "ex2": "She double-checked every line of the contract before it was sent to the legal team for review."
  },
  {
    "word": "proofread",
    "zh": "校对",
    "pos": "v.",
    "ipa": "",
    "ex": "Proofread your email carefully before clicking send.",
    "ex2": "The document was proofread by two editors before being submitted to the publishing house."
  },
  {
    "word": "catch up on",
    "zh": "赶上 / 补上",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "I need to catch up on my emails after being away all week.",
    "ex2": "She spent the first morning back catching up on the messages and updates she had missed."
  },
  {
    "word": "print out",
    "zh": "打印",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "Print out three copies of the contract for all parties to sign.",
    "ex2": "He printed out all the supporting documents and brought them to the meeting just in case."
  },
  {
    "word": "fill in",
    "zh": "填写",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "Please fill in your personal details on the top of the form.",
    "ex2": "All candidates were asked to fill in a short questionnaire before the interview began."
  },
  {
    "word": "sign off",
    "zh": "批准 / 签字",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "The manager needs to sign off on any expense above 5,000 yuan.",
    "ex2": "The project cannot proceed until the board has signed off on the revised budget proposal."
  },
  {
    "word": "hand in",
    "zh": "提交 / 上交",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "Hand in your completed form at the reception desk on the ground floor.",
    "ex2": "She handed in her resignation letter after accepting an exciting offer from a competitor."
  },
  {
    "word": "look into",
    "zh": "调查 / 研究",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "I'll look into the issue and get back to you by end of day.",
    "ex2": "The compliance team has been looking into the irregularities flagged in last month's audit report."
  },
  {
    "word": "sort out",
    "zh": "解决 / 整理",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "Can you sort out the scheduling conflict before Monday's meeting?",
    "ex2": "It took several calls and emails before the billing issue was finally sorted out."
  },
  {
    "word": "narrow down",
    "zh": "缩小范围",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "Let's narrow down the candidate list to five finalists.",
    "ex2": "After reviewing all submissions, the panel narrowed down their options to just three proposals."
  },
  {
    "word": "back up",
    "zh": "备份 / 支持",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "Always back up your work before updating the software.",
    "ex2": "She backed up all her files to an external drive before handing in her work laptop."
  },
  {
    "word": "stand out",
    "zh": "脱颖而出",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "Her creative approach helped her stand out from 200 applicants.",
    "ex2": "His attention to detail and proactive attitude made him stand out during the probation period."
  },
  {
    "word": "kick off",
    "zh": "启动 / 开始",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "We'll kick off the project with a planning session on Monday.",
    "ex2": "The campaign was kicked off with a live event that attracted significant media coverage."
  },
  {
    "word": "roll out",
    "zh": "推出 / 推广",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "We plan to roll out the new feature to all users next month.",
    "ex2": "The updated training programme has already been rolled out across all regional offices."
  },
  {
    "word": "phase out",
    "zh": "逐步淘汰",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "The old system will be phased out over the next six months.",
    "ex2": "Single-use plastic packaging is being phased out across all product lines by the end of the year."
  },
  {
    "word": "opt in",
    "zh": "选择加入",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "Users must opt in to receive promotional emails from us.",
    "ex2": "Over 80% of customers opted in to the loyalty programme when it was relaunched last autumn."
  },
  {
    "word": "opt out",
    "zh": "选择退出",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "You can opt out of the mailing list at any time.",
    "ex2": "Staff who opted out of the survey were not penalised, but their feedback was still welcomed."
  },
  {
    "word": "scale up",
    "zh": "扩大规模",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "Once the pilot succeeds, we'll scale up operations nationally.",
    "ex2": "The startup scaled up rapidly after securing a major investment from a venture capital firm."
  },
  {
    "word": "take over",
    "zh": "接管 / 接手",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "She'll take over the project while I'm on maternity leave.",
    "ex2": "He took over as head of department after the previous director left for a role overseas."
  },
  {
    "word": "pass on",
    "zh": "传达 / 转告",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "Please pass on my congratulations to the whole team.",
    "ex2": "She passed on the client's feedback to the design team so they could make the necessary changes."
  },
  {
    "word": "draw up",
    "zh": "起草 / 制定",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "The legal team will draw up the agreement by tomorrow.",
    "ex2": "They drew up a detailed plan of action before presenting the proposal to the steering committee."
  },
  {
    "word": "agree on",
    "zh": "就…达成一致",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "We need to agree on a timeline before the project can begin.",
    "ex2": "After two rounds of discussion, both teams agreed on a set of shared goals and deliverables."
  },
  {
    "word": "rely on",
    "zh": "依赖",
    "pos": "phr.v.",
    "ipa": "",
    "ex": "We rely on your team to deliver accurate data each week.",
    "ex2": "The entire supply chain relies on the warehouse team to meet daily dispatch targets."
  },
  {
    "word": "apologise for",
    "zh": "为…道歉",
    "pos": "phr.",
    "ipa": "",
    "ex": "I sincerely apologise for any inconvenience this has caused.",
    "ex2": "The company apologised publicly for the data breach and outlined steps to prevent future incidents."
  },
  {
    "word": "be responsible for",
    "zh": "负责",
    "pos": "phr.",
    "ipa": "",
    "ex": "Each team leader is responsible for their own department's results.",
    "ex2": "She has been responsible for overseeing all partnerships with external vendors and agencies."
  },
  {
    "word": "be in charge of",
    "zh": "主管 / 负责",
    "pos": "phr.",
    "ipa": "",
    "ex": "She is in charge of all communications with international clients.",
    "ex2": "He was put in charge of organising the company's annual conference for the first time."
  },
  {
    "word": "take responsibility",
    "zh": "承担责任",
    "pos": "phr.",
    "ipa": "",
    "ex": "A good leader takes responsibility when things go wrong.",
    "ex2": "She took full responsibility for the error and proposed a clear plan to prevent it recurring."
  },
  {
    "word": "meet a deadline",
    "zh": "按期完成",
    "pos": "phr.",
    "ipa": "",
    "ex": "We always meet our deadlines—client trust depends on it.",
    "ex2": "Despite unexpected technical issues, the team met all their deadlines throughout the quarter."
  },
  {
    "word": "exceed expectations",
    "zh": "超出预期",
    "pos": "phr.",
    "ipa": "",
    "ex": "The final result exceeded all our expectations—well done team!",
    "ex2": "Her performance consistently exceeded expectations and she was fast-tracked for a promotion."
  },
  {
    "word": "fall short",
    "zh": "未达到目标",
    "pos": "phr.",
    "ipa": "",
    "ex": "Unfortunately, sales fell short of our Q3 targets by 8%.",
    "ex2": "The campaign fell short of its awareness targets, prompting a review of the strategy."
  },
  {
    "word": "on a tight budget",
    "zh": "预算有限",
    "pos": "phr.",
    "ipa": "",
    "ex": "We need a creative solution—we're working on a very tight budget.",
    "ex2": "Even on a tight budget, they delivered a polished and professional event that impressed the client."
  },
  {
    "word": "within budget",
    "zh": "在预算范围内",
    "pos": "phr.",
    "ipa": "",
    "ex": "The project was completed on time and within budget.",
    "ex2": "All departments were asked to stay within budget by cutting unnecessary discretionary spending."
  },
  {
    "word": "cost-effective",
    "zh": "性价比高的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Email marketing is one of the most cost-effective channels available.",
    "ex2": "The new supplier proved to be far more cost-effective without compromising on product quality."
  },
  {
    "word": "time-consuming",
    "zh": "耗时的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Manual data entry is time-consuming—we should automate it.",
    "ex2": "The approval process was unnecessarily time-consuming and has since been streamlined significantly."
  },
  {
    "word": "state-of-the-art",
    "zh": "最先进的",
    "pos": "adj.",
    "ipa": "",
    "ex": "The new facility is equipped with state-of-the-art technology.",
    "ex2": "The hospital's state-of-the-art diagnostic equipment has significantly improved patient outcomes."
  },
  {
    "word": "user-friendly",
    "zh": "易于使用的",
    "pos": "adj.",
    "ipa": "",
    "ex": "The app has a clean, user-friendly interface that anyone can navigate.",
    "ex2": "Making the platform more user-friendly reduced the number of support calls by over forty percent."
  },
  {
    "word": "cutting-edge",
    "zh": "前沿的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Our R&D team develops cutting-edge solutions for the healthcare sector.",
    "ex2": "The laboratory houses some of the most cutting-edge research equipment in the country."
  },
  {
    "word": "up to date",
    "zh": "最新的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Please make sure all your certifications are up to date.",
    "ex2": "The report needs to be completely up to date before it is presented to the board on Friday."
  },
  {
    "word": "out of date",
    "zh": "过时的",
    "pos": "adj.",
    "ipa": "",
    "ex": "This pricing information is out of date—please check the latest rates.",
    "ex2": "The training materials were out of date and had to be revised before the new cohort arrived."
  },
  {
    "word": "high-quality",
    "zh": "高质量的",
    "pos": "adj.",
    "ipa": "",
    "ex": "We are committed to delivering high-quality products at fair prices.",
    "ex2": "Consistently high-quality output has helped the company build a strong reputation in its sector."
  },
  {
    "word": "on a large scale",
    "zh": "大规模地",
    "pos": "phr.",
    "ipa": "",
    "ex": "The programme will be rolled out on a large scale starting next year.",
    "ex2": "The technology has now been deployed on a large scale across multiple industries worldwide."
  },
  {
    "word": "trial period",
    "zh": "试用期",
    "pos": "n.",
    "ipa": "",
    "ex": "There's a 30-day trial period so you can test all premium features.",
    "ex2": "Both the employer and new employee found the three-month trial period mutually beneficial."
  },
  {
    "word": "pilot project",
    "zh": "试点项目",
    "pos": "n.",
    "ipa": "",
    "ex": "We launched a pilot project in three cities before going national.",
    "ex2": "The pilot project delivered promising results and has been approved for full nationwide expansion."
  },
  {
    "word": "case study",
    "zh": "案例研究",
    "pos": "n.",
    "ipa": "",
    "ex": "The consultant shared a detailed case study from a similar industry.",
    "ex2": "Business school students were asked to analyse three case studies and present their findings."
  },
  {
    "word": "best practice",
    "zh": "最佳实践",
    "pos": "n.",
    "ipa": "",
    "ex": "Following industry best practices reduces errors and saves time.",
    "ex2": "The report outlined best practices for managing remote teams across different time zones."
  },
  {
    "word": "lesson learned",
    "zh": "经验教训",
    "pos": "n.",
    "ipa": "",
    "ex": "Document the lessons learned so the next team can avoid the same issues.",
    "ex2": "A formal review of the project's lessons learned was conducted at the closing meeting."
  },
  {
    "word": "key takeaway",
    "zh": "核心收获",
    "pos": "n.",
    "ipa": "",
    "ex": "The key takeaway from this report is that we need to invest in training.",
    "ex2": "She summarised the key takeaways from the conference in a brief email to her entire team."
  },
  {
    "word": "pro",
    "zh": "优点 / 专业人士",
    "pos": "n.",
    "ipa": "",
    "ex": "List all the pros and cons before making your final decision.",
    "ex2": "One of the main pros of working remotely is the flexibility it gives employees over their schedule."
  },
  {
    "word": "con",
    "zh": "缺点",
    "pos": "n.",
    "ipa": "",
    "ex": "One major con of this approach is the high upfront cost.",
    "ex2": "The cons of the proposal outweighed the benefits, so the board decided not to proceed."
  },
  {
    "word": "short-term",
    "zh": "短期的",
    "pos": "adj.",
    "ipa": "",
    "ex": "We need a short-term fix while we work on the long-term solution.",
    "ex2": "Short-term gains should not come at the expense of long-term sustainability and reputation."
  },
  {
    "word": "long-term",
    "zh": "长期的",
    "pos": "adj.",
    "ipa": "",
    "ex": "Our long-term goal is to become the market leader in this segment.",
    "ex2": "Investing in staff development has proven to deliver significant long-term benefits for the company."
  },
  {
    "word": "hands-on",
    "zh": "实践性的 / 亲力亲为",
    "pos": "adj.",
    "ipa": "",
    "ex": "The training is very hands-on, with plenty of real-world practice.",
    "ex2": "She prefers a more hands-on management style and regularly works alongside her team on projects."
  },
  {
    "word": "bottom-up",
    "zh": "自下而上",
    "pos": "adj.",
    "ipa": "",
    "ex": "We use a bottom-up approach to gather ideas from every level of staff.",
    "ex2": "The bottom-up budgeting process ensured that all departments had ownership over their own figures."
  },
  {
    "word": "top-down",
    "zh": "自上而下",
    "pos": "adj.",
    "ipa": "",
    "ex": "The top-down directive came from the CEO and applies to all divisions.",
    "ex2": "The top-down restructuring affected every level of the organisation from management to operations."
  },
  {
    "word": "know-how",
    "zh": "专业知识 / 诀窍",
    "pos": "n.",
    "ipa": "",
    "ex": "We value candidates who bring industry know-how and fresh ideas.",
    "ex2": "The firm's technical know-how has been built up over more than thirty years in the industry."
  },
  {
    "word": "turnaround",
    "zh": "好转 / 周转时间",
    "pos": "n.",
    "ipa": "",
    "ex": "The typical turnaround for a visa application is five working days.",
    "ex2": "The company achieved a remarkable turnaround after appointing a new CEO and restructuring the team."
  },
  {
    "word": "backlog",
    "zh": "积压工作",
    "pos": "n.",
    "ipa": "",
    "ex": "We have a large backlog of support tickets to work through this week.",
    "ex2": "The team worked overtime for two weeks to clear the backlog that had built up during the outage."
  },
  {
    "word": "bandwidth",
    "zh": "精力 / 带宽",
    "pos": "n.",
    "ipa": "",
    "ex": "I don't have the bandwidth to take on another project right now.",
    "ex2": "The team simply doesn't have the bandwidth to deliver three major projects at the same time."
  },
  {
    "word": "pick up the slack",
    "zh": "补位 / 弥补不足",
    "pos": "phr.",
    "ipa": "",
    "ex": "The team stepped up to pick up the slack while she was on sick leave.",
    "ex2": "When two colleagues left at the same time, the remaining staff had to pick up the slack."
  },
  {
    "word": "be on the same page",
    "zh": "达成共识 / 步调一致",
    "pos": "phr.",
    "ipa": "",
    "ex": "Before we start, let's make sure we're all on the same page.",
    "ex2": "Regular check-ins help ensure the whole team stays on the same page throughout a long project."
  },
  {
    "word": "circle back",
    "zh": "稍后再议",
    "pos": "phr.",
    "ipa": "",
    "ex": "Let's circle back to this issue once we have more information.",
    "ex2": "They tabled the contentious point and agreed to circle back after gathering more data."
  },
  {
    "word": "move the needle",
    "zh": "取得进展 / 有所突破",
    "pos": "phr.",
    "ipa": "",
    "ex": "We need a bold campaign to really move the needle on brand awareness.",
    "ex2": "Despite significant investment, the initiative failed to move the needle on customer retention."
  },
  {
    "word": "deep dive",
    "zh": "深入分析",
    "pos": "n.",
    "ipa": "",
    "ex": "Let's do a deep dive into the data before making any assumptions.",
    "ex2": "She conducted a deep dive into the competitor landscape before presenting her recommendations."
  },
  {
    "word": "pain point",
    "zh": "痛点",
    "pos": "n.",
    "ipa": "",
    "ex": "Identify your customers' pain points and solve them better than anyone else.",
    "ex2": "The survey revealed several key pain points that had been preventing users from completing sign-up."
  },
  {
    "word": "value proposition",
    "zh": "价值主张",
    "pos": "n.",
    "ipa": "",
    "ex": "Your value proposition must clearly explain why customers should choose you.",
    "ex2": "A compelling value proposition differentiates your product from competitors and drives conversions."
  },
  {
    "word": "fair enough",
    "zh": "说得过去 / 行吧",
    "pos": "expr",
    "ipa": "",
    "ex": "Fair enough—I can see why you'd rather wait until Monday.",
    "ex2": "Fair enough, I wasn't there so I can't really argue with your version of events."
  },
  {
    "word": "totally",
    "zh": "完全正确 / 太对了",
    "pos": "adv",
    "ipa": "",
    "ex": "Totally—that's exactly how I feel about the whole situation.",
    "ex2": "I'm totally with you on this one; the new design is far better than the old one."
  },
  {
    "word": "absolutely",
    "zh": "当然 / 绝对是",
    "pos": "adv",
    "ipa": "",
    "ex": "Absolutely! We should book the restaurant before all the good slots are taken.",
    "ex2": "She was absolutely right about the timeline—we should have started planning much earlier."
  },
  {
    "word": "for sure",
    "zh": "当然 / 肯定的",
    "pos": "expr",
    "ipa": "",
    "ex": "For sure, I'll be there by seven—don't worry at all.",
    "ex2": "You can count on her for sure; she's never once let the team down when it really mattered."
  },
  {
    "word": "no kidding",
    "zh": "不是开玩笑吧 / 真的假的",
    "pos": "expr",
    "ipa": "",
    "ex": "No kidding? She quit her job and moved to another country just like that?",
    "ex2": "No kidding—he finished the whole project in one night and still showed up on time the next morning."
  },
  {
    "word": "seriously?",
    "zh": "认真的吗？/ 真的？",
    "pos": "expr",
    "ipa": "",
    "ex": "Seriously? They cancelled the whole event the day before it was supposed to happen?",
    "ex2": "Seriously? You're telling me the system went down again—that's the third time this week!"
  },
  {
    "word": "no way",
    "zh": "不可能 / 绝对不行",
    "pos": "expr",
    "ipa": "",
    "ex": "No way—I'm not accepting those terms; they're completely unreasonable.",
    "ex2": "No way is she going to agree to that timeline. It's not realistic at all."
  },
  {
    "word": "come on",
    "zh": "得了吧 / 快点 / 拜托",
    "pos": "expr",
    "ipa": "",
    "ex": "Come on, give it a try—you'll regret it if you don't even attempt it.",
    "ex2": "Come on, we've been waiting for over an hour. Can we please make a decision now?"
  },
  {
    "word": "give me a break",
    "zh": "饶了我吧 / 得了吧",
    "pos": "expr",
    "ipa": "",
    "ex": "Give me a break—I've been working non-stop since six in the morning.",
    "ex2": "Give me a break! Do you really expect me to finish all of this before noon?"
  },
  {
    "word": "tell me about it",
    "zh": "可不是嘛 / 我深有同感",
    "pos": "expr",
    "ipa": "",
    "ex": "Tell me about it—the traffic was absolutely terrible on the way in today.",
    "ex2": "'The report took forever to load.' 'Tell me about it—I've been having the same problem all week.'"
  },
  {
    "word": "same here",
    "zh": "我也是 / 同感",
    "pos": "expr",
    "ipa": "",
    "ex": "Same here—I haven't had a good night's sleep all week either.",
    "ex2": "'I can't believe how quickly time has passed this year.' 'Same here—it's already November!'"
  },
  {
    "word": "I hear you",
    "zh": "我理解你 / 我明白你的意思",
    "pos": "expr",
    "ipa": "",
    "ex": "I hear you—it's been a really tough month for everyone on the team.",
    "ex2": "I hear you, and I want you to know we're going to do everything we can to fix this."
  },
  {
    "word": "you're telling me",
    "zh": "可不是嘛 / 你说的太对了",
    "pos": "expr",
    "ipa": "",
    "ex": "'The new software is so slow.' 'You're telling me—it takes five minutes just to open.'",
    "ex2": "'This project has been more stressful than expected.' 'You're telling me—I've barely slept.'"
  },
  {
    "word": "oh my goodness",
    "zh": "天哪 / 我的天",
    "pos": "expr",
    "ipa": "",
    "ex": "Oh my goodness, I completely forgot we had a meeting this afternoon!",
    "ex2": "Oh my goodness—I just found out they've offered her a position she's been dreaming of for years!"
  },
  {
    "word": "sounds good",
    "zh": "听起来不错 / 好的",
    "pos": "expr",
    "ipa": "",
    "ex": "Sounds good—let's say Tuesday at 3 p.m. then.",
    "ex2": "'Can we review the draft together before sending it?' 'Sounds good—I'll send the invite now.'"
  },
  {
    "word": "sounds like a plan",
    "zh": "听起来是个好主意 / 就这么定了",
    "pos": "expr",
    "ipa": "",
    "ex": "Sounds like a plan—I'll book the venue and you handle the invitations.",
    "ex2": "'Let's meet first, go over the data, then prepare the report.' 'Sounds like a plan—I'm in.'"
  },
  {
    "word": "works for me",
    "zh": "我没问题 / 可以",
    "pos": "expr",
    "ipa": "",
    "ex": "Works for me—Thursday morning is completely free, so let's do it then.",
    "ex2": "'Would it be okay to push the deadline to Friday?' 'Works for me—that actually gives us more time.'"
  },
  {
    "word": "I'm down",
    "zh": "我愿意 / 我参加",
    "pos": "expr",
    "ipa": "",
    "ex": "I'm down for a hike on Saturday—what time are we meeting?",
    "ex2": "Karaoke after dinner? I'm totally down—I've been wanting to do that for months!"
  },
  {
    "word": "I'm in",
    "zh": "算我一个 / 我参与",
    "pos": "expr",
    "ipa": "",
    "ex": "I'm in—this project sounds exciting and I want to be part of it.",
    "ex2": "If you're going to challenge the decision, I'm in—we shouldn't have to accept it."
  },
  {
    "word": "count me in",
    "zh": "把我算进去 / 我要参加",
    "pos": "expr",
    "ipa": "",
    "ex": "Count me in for the team dinner on Friday—I wouldn't miss it!",
    "ex2": "Count me in for the charity run next month; I've been looking for a reason to start training."
  },
  {
    "word": "I'm on it",
    "zh": "我来处理 / 我去办",
    "pos": "expr",
    "ipa": "",
    "ex": "I'm on it—I'll have the report ready before the end of the morning.",
    "ex2": "'Can someone check the system error?' 'I'm on it—give me fifteen minutes.'"
  },
  {
    "word": "got it",
    "zh": "明白了 / 好的",
    "pos": "expr",
    "ipa": "",
    "ex": "Got it—I'll send the updated version to the client before end of day.",
    "ex2": "'Make sure you include all the supporting data in the appendix.' 'Got it, I'll add it now.'"
  },
  {
    "word": "will do",
    "zh": "好的，我会的 / 没问题",
    "pos": "expr",
    "ipa": "",
    "ex": "'Please copy everyone on the email chain.' 'Will do—I'll include them all.'",
    "ex2": "'Double-check the figures before you submit.' 'Will do—I'll go through everything twice.'"
  },
  {
    "word": "noted",
    "zh": "已记下 / 收到",
    "pos": "expr",
    "ipa": "",
    "ex": "Noted—I'll make sure the changes are included in the next version.",
    "ex2": "'Please avoid scheduling calls after 5 p.m.' 'Noted—I'll keep that in mind going forward.'"
  },
  {
    "word": "I'm not so sure",
    "zh": "我不太确定 / 我有点怀疑",
    "pos": "expr",
    "ipa": "",
    "ex": "I'm not so sure that's the best approach—have we considered the alternatives?",
    "ex2": "'I think we should go ahead without testing it further.' 'I'm not so sure—that could be risky.'"
  },
  {
    "word": "that said",
    "zh": "话虽如此 / 尽管如此",
    "pos": "expr",
    "ipa": "",
    "ex": "It's a challenging market. That said, there are still real opportunities for growth.",
    "ex2": "The budget is tight this quarter. That said, I believe we can still deliver the key objectives."
  },
  {
    "word": "with all due respect",
    "zh": "冒昧说一句 / 恕我直言",
    "pos": "expr",
    "ipa": "",
    "ex": "With all due respect, I think we're missing a critical point in this analysis.",
    "ex2": "With all due respect, the data doesn't support the conclusion you've drawn from it."
  },
  {
    "word": "if you ask me",
    "zh": "依我看 / 我觉得",
    "pos": "expr",
    "ipa": "",
    "ex": "If you ask me, we should have launched the product two months ago.",
    "ex2": "If you ask me, the real problem isn't the budget—it's the lack of clear ownership."
  },
  {
    "word": "I see your point",
    "zh": "我理解你的意思",
    "pos": "expr",
    "ipa": "",
    "ex": "I see your point, but I still think we need more data before deciding.",
    "ex2": "I see your point about the risks—that's exactly why I want to run a small test first."
  },
  {
    "word": "can you elaborate",
    "zh": "能详细说说吗",
    "pos": "expr",
    "ipa": "",
    "ex": "Can you elaborate on what you mean by 'restructuring the team'?",
    "ex2": "That's an interesting perspective—can you elaborate a little more so we can fully understand it?"
  },
  {
    "word": "what are you getting at",
    "zh": "你想说的是什么意思",
    "pos": "expr",
    "ipa": "",
    "ex": "I'm not following you—what are you getting at exactly?",
    "ex2": "She smiled and asked, 'I appreciate the story, but what are you getting at?'"
  },
  {
    "word": "come again?",
    "zh": "再说一遍？/ 什么？",
    "pos": "expr",
    "ipa": "",
    "ex": "Come again? I didn't quite catch what you said at the end of that sentence.",
    "ex2": "'He said he's not attending.' 'Come again? He confirmed just this morning that he would be there.'"
  },
  {
    "word": "bear with me",
    "zh": "请耐心等一下 / 稍等",
    "pos": "expr",
    "ipa": "",
    "ex": "Bear with me for a second—I just need to pull up the right file.",
    "ex2": "Bear with me while I walk you through the numbers—there's a lot to cover but it's worth it."
  },
  {
    "word": "all of a sudden",
    "zh": "突然之间 / 猛然",
    "pos": "expr",
    "ipa": "",
    "ex": "All of a sudden, the lights went out and the whole office fell silent.",
    "ex2": "She had been perfectly fine all morning, and then all of a sudden she felt very unwell."
  },
  {
    "word": "out of the blue",
    "zh": "突如其来 / 出乎意料",
    "pos": "expr",
    "ipa": "",
    "ex": "Out of the blue, he received an email from an old friend he hadn't heard from in years.",
    "ex2": "She called out of the blue and offered me the exact role I had been hoping for."
  },
  {
    "word": "sooner or later",
    "zh": "迟早 / 早晚",
    "pos": "expr",
    "ipa": "",
    "ex": "Sooner or later, we'll need to address the inefficiencies in the current process.",
    "ex2": "Sooner or later, companies that ignore customer feedback will start to lose market share."
  },
  {
    "word": "at some point",
    "zh": "在某个时候 / 总有一天",
    "pos": "expr",
    "ipa": "",
    "ex": "At some point, we'll need to have an honest conversation about the direction of the project.",
    "ex2": "At some point during the negotiation, it became clear that the two sides were far apart."
  },
  {
    "word": "from now on",
    "zh": "从现在起 / 今后",
    "pos": "expr",
    "ipa": "",
    "ex": "From now on, please cc the whole team on any communications with the client.",
    "ex2": "From now on, all requests for time off must be submitted at least two weeks in advance."
  },
  {
    "word": "moving forward",
    "zh": "今后 / 往前走（下一步）",
    "pos": "expr",
    "ipa": "",
    "ex": "Moving forward, we'll hold weekly check-ins to track progress more closely.",
    "ex2": "Moving forward, the team has agreed to document all decisions made in meetings for accountability."
  },
  {
    "word": "down the road",
    "zh": "将来 / 以后",
    "pos": "expr",
    "ipa": "",
    "ex": "Down the road, this investment will pay off significantly for the whole organisation.",
    "ex2": "The decisions we make now could have serious consequences down the road if we're not careful."
  },
  {
    "word": "for the time being",
    "zh": "暂时 / 目前",
    "pos": "expr",
    "ipa": "",
    "ex": "For the time being, let's stick with the current system until the new one is ready.",
    "ex2": "For the time being, the two teams will work separately but will merge later in the project."
  },
  {
    "word": "on second thought",
    "zh": "再想想 / 转念一想",
    "pos": "expr",
    "ipa": "",
    "ex": "On second thought, maybe we should get a second opinion before committing to this.",
    "ex2": "She was about to agree, but on second thought, she decided to sleep on it before responding."
  },
  {
    "word": "in hindsight",
    "zh": "事后回想 / 回头看",
    "pos": "expr",
    "ipa": "",
    "ex": "In hindsight, we should have tested the system much more thoroughly before the launch.",
    "ex2": "In hindsight, the early warning signs were there—we just didn't pay enough attention to them."
  },
  {
    "word": "it's up to you",
    "zh": "看你的 / 由你决定",
    "pos": "expr",
    "ipa": "",
    "ex": "It's up to you—both options are valid and either one could work well.",
    "ex2": "Ultimately, it's up to you to decide which path forward best aligns with your goals."
  },
  {
    "word": "either way",
    "zh": "不管怎样 / 两种情况都一样",
    "pos": "expr",
    "ipa": "",
    "ex": "Either way, we need to give the client an answer by tomorrow morning.",
    "ex2": "Either way you look at it, the outcome is the same—we need to act now."
  },
  {
    "word": "no matter what",
    "zh": "不管怎样 / 无论如何",
    "pos": "expr",
    "ipa": "",
    "ex": "No matter what, we need to deliver on this promise to the client.",
    "ex2": "She was determined to finish the project no matter what obstacles came her way."
  },
  {
    "word": "regardless",
    "zh": "不管 / 无论如何",
    "pos": "adv",
    "ipa": "",
    "ex": "Regardless of the outcome, the effort and dedication you showed were outstanding.",
    "ex2": "The event will go ahead regardless of the weather forecast or how many people attend."
  },
  {
    "word": "in any case",
    "zh": "无论如何 / 不管怎样",
    "pos": "expr",
    "ipa": "",
    "ex": "In any case, we should have a backup plan ready before the presentation.",
    "ex2": "In any case, let's make sure all the materials are prepared well before the deadline."
  },
  {
    "word": "as it turns out",
    "zh": "结果发现 / 事实上",
    "pos": "expr",
    "ipa": "",
    "ex": "As it turns out, the original estimate was actually much closer to accurate than we thought.",
    "ex2": "As it turns out, the supplier she found was far more competitive than any of the others we contacted."
  },
  {
    "word": "believe it or not",
    "zh": "信不信由你 / 你可能不信",
    "pos": "expr",
    "ipa": "",
    "ex": "Believe it or not, she finished the whole report in less than three hours.",
    "ex2": "Believe it or not, the project that everyone said was impossible was completed ahead of schedule."
  },
  {
    "word": "under the circumstances",
    "zh": "在这种情况下 / 考虑到情况",
    "pos": "expr",
    "ipa": "",
    "ex": "Under the circumstances, I think a one-week extension is entirely reasonable.",
    "ex2": "Under the circumstances, the team performed remarkably well despite the pressure and resource constraints."
  },
  {
    "word": "it varies",
    "zh": "情况不同 / 因情况而定",
    "pos": "expr",
    "ipa": "",
    "ex": "'How long does the process take?' 'It varies—usually between two and five working days.'",
    "ex2": "The response time varies depending on how complex the query is and how busy the team is."
  },
  {
    "word": "out of curiosity",
    "zh": "出于好奇 / 随便问问",
    "pos": "expr",
    "ipa": "",
    "ex": "Out of curiosity, how did you find out about this position in the first place?",
    "ex2": "Out of curiosity, what made you decide to change careers after so many years in the same field?"
  },
  {
    "word": "the way I see it",
    "zh": "在我看来 / 我的看法是",
    "pos": "expr",
    "ipa": "",
    "ex": "The way I see it, we have two strong options and both are worth exploring.",
    "ex2": "The way I see it, the real opportunity here is to capture a market that our competitors have ignored."
  },
  {
    "word": "to be fair",
    "zh": "说句公道话 / 平心而论",
    "pos": "expr",
    "ipa": "",
    "ex": "To be fair, it was a very difficult situation and she handled it as well as anyone could.",
    "ex2": "To be fair, the team was given very little time and very limited resources to work with."
  },
  {
    "word": "to be clear",
    "zh": "说清楚一点 / 明确一下",
    "pos": "expr",
    "ipa": "",
    "ex": "To be clear, this is a voluntary programme—no one is required to participate.",
    "ex2": "To be clear, the deadline has not changed and all deliverables are still expected on Friday."
  },
  {
    "word": "to put it simply",
    "zh": "简单来说 / 说白了",
    "pos": "expr",
    "ipa": "",
    "ex": "To put it simply, we spent more than we earned this quarter and that needs to change.",
    "ex2": "To put it simply, the system works by automatically syncing your data across all your devices."
  },
  {
    "word": "personally speaking",
    "zh": "就我个人而言 / 我个人认为",
    "pos": "expr",
    "ipa": "",
    "ex": "Personally speaking, I think the second proposal is the stronger and more innovative of the two.",
    "ex2": "Personally speaking, I've always believed that good communication is the foundation of every successful team."
  },
  {
    "word": "speaking of which",
    "zh": "说到这个 / 提到这里",
    "pos": "expr",
    "ipa": "",
    "ex": "Speaking of which, did you send the follow-up email to the client after yesterday's call?",
    "ex2": "We were just talking about the conference, and speaking of which, have you registered yet?"
  },
  {
    "word": "come to think of it",
    "zh": "这么一说 / 仔细想想",
    "pos": "expr",
    "ipa": "",
    "ex": "Come to think of it, I haven't heard back from them since last Thursday.",
    "ex2": "Come to think of it, she mentioned something similar at the team meeting two weeks ago."
  },
  {
    "word": "now that you mention it",
    "zh": "你这么一说 / 既然你提到了",
    "pos": "expr",
    "ipa": "",
    "ex": "Now that you mention it, I did notice the system running slower than usual this morning.",
    "ex2": "Now that you mention it, I recall seeing a similar issue flagged in the report from last quarter."
  },
  {
    "word": "keep that in mind",
    "zh": "记住这一点 / 把这个放心上",
    "pos": "expr",
    "ipa": "",
    "ex": "Keep that in mind when you're writing the proposal—tone matters as much as content.",
    "ex2": "It's a tight deadline, so keep that in mind when prioritising which tasks to tackle first."
  },
  {
    "word": "what's up",
    "zh": "怎么了 / 最近咋样",
    "pos": "expr",
    "ipa": "",
    "ex": "Hey, what's up? You look like you've had a rough day—everything okay?",
    "ex2": "She walked over to his desk and said, 'What's up? You've been staring at that screen for hours.'"
  },
  {
    "word": "what's going on",
    "zh": "发生什么了 / 最近怎么样",
    "pos": "expr",
    "ipa": "",
    "ex": "What's going on? Why is everyone gathered around the conference room?",
    "ex2": "She called to check in and asked, 'What's going on over there? We heard there's an issue.'"
  },
  {
    "word": "how's it going",
    "zh": "最近怎么样 / 还好吗",
    "pos": "expr",
    "ipa": "",
    "ex": "How's it going? Haven't seen you in a while—is everything good?",
    "ex2": "He bumped into an old colleague and asked, 'How's it going? Still working at the same place?'"
  },
  {
    "word": "long time no see",
    "zh": "好久不见",
    "pos": "expr",
    "ipa": "",
    "ex": "Long time no see! How have you been? It must be nearly two years now!",
    "ex2": "They ran into each other at the trade fair and she laughed, 'Long time no see—you haven't changed a bit!'"
  },
  {
    "word": "good to see you",
    "zh": "很高兴见到你",
    "pos": "expr",
    "ipa": "",
    "ex": "Good to see you! I'm glad you could make it to the event this evening.",
    "ex2": "He shook her hand warmly and said, 'It's so good to see you after all this time apart.'"
  },
  {
    "word": "have a good one",
    "zh": "祝你过得好 / 保重",
    "pos": "expr",
    "ipa": "",
    "ex": "Have a good one—enjoy the rest of the week and don't work too hard!",
    "ex2": "As he headed out the door, he called back, 'Have a good one, everyone—see you Monday!'"
  },
  {
    "word": "catch you later",
    "zh": "回头见 / 等会儿再聊",
    "pos": "expr",
    "ipa": "",
    "ex": "Catch you later—I've got a meeting in five minutes but let's talk after.",
    "ex2": "She waved as she rushed off and said, 'Catch you later—I'll send you the details by email.'"
  },
  {
    "word": "see you around",
    "zh": "改天见 / 保持联系",
    "pos": "expr",
    "ipa": "",
    "ex": "See you around—don't be a stranger and let's keep in touch!",
    "ex2": "He smiled and said, 'See you around—hope things go well with the new position.'"
  },
  {
    "word": "until next time",
    "zh": "下次见",
    "pos": "expr",
    "ipa": "",
    "ex": "Until next time—it was great catching up and we should do it more often.",
    "ex2": "She hugged her friend goodbye and said, 'Until next time—let's not leave it so long!'"
  },
  {
    "word": "do me a favor",
    "zh": "帮我一个忙",
    "pos": "expr",
    "ipa": "",
    "ex": "Do me a favor and let me know when the delivery arrives at the office.",
    "ex2": "Can you do me a favor and check whether the invoice has been approved by the finance team?"
  },
  {
    "word": "I was wondering if",
    "zh": "我想问一下是否可以…",
    "pos": "expr",
    "ipa": "",
    "ex": "I was wondering if you'd be available for a quick call sometime this week.",
    "ex2": "I was wondering if it would be possible to extend the deadline by just a couple of days."
  },
  {
    "word": "any chance you could",
    "zh": "你有没有可能…",
    "pos": "expr",
    "ipa": "",
    "ex": "Any chance you could review the first draft before tomorrow's meeting?",
    "ex2": "Any chance you could send over the latest version of the contract before the end of today?"
  },
  {
    "word": "feel free to",
    "zh": "随便…/ 不用客气",
    "pos": "expr",
    "ipa": "",
    "ex": "Feel free to reach out if you have any questions or need any clarification.",
    "ex2": "Please feel free to share your honest feedback—we want to hear every perspective on this."
  },
  {
    "word": "be my guest",
    "zh": "请便 / 随你",
    "pos": "expr",
    "ipa": "",
    "ex": "'Can I take a look at the report?' 'Be my guest—it's right there on the desk.'",
    "ex2": "'Mind if I use the meeting room for an hour?' 'Be my guest—it's free until three o'clock.'"
  },
  {
    "word": "help yourself",
    "zh": "请随便吃喝 / 自己来",
    "pos": "expr",
    "ipa": "",
    "ex": "Help yourself to coffee and snacks—there's plenty for everyone.",
    "ex2": "She gestured to the spread of food and said, 'Please help yourself—there's more than enough.'"
  },
  {
    "word": "you've got this",
    "zh": "你能行的 / 加油",
    "pos": "expr",
    "ipa": "",
    "ex": "You've got this—take a deep breath, trust your preparation, and go for it!",
    "ex2": "She texted him just before his presentation: 'You've got this—you've worked so hard for this moment.'"
  },
  {
    "word": "keep it up",
    "zh": "继续保持 / 坚持下去",
    "pos": "expr",
    "ipa": "",
    "ex": "Keep it up—your progress over the last month has been really impressive.",
    "ex2": "The coach told the athletes, 'Keep it up—this level of dedication will pay off come race day.'"
  },
  {
    "word": "good for you",
    "zh": "太棒了 / 为你高兴",
    "pos": "expr",
    "ipa": "",
    "ex": "Good for you! Starting your own business takes real courage and determination.",
    "ex2": "'I finally finished that online course.' 'Good for you! All that late-night studying really paid off.'"
  },
  {
    "word": "way to go",
    "zh": "干得好 / 太厉害了",
    "pos": "expr",
    "ipa": "",
    "ex": "Way to go—you handled that difficult client call brilliantly under pressure!",
    "ex2": "The whole team erupted in applause and the manager shouted, 'Way to go, everyone—we did it!'"
  },
  {
    "word": "you nailed it",
    "zh": "你做到了 / 完美",
    "pos": "expr",
    "ipa": "",
    "ex": "You nailed it—the presentation was sharp, clear, and incredibly well-delivered.",
    "ex2": "After she finished performing, the whole room cheered and someone called out, 'You absolutely nailed it!'"
  },
  {
    "word": "you killed it",
    "zh": "你太厉害了 / 超棒",
    "pos": "expr",
    "ipa": "",
    "ex": "You killed it out there—that was one of the most confident pitches I've ever seen.",
    "ex2": "'How did the job interview go?' 'Really well—I think I killed it, honestly!'"
  },
  {
    "word": "don't worry about it",
    "zh": "别担心 / 没事的",
    "pos": "expr",
    "ipa": "",
    "ex": "Don't worry about it—these things happen and we'll sort it out together.",
    "ex2": "She apologised for being late, and he said, 'Don't worry about it—we've only just started.'"
  },
  {
    "word": "no big deal",
    "zh": "没什么大不了的 / 小事",
    "pos": "expr",
    "ipa": "",
    "ex": "It's no big deal—just resend the email with the correct attachment.",
    "ex2": "'I accidentally sent the wrong version.' 'No big deal—just let them know and send the right one.'"
  },
  {
    "word": "forget about it",
    "zh": "别放在心上 / 算了吧",
    "pos": "expr",
    "ipa": "",
    "ex": "Forget about it—what matters is that we learn from this and move on.",
    "ex2": "She kept apologising, and he finally said, 'Really, forget about it—it honestly doesn't bother me.'"
  },
  {
    "word": "work out",
    "zh": "解决 / 锻炼 / 结果是",
    "pos": "v",
    "ipa": "",
    "ex": "I'm confident this will work out—we just need to give it a little more time.",
    "ex2": "Things worked out better than anyone had expected after the new manager took over the project."
  },
  {
    "word": "carry out",
    "zh": "执行 / 实施",
    "pos": "v",
    "ipa": "",
    "ex": "Please make sure the instructions are carried out exactly as written.",
    "ex2": "The team has been carrying out a series of tests to verify the reliability of the new system."
  },
  {
    "word": "point out",
    "zh": "指出 / 提出",
    "pos": "v",
    "ipa": "",
    "ex": "I just wanted to point out that there's a small error on page three of the report.",
    "ex2": "She pointed out several inconsistencies in the data that had been overlooked during the initial review."
  },
  {
    "word": "find out",
    "zh": "查明 / 发现",
    "pos": "v",
    "ipa": "",
    "ex": "Can you find out when the shipment is expected to arrive at the warehouse?",
    "ex2": "She found out about the promotion through a colleague rather than hearing it directly from her manager."
  },
  {
    "word": "end up",
    "zh": "最终 / 结果（成为）",
    "pos": "v",
    "ipa": "",
    "ex": "If we don't act now, we'll end up missing the deadline completely.",
    "ex2": "After months of uncertainty, he ended up accepting the offer from the smaller company and never looked back."
  },
  {
    "word": "turn up",
    "zh": "出现 / 找到 / 调高",
    "pos": "v",
    "ipa": "",
    "ex": "I couldn't find my badge all morning, and then it turned up in my coat pocket.",
    "ex2": "Surprisingly, more volunteers than expected turned up on the day of the charity event."
  },
  {
    "word": "give up",
    "zh": "放弃",
    "pos": "v",
    "ipa": "",
    "ex": "Whatever you do, don't give up—the most challenging part is almost over.",
    "ex2": "She had almost given up on finding the right candidate when the perfect application arrived."
  },
  {
    "word": "pick up",
    "zh": "接人 / 拿起 / 学会 / 好转",
    "pos": "v",
    "ipa": "",
    "ex": "Can you pick up the documents from reception on your way to the third floor?",
    "ex2": "Sales have been picking up steadily since the new pricing structure was introduced last quarter."
  },
  {
    "word": "drop off",
    "zh": "送人下车 / 减少 / 睡着",
    "pos": "v",
    "ipa": "",
    "ex": "I'll drop off the signed contract at your office on my way to the meeting.",
    "ex2": "Attendance at the weekly sessions dropped off significantly after the initial enthusiasm faded."
  },
  {
    "word": "something came up",
    "zh": "有事情突然出现 / 临时有事",
    "pos": "expr",
    "ipa": "",
    "ex": "I'm sorry I can't make it—something came up at the last minute and I can't get away.",
    "ex2": "She had been planning to attend, but something came up that required her immediate attention."
  },
  {
    "word": "it slipped my mind",
    "zh": "我忘了 / 一时没想起来",
    "pos": "expr",
    "ipa": "",
    "ex": "I'm so sorry—sending that email completely slipped my mind this afternoon.",
    "ex2": "It had completely slipped her mind to book the meeting room, and now all the slots were taken."
  },
  {
    "word": "I lost track of time",
    "zh": "我忘了时间 / 一时入迷",
    "pos": "expr",
    "ipa": "",
    "ex": "Sorry I'm late—I was deep in a report and completely lost track of time.",
    "ex2": "She apologised to the client, explaining that she had lost track of time during a long internal call."
  },
  {
    "word": "I'm swamped",
    "zh": "我忙得不可开交",
    "pos": "expr",
    "ipa": "",
    "ex": "I'm swamped right now—can we push the review to tomorrow morning instead?",
    "ex2": "She replied to the email saying she was completely swamped and would get back to them by Friday."
  },
  {
    "word": "that's a bummer",
    "zh": "真遗憾 / 太糟了",
    "pos": "expr",
    "ipa": "",
    "ex": "That's a bummer—I was really looking forward to the team trip this weekend.",
    "ex2": "'The concert got cancelled.' 'That's such a bummer—we'd been planning this for months!'"
  },
  {
    "word": "what a shame",
    "zh": "真可惜 / 太遗憾了",
    "pos": "expr",
    "ipa": "",
    "ex": "What a shame you couldn't make it—the event was absolutely brilliant.",
    "ex2": "What a shame the project got shelved after all the hard work the team had put in."
  },
  {
    "word": "I can't help it",
    "zh": "我没办法 / 情不自禁",
    "pos": "expr",
    "ipa": "",
    "ex": "I can't help it—I always feel nervous before a big presentation, no matter how prepared I am.",
    "ex2": "She can't help worrying about the launch; she's been working on it for over a year."
  },
  {
    "word": "ASAP",
    "zh": "【网络缩写】as soon as possible / 尽快",
    "pos": "abbr.",
    "ipa": "",
    "ex": "Can you send me the updated file ASAP? We need it before the meeting.",
    "ex2": "The client has asked us to resolve the issue ASAP—let's prioritise this over everything else today."
  },
  {
    "word": "FYI",
    "zh": "【网络缩写】for your information / 供参考，仅供知悉",
    "pos": "abbr.",
    "ipa": "",
    "ex": "FYI, the meeting has been moved to Thursday at 3 PM.",
    "ex2": "FYI, I've already spoken to the vendor and they're aware of the delay—no need to contact them again."
  },
  {
    "word": "BTW",
    "zh": "【网络缩写】by the way / 顺便说一句",
    "pos": "abbr.",
    "ipa": "",
    "ex": "BTW, did you see the new design mockups the team shared?",
    "ex2": "BTW, I left the signed documents on your desk earlier—let me know if you need anything else."
  },
  {
    "word": "LMK",
    "zh": "【网络缩写】let me know / 告诉我，有消息通知我",
    "pos": "abbr.",
    "ipa": "",
    "ex": "LMK if you need any help with the report and I'll jump in.",
    "ex2": "LMK if that time works for you and I'll send the calendar invite right away."
  },
  {
    "word": "ETA",
    "zh": "【网络缩写】estimated time of arrival / 预计到达（完成）时间",
    "pos": "abbr.",
    "ipa": "",
    "ex": "What's the ETA on the new feature? The client is asking.",
    "ex2": "The logistics team confirmed the ETA for the shipment is Thursday afternoon, barring any delays."
  },
  {
    "word": "TBD",
    "zh": "【网络缩写】to be determined / 待定",
    "pos": "abbr.",
    "ipa": "",
    "ex": "The exact budget is still TBD — we'll confirm after next week's call.",
    "ex2": "The venue is TBD for now, but we'll send the final details at least a week before the event."
  },
  {
    "word": "TBC",
    "zh": "【网络缩写】to be confirmed / 待确认",
    "pos": "abbr.",
    "ipa": "",
    "ex": "Venue and time are TBC, but mark Thursday afternoon in your calendar.",
    "ex2": "The speaker lineup is TBC — we're still waiting to hear back from two of the keynote candidates."
  },
  {
    "word": "WIP",
    "zh": "【网络缩写】work in progress / 进行中，未完成",
    "pos": "abbr.",
    "ipa": "",
    "ex": "Heads up — that doc is still WIP, so don't share it externally yet.",
    "ex2": "The dashboard design is still WIP — the team expects to have a final version ready by end of week."
  },
  {
    "word": "OOO",
    "zh": "【网络缩写】out of office / 不在办公室，外出",
    "pos": "abbr.",
    "ipa": "",
    "ex": "I'll be OOO from Monday to Wednesday. Ping Sarah if it's urgent.",
    "ex2": "She's OOO this week at a conference — for anything urgent, please reach out to her deputy."
  },
  {
    "word": "WFH",
    "zh": "【网络缩写】work from home / 居家办公",
    "pos": "abbr.",
    "ipa": "",
    "ex": "I'm WFH today but available on Slack — just ping me anytime.",
    "ex2": "Half the team is WFH on Fridays, so we use video calls to stay connected and aligned."
  },
  {
    "word": "EOD",
    "zh": "【网络缩写】end of day / 今日下班前，今日截止",
    "pos": "abbr.",
    "ipa": "",
    "ex": "Can you get me your feedback on the proposal by EOD? Thanks.",
    "ex2": "All timesheets need to be submitted by EOD Friday — no exceptions for this week's payroll run."
  },
  {
    "word": "ICYMI",
    "zh": "【网络缩写】in case you missed it / 万一你没看到，防止你错过",
    "pos": "abbr.",
    "ipa": "",
    "ex": "ICYMI — we posted the new onboarding guide in the #resources channel.",
    "ex2": "ICYMI — the Q3 results presentation has been recorded and uploaded to the shared drive for everyone."
  },
  {
    "word": "TLDR",
    "zh": "【网络缩写】too long; didn't read / 太长没看，简而言之",
    "pos": "abbr.",
    "ipa": "",
    "ex": "TLDR: the project is on track, but we need two more weeks for testing.",
    "ex2": "TLDR: the report shows strong growth in Asia but declining performance in the European market."
  },
  {
    "word": "DM",
    "zh": "【网络缩写】direct message / 私信",
    "pos": "abbr.",
    "ipa": "",
    "ex": "Feel free to DM me if you have questions — happy to help.",
    "ex2": "She DMed him the confidential figures rather than sharing them in the group channel."
  },
  {
    "word": "AFAIK",
    "zh": "【网络缩写】as far as I know / 据我所知",
    "pos": "abbr.",
    "ipa": "",
    "ex": "AFAIK the deadline hasn't changed, but double-check with the PM.",
    "ex2": "AFAIK, no decision has been made yet — they're still evaluating the different options on the table."
  },
  {
    "word": "FWIW",
    "zh": "【网络缩写】for what it's worth / 仅供参考，不一定有用但说一下",
    "pos": "abbr.",
    "ipa": "",
    "ex": "FWIW, I think the simpler layout tested much better with users.",
    "ex2": "FWIW, I ran the numbers last week and the margin difference is actually smaller than it looks."
  },
  {
    "word": "LOL",
    "zh": "【网络缩写】laughing out loud / 哈哈，好笑",
    "pos": "abbr.",
    "ipa": "",
    "ex": "He sent a meme in the middle of the all-hands meeting — LOL 😂",
    "ex2": "She texted back 'LOL, I can't believe you actually said that to the CEO's face!'"
  },
  {
    "word": "LMAO",
    "zh": "【网络缩写】laughing my ass off / 笑死我了（比 LOL 更夸张）",
    "pos": "abbr.",
    "ipa": "",
    "ex": "LMAO he introduced himself to the CEO twice in the same day.",
    "ex2": "We were all LMAO when the presenter's slides accidentally had the wrong company logo on them."
  },
  {
    "word": "ROFL",
    "zh": "【网络缩写】rolling on the floor laughing / 笑到打滚（极度好笑）",
    "pos": "abbr.",
    "ipa": "",
    "ex": "Did you see that autocorrect fail? ROFL I can't stop laughing.",
    "ex2": "The blooper reel from the team video shoot had everyone ROFL — it was pure chaos on set."
  },
  {
    "word": "OMG",
    "zh": "【网络缩写】oh my god / 天哪，我的天",
    "pos": "abbr.",
    "ipa": "",
    "ex": "OMG they just announced a surprise day off tomorrow!",
    "ex2": "OMG, I just found out we hit a million users — the whole team is celebrating in the office right now!"
  },
  {
    "word": "IDK",
    "zh": "【网络缩写】I don't know / 我不知道，不确定",
    "pos": "abbr.",
    "ipa": "",
    "ex": "IDK, maybe we should just go with plan B and see how it goes?",
    "ex2": "IDK who approved that change — it wasn't discussed in any of the meetings I attended."
  },
  {
    "word": "IMO",
    "zh": "【网络缩写】in my opinion / 依我看，我个人觉得",
    "pos": "abbr.",
    "ipa": "",
    "ex": "IMO the second design is way cleaner — less clutter, easier to read.",
    "ex2": "IMO, we should have launched the beta version earlier and gathered user feedback from the start."
  },
  {
    "word": "IMHO",
    "zh": "【网络缩写】in my humble opinion / 依我拙见（比 IMO 更客气）",
    "pos": "abbr.",
    "ipa": "",
    "ex": "IMHO, we should run a small test before doing a full rollout.",
    "ex2": "IMHO, the pricing is a little too high for the current market — worth reconsidering before the launch."
  },
  {
    "word": "TBH",
    "zh": "【网络缩写】to be honest / 老实说，说实话",
    "pos": "abbr.",
    "ipa": "",
    "ex": "TBH I wasn't sure about the idea at first, but it's growing on me.",
    "ex2": "TBH, I think the original plan was better — the revisions made it more complicated without adding value."
  },
  {
    "word": "NGL",
    "zh": "【网络缩写】not gonna lie / 不骗你，说真的",
    "pos": "abbr.",
    "ipa": "",
    "ex": "NGL, that was one of the best presentations I've seen from the team.",
    "ex2": "NGL, I was nervous about taking on this role, but it's been the best decision I've ever made."
  },
  {
    "word": "SMH",
    "zh": "【网络缩写】shaking my head / 无语，摇头叹气",
    "pos": "abbr.",
    "ipa": "",
    "ex": "He hit reply-all and sent his lunch order to 300 people... SMH.",
    "ex2": "They missed the deadline for the third time this month — SMH, this can't keep happening."
  },
  {
    "word": "BRB",
    "zh": "【网络缩写】be right back / 马上回来，等一下",
    "pos": "abbr.",
    "ipa": "",
    "ex": "BRB — grabbing a coffee, back in five ☕",
    "ex2": "BRB — I need to take a quick call. Can everyone stay on the video until I'm back in two minutes?"
  },
  {
    "word": "GTG",
    "zh": "【网络缩写】got to go / 我得走了，先下了",
    "pos": "abbr.",
    "ipa": "",
    "ex": "GTG, my next call is starting. Catch you after lunch!",
    "ex2": "GTG — my train leaves in ten minutes. I'll follow up on everything we discussed tomorrow morning."
  },
  {
    "word": "AFK",
    "zh": "【网络缩写】away from keyboard / 暂时离开，不在电脑旁",
    "pos": "abbr.",
    "ipa": "",
    "ex": "Going AFK for lunch — back around 1:30. Leave me a message!",
    "ex2": "She went AFK for thirty minutes and came back to find forty unread messages waiting for her."
  },
  {
    "word": "NVM",
    "zh": "【网络缩写】never mind / 算了，没事了",
    "pos": "abbr.",
    "ipa": "",
    "ex": "NVM — I found the file myself, no need to send it now.",
    "ex2": "NVM about my earlier question — I just spoke to the team and they already have it covered."
  },
  {
    "word": "IRL",
    "zh": "【网络缩写】in real life / 现实中，线下",
    "pos": "abbr.",
    "ipa": "",
    "ex": "We've been on the same team for a year but never met IRL!",
    "ex2": "It's always great to finally meet collaborators IRL after months of working together remotely."
  },
  {
    "word": "FOMO",
    "zh": "【网络缩写】fear of missing out / 害怕错过，错过恐惧症",
    "pos": "abbr.",
    "ipa": "",
    "ex": "Seeing everyone's photos from the trip gave me serious FOMO.",
    "ex2": "She signed up for three events this weekend purely out of FOMO, and now she's completely exhausted."
  },
  {
    "word": "HMU",
    "zh": "【网络缩写】hit me up / 联系我，找我",
    "pos": "abbr.",
    "ipa": "",
    "ex": "If you're ever in Shanghai, HMU and we can grab dinner!",
    "ex2": "HMU if you hear about any good job openings — I'm actively looking and open to new opportunities."
  },
  {
    "word": "TMI",
    "zh": "【网络缩写】too much information / 信息量太大，说太多细节了",
    "pos": "abbr.",
    "ipa": "",
    "ex": "He described his dentist appointment in extreme detail — TMI, dude 😂",
    "ex2": "She started explaining every step of her morning routine in the group chat — TMI for a Monday!"
  },
  {
    "word": "GOAT",
    "zh": "【网络缩写】greatest of all time / 史上最强，封神级别",
    "pos": "abbr.",
    "ipa": "",
    "ex": "Serena Williams is the GOAT — no one else comes close.",
    "ex2": "The way she handled that negotiation was GOAT-level — calm, strategic, and completely in control."
  },
  {
    "word": "GG",
    "zh": "【网络缩写】good game / 好局；也用来表示认输或结束",
    "pos": "abbr.",
    "ipa": "",
    "ex": "GG everyone — tough match but we played well. Let's review tomorrow.",
    "ex2": "When the rival team scored the winning point in overtime, he just typed 'GG' and left the chat."
  },
  {
    "word": "FR",
    "zh": "【网络缩写】for real / 真的吗，认真的（表示强调或惊讶）",
    "pos": "abbr.",
    "ipa": "",
    "ex": "Wait, they cancelled the whole event? FR?? 😱",
    "ex2": "FR, I cannot believe we pulled that off with only two days of preparation — that was incredible."
  },
  {
    "word": "IYKYK",
    "zh": "【网络缩写】if you know, you know / 懂的都懂",
    "pos": "abbr.",
    "ipa": "",
    "ex": "That little noodle shop on the side street — IYKYK 🍜",
    "ex2": "Monday morning status updates before coffee... IYKYK 😅 — it's a special kind of suffering."
  }
]